local tb = {
	--{"地图1","地图2","地图3",......}------每行推荐3张地图，
    {"青云幻境","","",},
	{"灭神禁地第一层","灭神禁地第二层","灭神禁地第三层",},
	{"海底秘境第三层","海底秘境第二层","海底秘境第一层",},
	{"远古神殿第四层","远古神殿第三层","远古神殿第二层",},
	{"远古神殿第一层","王城2","B新龙城01",},
	{"兰陵津州","仙魔战场","灵台小镇",},
	{"毒密道2","毒密道1","雪地三",},
	{"雪地二","雪地一","竞技场5",},
	{"九重天","襄阳城野外","天下第一帮",},
	{"倚天剑台","树洞三层","树洞二层",},
	{"树洞一层","紫荆之巅","幽冥镇狱",},
	{"王城","御剑夺灵","悬浮三层",},
	{"悬浮二层","悬浮一层","沙漠三层",},
	{"沙漠二层","沙漠一层","逍遥门",},
	{"圣火殿","沙漠地宫三层","沙漠地宫二层",},
	{"沙漠地宫一层","秘籍出生点","清风寨",},
	{"蜀道剑阁4层","铁血魔宫三层","铁血魔宫二层",},
	{"铁血魔宫一层","星空之塔3层","星空之塔2层",},
	{"星空之塔1层","苗疆","南缰",},
	{"门派白驼山庄","迷宫打怪1","魔教总坛",},
	{"门派翠烟门","武林大会","剑冢",},
	{"门派比武","蛮夷秘牢","仙灵秘境",},
	{"新门派比武","监狱","结婚礼堂",},
	{"晶石群岛","黄金井","光明顶",},
	{"华山","古神谷","藏剑山庄",},
	{"帮会副本","古代神殿","昆仑顶峰",},
	{"帮会比武","拜月湖夜","拜火教据点",},
	{"西郊神殿五层","西郊神殿四层","西郊神殿三层",},
	{"西郊神殿二层","西郊神殿一层","流沙洞五层",},
	{"流沙洞三层","流沙洞二层",},
	{"古木虫渊2","古木虫渊1","北冥神殿地宫五层",},
	{"北冥神殿地宫四层","北冥神殿地宫三层","北冥神殿地宫二层",},
	{"北冥神殿地宫一层","雪域冰洞三层","雪域冰洞二层",},
	{"雪域冰洞一层","边境森林","西域",},
	{"星空3层","星空2层","星空1层",},
}


function main(npc,player)
	local msg = "\n       欢迎前往各大地图参观！\n\n\n"
	
	for k,v in ipairs(tb) do
		for i,j in ipairs(v) do
			msg = msg.."#POS<X:"..(200*i-200)..">##IMAGE1902700015##POS<X:"..(200*i-170)..">#<@jump#"..j.." *01*"..j..">"
		end
		msg = msg.."\n"
	end

	
	lualib:NPCTalkDetailEx(npc,player,msg,618,550)
	return ""
end

function jump(npc,player,map)
	local ret = lualib:Player_MapMove(player,map)
	
	if ret ~= true then
		return "跳地图失败"
	end
	return ""
end
