gQuestMap =
{
   {1016, "", "QuestAccomplish1016","", "*01*完成任务: 装备材料"},
   {1017, "QuestAccept1017", "","01*任务: 精炼", ""}
}
gQuestNum = table.getn(gQuestMap)
--[[
local job_table = {"战士", "法师", "道士"}
local equip_level = {10, 30, 40}
local exchange_table = {
                            {
                             {{{"御战护腕", 1}, {"御战护腕图样", 1}, {"野兽精元", 3}}, {{"御战戒指", 1}, {"御战戒指图样", 1}, {"野兽精元", 3}}, {{"御战头盔", 1}, {"御战头盔图样", 1}, {"野兽精元", 3}}},
                             {{{"铁战护腕", 1}, {"铁战护腕图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}, {{"铁战戒指", 1}, {"铁战戒指图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}, {{"铁战靴子", 1}, {"铁战靴子图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}},
                             {{{"圣武战靴",1 }, {"圣武战靴图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"圣武戒指",1 }, {"圣武戒指图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"圣武护腕",1 }, {"圣武护腕图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"圣武头盔",1 }, {"圣武头盔图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}},
                             --{{{"末日头盔", 1}, {"末日头盔图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"末日项链", 1}, {"末日项链图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"末日戒指", 1}, {"末日戒指图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"末日护腕", 1}, {"末日护腕图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"末日战靴", 1}, {"末日战靴图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}}
                            },
                            {
                             {{{"御魔护腕", 1}, {"御魔护腕图样", 1}, {"野兽精元", 3}}, {{"御魔戒指", 1}, {"御魔戒指图样", 1}, {"野兽精元", 3}}, {{"御魔头盔", 1}, {"御魔头盔图样", 1}, {"野兽精元", 3}}},
                             {{{"聚魂护腕", 1}, {"聚魂护腕图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}, {{"聚魂戒指", 1}, {"聚魂戒指图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}, {{"聚魂靴子", 1}, {"聚魂靴子图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}},
                             {{{"苍冥魔靴",1 }, {"苍冥魔靴图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"苍冥戒指",1 }, {"苍冥戒指图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"苍冥护腕",1 }, {"苍冥护腕图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"苍冥头盔",1 }, {"苍冥头盔图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}},
                             --{{{"血夜头盔", 1}, {"血夜头盔图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"血夜项链", 1}, {"血夜项链图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"血夜戒指", 1}, {"血夜戒指图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"血夜护腕", 1}, {"血夜护腕图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"血夜魔靴", 1}, {"血夜魔靴图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}}
                            },
                            {
                             {{{"御道护腕", 1}, {"御道护腕图样", 1}, {"野兽精元", 3}}, {{"御道戒指", 1}, {"御道戒指图样", 1}, {"野兽精元", 3}}, {{"御道头盔", 1}, {"御道头盔图样", 1}, {"野兽精元", 3}}},
                             {{{"玄光护腕", 1}, {"玄光护腕图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}, {{"玄光戒指", 1}, {"玄光戒指图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}, {{"玄光靴子", 1}, {"玄光靴子图样", 1}, {"骷髅精元", 50}, {"僵尸精元", 60}, {"牛魔精元", 50}}},
                             {{{"飞尘道靴",1 }, {"飞尘道靴图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"飞尘戒指",1 }, {"飞尘戒指图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"飞尘护腕",1 }, {"飞尘护腕图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}, {{"飞尘头盔",1 }, {"飞尘头盔图样", 1}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}}},
                             --{{{"天劫头盔", 1}, {"天劫头盔图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"天劫项链", 1}, {"天劫项链图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"天劫戒指", 1}, {"天劫戒指图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"天劫护腕", 1}, {"天劫护腕图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}, {{"天劫道靴", 1}, {"天劫道靴图样", 1}, {"树妖精元", 750}, {"傀儡精元", 900}, {"魔人精元", 900}}}
                            },
                            {
                             {{{"赤峰战甲(男)", 1}, {"赤峰战甲图样", 1}, {"野兽精元", 450}, {"骷髅精元", 450}, {"僵尸精元", 450}, {"牛魔精元", 450}, {"树妖精元", 450}, {"傀儡精元", 450}, {"魔人精元", 450}},
                              {{"赤峰战甲(女)", 1}, {"赤峰战甲图样", 1}, {"野兽精元", 450}, {"骷髅精元", 450}, {"僵尸精元", 450}, {"牛魔精元", 450}, {"树妖精元", 450}, {"傀儡精元", 450}, {"魔人精元", 450}},
                              {{"阎罗长袍(男)", 1}, {"阎罗长袍图样", 1}, {"野兽精元", 450}, {"骷髅精元", 450}, {"僵尸精元", 450}, {"牛魔精元", 450}, {"树妖精元", 450}, {"傀儡精元", 450}, {"魔人精元", 450}},
                              {{"阎罗长袍(女)", 1}, {"阎罗长袍图样", 1}, {"野兽精元", 450}, {"骷髅精元", 450}, {"僵尸精元", 450}, {"牛魔精元", 450}, {"树妖精元", 450}, {"傀儡精元", 450}, {"魔人精元", 450}},
                              {{"光明道袍(男)", 1}, {"光明道袍图样", 1}, {"野兽精元", 450}, {"骷髅精元", 450}, {"僵尸精元", 450}, {"牛魔精元", 450}, {"树妖精元", 450}, {"傀儡精元", 450}, {"魔人精元", 450}},
                              {{"光明道袍(女)", 1}, {"光明道袍图样", 1}, {"野兽精元", 450}, {"骷髅精元", 450}, {"僵尸精元", 450}, {"牛魔精元", 450}, {"树妖精元", 450}, {"傀儡精元", 450}, {"魔人精元", 450}},
                              --{{"血色战甲(男)", 1}, {"血色战甲图样", 1}, {"野兽精元", 1000}, {"骷髅精元", 1000}, {"僵尸精元", 1000}, {"牛魔精元", 1000}, {"树妖精元", 1000}, {"傀儡精元", 1000}, {"魔人精元", 1000}},
                              --{{"血色战甲(女)", 1}, {"血色战甲图样", 1}, {"野兽精元", 1000}, {"骷髅精元", 1000}, {"僵尸精元", 1000}, {"牛魔精元", 1000}, {"树妖精元", 1000}, {"傀儡精元", 1000}, {"魔人精元", 1000}},
                              --{{"魔灵长袍(男)", 1}, {"魔灵长袍图样", 1}, {"野兽精元", 1000}, {"骷髅精元", 1000}, {"僵尸精元", 1000}, {"牛魔精元", 1000}, {"树妖精元", 1000}, {"傀儡精元", 1000}, {"魔人精元", 1000}},
                              --{{"魔灵长袍(女)", 1}, {"魔灵长袍图样", 1}, {"野兽精元", 1000}, {"骷髅精元", 1000}, {"僵尸精元", 1000}, {"牛魔精元", 1000}, {"树妖精元", 1000}, {"傀儡精元", 1000}, {"魔人精元", 1000}},
                              --{{"天芒道袍(男)", 1}, {"天芒道袍图样", 1}, {"野兽精元", 1000}, {"骷髅精元", 1000}, {"僵尸精元", 1000}, {"牛魔精元", 1000}, {"树妖精元", 1000}, {"傀儡精元", 1000}, {"魔人精元", 1000}},
                              --{{"天芒道袍(女)", 1}, {"天芒道袍图样", 1}, {"野兽精元", 1000}, {"骷髅精元", 1000}, {"僵尸精元", 1000}, {"牛魔精元", 1000}, {"树妖精元", 1000}, {"傀儡精元", 1000}, {"魔人精元", 1000}}
							  }
                            },
                            {
                            {{{"审判    ", 1}, {"审判图样", 1}, {"野兽精元", 200}, {"骷髅精元", 200}, {"僵尸精元", 200}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}, {"魔人精元", 200}},
                             {{"囚龙    ", 1}, {"囚龙图样", 1}, {"野兽精元", 200}, {"骷髅精元", 200}, {"僵尸精元", 200}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}, {"魔人精元", 200}},
                             {{"忘机    ", 1}, {"忘机图样", 1}, {"野兽精元", 200}, {"骷髅精元", 200}, {"僵尸精元", 200}, {"牛魔精元", 200}, {"树妖精元", 200}, {"傀儡精元", 200}, {"魔人精元", 200}},
                             --{{"十杀    ", 1}, {"十杀图样", 1}, {"野兽精元", 500}, {"骷髅精元", 500}, {"僵尸精元", 500}, {"牛魔精元", 500}, {"树妖精元", 500}, {"傀儡精元", 500}, {"魔人精元", 500}},
                             --{{"龙渊    ", 1}, {"龙渊图样", 1}, {"野兽精元", 500}, {"骷髅精元", 500}, {"僵尸精元", 500}, {"牛魔精元", 500}, {"树妖精元", 500}, {"傀儡精元", 500}, {"魔人精元", 500}},
                             --{{"天瀑    ", 1}, {"天瀑图样", 1}, {"野兽精元", 500}, {"骷髅精元", 500}, {"僵尸精元", 500}, {"牛魔精元", 500}, {"树妖精元", 500}, {"傀儡精元", 500}, {"魔人精元", 500}},
                             --{{"断空    ", 1}, {"断空图样", 1}, {"野兽精元", 1200}, {"骷髅精元", 1200}, {"僵尸精元", 1200}, {"牛魔精元", 1200}, {"树妖精元", 1200}, {"傀儡精元", 1200}, {"魔人精元", 1200}},
                             --{{"碎空    ", 1}, {"碎空图样", 1}, {"野兽精元", 1200}, {"骷髅精元", 1200}, {"僵尸精元", 1200}, {"牛魔精元", 1200}, {"树妖精元", 1200}, {"傀儡精元", 1200}, {"魔人精元", 1200}},
                             --{{"噬空    ", 1}, {"噬空图样", 1}, {"野兽精元", 1200}, {"骷髅精元", 1200}, {"僵尸精元", 1200}, {"牛魔精元", 1200}, {"树妖精元", 1200}, {"傀儡精元", 1200}, {"魔人精元", 1200}}
							 }
                            }
                        }
]]--
function main(npc, player)
    local msg = "勇士！请问我能帮你些什么呢？ 所谓神兵在手，天下我有，如果你能收集到材料，老夫可以帮你打造出绝世神兵！\n \n"
	for i, v in ipairs(gQuestMap) do
        if v[2] ~= "" then
            if lualib:CanAcceptQuest(player, v[1]) == true then
                msg = msg.."<@"..v[2].." "..v[4]..">\n"
            end
        end

        if v[3] ~= "" then
            if lualib:CanAccomplishQuest(player, v[1]) == true then
                msg = msg.."<@"..v[3].." "..v[5]..">\n"
            end
        end
    end
--    msg = msg.."<@suit *01*打造套装>\n"
--    msg = msg.."<@armour *01*打造神甲>\n"
--    msg = msg.."<@weaponry *01*打造神兵>\n"
--    msg = msg.."<@leave *01*「离开」>\n"
    return msg
end
--[[
function armour(npc, player)
    local msg = ""
    for i = 1, table.getn(exchange_table[4][1]) do
        msg = msg.."<@make_equip_complete#4#1#"..i.." *01*"..exchange_table[4][1][i][1][1]..">"
        msg = msg.."    "
    end
    msg = msg.."\n"
    msg = msg.."<@main *01*「返回」>"
    return msg
end

function weaponry(npc, player)
    local msg = ""
    for i = 1, table.getn(exchange_table[5][1]) do
        msg = msg.."<@make_equip_complete#5#1#"..i.." *01*"..exchange_table[5][1][i][1][1]..">"
    end
    msg = msg.."\n  \n"
    msg = msg.."<@main *01*「返回」>"
    return msg
end

function suit(npc, player)
    local msg = ""
    for i = 1, table.getn(job_table) do
        msg = msg.."<@make#"..i.." *01*"..job_table[i].."套装>"
        msg = msg.."    "
    end
    msg = msg.."\n"
    msg = msg.."<@main *01*「返回」>"
    return msg
end

function make(npc, player, job)
    local msg = "请选择你要打造的装备等级：\n"
    for i = 1, table.getn(equip_level) do
        msg = msg.."<@make_equip#"..job.."#"..i.." *01*"..equip_level[i].."套装>\n"
    end
    msg = msg.."<@suit *01*「返回」>"
    return msg
end

function make_equip(npc, player, job, level)
    local msg = "请选择你要打造的装备：\n"
    for i = 1, table.getn(exchange_table[tonumber(job)][tonumber(level)]) do
        msg = msg.."<@make_equip_complete#"..job.."#"..level.."#"..i.." *01*"..exchange_table[tonumber(job)][tonumber(level)][i][1][1]..">\n"
    end
    msg = msg.."<@make#"..job.." *01*「返回」>"
    return msg
end

function make_equip_complete(npc, player, job, level, site)
    local msg = "打造"..trim(exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][1][1]).."需要"..
                exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][2][2].."张"..
                exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][2][1]
    for i = 3, table.getn(exchange_table[tonumber(job)][tonumber(level)][tonumber(site)]) do
        msg = msg.."、"..exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][i][2].."个"..
              exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][i][1]
    end
    msg = msg.."。你「确定」要打造吗？\n"
    msg = msg.."<@make_equip_final#"..job.."#"..level.."#"..site.." *01*我要打造>\n"
    if tonumber(job) <= 3 then
        msg = msg.."<@make_equip#"..job.."#"..level.." *01*「返回」>\n"
    elseif tonumber(job) == 4 then
        msg = msg.."<@armour *01*「返回」>\n"
    elseif tonumber(job) == 5 then
        msg = msg.."<@weaponry *01*「返回」>\n"
    end
    return msg
end

function make_equip_final(npc, player, job, level, site)
    local name_table = {}
    local count_table = {}
    local bind_table = {}
    local opr_table = {}
    for i = 1, table.getn(exchange_table[tonumber(job)][tonumber(level)][tonumber(site)]) do
        name_table[i] = trim(exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][i][1])
        count_table[i] = exchange_table[tonumber(job)][tonumber(level)][tonumber(site)][i][2]
        bind_table[i] = 0
        if i == 1 then
            opr_table[i] = 0
        else
            opr_table[i] = 1
        end
    end
    if not lualib:Player_ItemRequest(player, name_table, count_table, bind_table, opr_table, "事务操作：套装「兑换」", player) then
        return "装备打造失败，材料不足或背包已满！"
    end
    return "打造成功！"
end

function leave(npc, player)
    return ""
end

function trim(s)
    return (string.gsub(s, "^%s*(.-)%s*$", "%1"))
end
]]--

--------1016交

function QuestAccomplish1016(npc, player)
    msg = "我可以打造出适合各种职业的装备，绝对比你在市面上见到的装备属性好得多！但是打造装备极为麻烦还要消耗大量的材料，需要怪物的精元和装备的图样相结合，才能成功打造出装备。\n \n"
    msg = msg.."<@Accomplish1016a *01* 打造装备需要精元和装备图样>\n"
    return msg
end

function Accomplish1016a(npc, player)
    msg = "所有精英怪物都会爆精元，而BOSS会产出装备图样。当然，部分挖肉怪和宝箱也会产出这些好东西哦！\n \n"
    msg = msg.."<@Accomplish1016b *01* 精英怪、BOSS怪、特殊挖肉怪、宝箱都会产出装备材料>\n"
    return msg
end

function Accomplish1016b(npc, player)
    if lualib:AccomplishQuest(player, 1016, 0) == true then
        msg = "打造神兵需要大量的材料，去收集吧！\n \n"
		msg = msg.."<@QuestAccept1017 *01* 知道了，接取任务：精炼>\n" 
		return msg
    else
        msg = "任务失败\n \n"
		msg = msg.."<@leave *01*我知道了>\n" 
		return msg
    end
end


--------1017接
--[[
function QuestAccept1017(npc,player)
    msg = "在你成功打造好装备后，若想将装备再提升一个档次，可以去精炼大师那里提升装备的属性\n \n"
	msg = msg.."<@Accept1017 *01* 去找精炼大师>\n"
	return msg
end

function Accept1017(npc, player)
    if lualib:AcceptQuest(player, 1017) == true then
        return "去精炼大师那了解精炼"
    else
        return "任务接取失败"
    end
end	
]]--