local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)
require("system/logic_def_lua")
require("system/serializer")

zhuangb_table = 
        {
            ["古藤棍"] = 1000, 
            ["木棍"] = 1000, 
            ["新手之剑"] = 1000, 
            ["短剑"] = 1000, 
            ["长刀"] = 1000, 
            ["新手长刀"] = 1000, 
            ["砍柴斧"] = 1000, 
            ["蛮荒长刀"] = 1000, 
            ["上弦"] = 1000, 
            ["夜叉矛"] = 1000, 
            ["精钢剑"] = 1000, 
            ["玄铁刀"] = 1000, 
            ["斩魄刀"] = 1000, 
            ["镇魔剑"] = 1000, 
            ["邀月法杖"] = 1000, 
            ["斗魂"] = 1000, 
            ["鬼噬"] = 1000, 
            ["天玄剑"] = 1000, 
            ["魔灵法杖"] = 1000, 
            ["审判"] = 1000, 
            ["忘机"] = 1000, 
            ["囚龙"] = 1000, 
            ["审判(极)"] = 1001, 
            ["忘机(极)"] = 1001, 
            ["囚龙(极)"] = 1001, 
            ["审判(珍)"] = 1002, 
            ["忘机(珍)"] = 1002, 
            ["囚龙(珍)"] = 1002, 
            ["矿镐"] = 1000, 
            ["十杀"] = 1001, 
            ["龙渊"] = 1001, 
            ["天瀑"] = 1001, 
            ["十杀(极)"] = 1002, 
            ["龙渊(极)"] = 1002, 
            ["天瀑(极)"] = 1002, 
            ["十杀(珍)"] = 1003, 
            ["龙渊(珍)"] = 1003, 
            ["天瀑(珍)"] = 1003, 
            ["神歌"] = 1000, 
            ["噬空"] = 1003, 
            ["碎空"] = 1003, 
            ["断空"] = 1003, 
            ["噬空(极)"] = 1004, 
            ["碎空(极)"] = 1004, 
            ["断空(极)"] = 1004, 
            ["噬空(珍)"] = 1006, 
            ["碎空(珍)"] = 1006, 
            ["断空(珍)"] = 1006, 
            ["噬空(绝)"] = 1009, 
            ["碎空(绝)"] = 1009, 
            ["断空(绝)"] = 1009, 
            ["噬空(神)"] = 1013, 
            ["碎空(神)"] = 1013, 
            ["断空(神)"] = 1013, 
            ["帝释"] = 1010, 
            ["残虹"] = 1010, 
            ["无常"] = 1010, 
            ["帝释(极)"] = 1012, 
            ["残虹(极)"] = 1012, 
            ["无常(极)"] = 1012, 
            ["帝释(珍)"] = 1015, 
            ["残虹(珍)"] = 1015, 
            ["无常(珍)"] = 1015, 
            ["帝释(绝)"] = 1019, 
            ["残虹(绝)"] = 1019, 
            ["无常(绝)"] = 1019, 
            ["帝释(神)"] = 1024, 
            ["残虹(神)"] = 1024, 
            ["无常(神)"] = 1024, 
            ["十殿阎罗"] = 1020, 
            ["七劫浮屠"] = 1020, 
            ["赤霄白帝"] = 1020, 
            ["十殿阎罗(极)"] = 1023, 
            ["七劫浮屠(极)"] = 1023, 
            ["赤霄白帝(极)"] = 1023, 
            ["十殿阎罗(珍)"] = 1027, 
            ["七劫浮屠(珍)"] = 1027, 
            ["赤霄白帝(珍)"] = 1027, 
            ["十殿阎罗(绝)"] = 1032, 
            ["七劫浮屠(绝)"] = 1032, 
            ["赤霄白帝(绝)"] = 1032, 
            ["十殿阎罗(神)"] = 1038, 
            ["七劫浮屠(神)"] = 1038, 
            ["赤霄白帝(神)"] = 1038, 
            ["罡风怒破"] = 1050, 
            ["长空瓣轮"] = 1050, 
            ["苍天梢月"] = 1050, 
            ["罡风怒破(极)"] = 1054, 
            ["长空瓣轮(极)"] = 1054, 
            ["苍天梢月(极)"] = 1054, 
            ["罡风怒破(珍)"] = 1059, 
            ["长空瓣轮(珍)"] = 1059, 
            ["苍天梢月(珍)"] = 1059, 
            ["罡风怒破(绝)"] = 1065, 
            ["长空瓣轮(绝)"] = 1065, 
            ["苍天梢月(绝)"] = 1065, 
            ["罡风怒破(神)"] = 1072, 
            ["长空瓣轮(神)"] = 1072, 
            ["苍天梢月(神)"] = 1072, 
            ["勇士头盔"] = 1000, 
            ["黄金头盔"] = 1000, 
            ["阎魔头盔"] = 1000, 
            ["魔化面具"] = 1000, 
            ["新手头盔"] = 1000, 
            ["麒麟战盔"] = 1000, 
            ["龙牙面具"] = 1000, 
            ["无魂头盔"] = 1000, 
            ["魅影战盔"] = 1000, 
            ["天邪头盔"] = 1000, 
            ["龙元道盔"] = 1000, 
            ["血魂头盔"] = 1000, 
            ["冰魄头盔"] = 1000, 
            ["月殇头盔"] = 1000, 
            ["钢盔"] = 1000, 
            ["铁头盔"] = 1000, 
            ["魔法头盔"] = 1000, 
            ["蛟甲头盔"] = 1000, 
            ["黑暗头盔"] = 1000, 
            ["幽灵面具"] = 1000, 
            ["御战头盔"] = 1000, 
            ["御魔头盔"] = 1000, 
            ["御道头盔"] = 1000, 
            ["圣武头盔"] = 1001, 
            ["苍冥头盔"] = 1001, 
            ["飞尘头盔"] = 1001, 
            ["末日头盔"] = 1003, 
            ["血夜魔盔"] = 1003, 
            ["天劫道盔"] = 1003, 
            ["疾雷头盔"] = 1010, 
            ["火灵头盔"] = 1010, 
            ["云扬头盔"] = 1010, 
            ["天怒头盔"] = 1020, 
            ["深渊头盔"] = 1020, 
            ["四象头盔"] = 1020, 
            ["逐光头冠"] = 1050, 
            ["战龙头盔"] = 1050, 
            ["逍遥道冠"] = 1050, 
            ["黄金手镯"] = 1000, 
            ["骷髅手套"] = 1000, 
            ["奥普手镯"] = 1000, 
            ["龙牙手镯"] = 1000, 
            ["境魂护腕"] = 1000, 
            ["幻邪手镯"] = 1000, 
            ["新手护腕"] = 1000, 
            ["魔炫护腕"] = 1000, 
            ["紫炎护腕"] = 1000, 
            ["天翼手镯"] = 1000, 
            ["麒煌护腕"] = 1000, 
            ["七炫护腕"] = 1000, 
            ["上玄手镯"] = 1000, 
            ["小护腕"] = 1000, 
            ["皮手套"] = 1000, 
            ["神力护腕"] = 1000, 
            ["小手镯"] = 1000, 
            ["铁手镯"] = 1000, 
            ["大手镯"] = 1000, 
            ["骨甲护腕"] = 1000, 
            ["符文手镯"] = 1000, 
            ["水晶手镯"] = 1000, 
            ["战术手镯"] = 1000, 
            ["法术手镯"] = 1000, 
            ["道术手镯"] = 1000, 
            ["坚壁护腕"] = 1000, 
            ["重型手镯"] = 1000, 
            ["毒蝎手镯"] = 1000, 
            ["秘银手镯"] = 1000, 
            ["铁齿护腕"] = 1000, 
            ["精钢手镯"] = 1000, 
            ["魔王手镯"] = 1000, 
            ["灵石手镯"] = 1000, 
            ["御战护腕"] = 1000, 
            ["御魔护腕"] = 1000, 
            ["御道护腕"] = 1000, 
            ["铁战护腕"] = 1000, 
            ["聚魂护腕"] = 1000, 
            ["玄光护腕"] = 1000, 
            ["圣武护腕"] = 1001, 
            ["苍冥护腕"] = 1001, 
            ["飞尘护腕"] = 1001, 
            ["末日护腕"] = 1003, 
            ["血夜护腕"] = 1003, 
            ["天劫护腕"] = 1003, 
            ["疾雷护腕(神)"] = 1010, 
            ["火灵护腕(神)"] = 1010, 
            ["云扬护腕(神)"] = 1010, 
            ["疾雷护腕(圣)"] = 1010, 
            ["火灵护腕(圣)"] = 1010, 
            ["云扬护腕(圣)"] = 1010, 
            ["天怒护腕(神)"] = 1020, 
            ["深渊护腕(神)"] = 1020, 
            ["四象护腕(神)"] = 1020, 
            ["天怒护腕(圣)"] = 1020, 
            ["深渊护腕(圣)"] = 1020, 
            ["四象护腕(圣)"] = 1020, 
            ["逐光护腕"] = 1050, 
            ["战龙护腕"] = 1050, 
            ["逍遥手镯"] = 1050, 
            ["麻布衣(男)"] = 1000, 
            ["麻布衣(女)"] = 1000, 
            ["新手之衣(男)"] = 1000, 
            ["新手之衣(女)"] = 1000, 
            ["圣诞时装(男)"] = 1000, 
            ["圣诞时装(女)"] = 1000, 
            ["新手皮甲(男)"] = 1000, 
            ["新手皮甲(女)"] = 1000, 
            ["轻型战衣(男)"] = 1000, 
            ["轻型战衣(女)"] = 1000, 
            ["轻便铠甲(男)"] = 1000, 
            ["轻便铠甲(女)"] = 1000, 
            ["见习法师袍(男)"] = 1000, 
            ["见习法师袍(女)"] = 1000, 
            ["乾坤道衣(男)"] = 1000, 
            ["乾坤道衣(女)"] = 1000, 
            ["元灵铠甲(男)"] = 1000, 
            ["元灵铠甲(女)"] = 1000, 
            ["紫绸长袍(男)"] = 1000, 
            ["紫绸长袍(女)"] = 1000, 
            ["天心道衣(男)"] = 1000, 
            ["天心道衣(女)"] = 1000, 
            ["黄金铠甲(男)"] = 1000, 
            ["黄金铠甲(女)"] = 1000, 
            ["魔力法袍(男)"] = 1000, 
            ["魔力法袍(女)"] = 1000, 
            ["降魔道衣(男)"] = 1000, 
            ["降魔道衣(女)"] = 1000, 
            ["斗士铠甲(男)"] = 1001, 
            ["斗士铠甲(女)"] = 1001, 
            ["灵魂法衣(男)"] = 1001, 
            ["灵魂法衣(女)"] = 1001, 
            ["护体道袍(男)"] = 1001, 
            ["护体道袍(女)"] = 1001, 
            ["赤峰战甲(男)"] = 1003, 
            ["赤峰战甲(女)"] = 1003, 
            ["阎罗长袍(男)"] = 1003, 
            ["阎罗长袍(女)"] = 1003, 
            ["光明道袍(男)"] = 1003, 
            ["光明道袍(女)"] = 1003, 
            ["赤峰战甲·极(男)"] = 1004, 
            ["赤峰战甲·极(女)"] = 1004, 
            ["阎罗长袍·极(男)"] = 1004, 
            ["阎罗长袍·极(女)"] = 1004, 
            ["光明道袍·极(男)"] = 1004, 
            ["光明道袍·极(女)"] = 1004, 
            ["赤峰战甲·珍(男)"] = 1006, 
            ["赤峰战甲·珍(女)"] = 1006, 
            ["阎罗长袍·珍(男)"] = 1006, 
            ["阎罗长袍·珍(女)"] = 1006, 
            ["光明道袍·珍(男)"] = 1006, 
            ["光明道袍·珍(女)"] = 1006, 
            ["赤峰战甲·绝(男)"] = 1009, 
            ["赤峰战甲·绝(女)"] = 1009, 
            ["阎罗长袍·绝(男)"] = 1009, 
            ["阎罗长袍·绝(女)"] = 1009, 
            ["光明道袍·绝(男)"] = 1009, 
            ["光明道袍·绝(女)"] = 1009, 
            ["赤峰战甲·神(男)"] = 1013, 
            ["赤峰战甲·神(女)"] = 1013, 
            ["阎罗长袍·神(男)"] = 1013, 
            ["阎罗长袍·神(女)"] = 1013, 
            ["光明道袍·神(男)"] = 1013, 
            ["光明道袍·神(女)"] = 1013, 
            ["百裂战甲(男)"] = 1010, 
            ["百裂战甲(女)"] = 1010, 
            ["圣灵法衣(男)"] = 1010, 
            ["圣灵法衣(女)"] = 1010, 
            ["太玄道袍(男)"] = 1010, 
            ["太玄道袍(女)"] = 1010, 
            ["百裂战甲·极(男)"] = 1012, 
            ["百裂战甲·极(女)"] = 1012, 
            ["圣灵法衣·极(男)"] = 1012, 
            ["圣灵法衣·极(女)"] = 1012, 
            ["太玄道袍·极(男)"] = 1012, 
            ["太玄道袍·极(女)"] = 1012, 
            ["百裂战甲·珍(男)"] = 1015, 
            ["百裂战甲·珍(女)"] = 1015, 
            ["圣灵法衣·珍(男)"] = 1015, 
            ["圣灵法衣·珍(女)"] = 1015, 
            ["太玄道袍·珍(男)"] = 1015, 
            ["太玄道袍·珍(女)"] = 1015, 
            ["百裂战甲·绝(男)"] = 1019, 
            ["百裂战甲·绝(女)"] = 1019, 
            ["圣灵法衣·绝(男)"] = 1019, 
            ["圣灵法衣·绝(女)"] = 1019, 
            ["太玄道袍·绝(男)"] = 1019, 
            ["太玄道袍·绝(女)"] = 1019, 
            ["百裂战甲·神(男)"] = 1024, 
            ["百裂战甲·神(女)"] = 1024, 
            ["圣灵法衣·神(男)"] = 1024, 
            ["圣灵法衣·神(女)"] = 1024, 
            ["太玄道袍·神(男)"] = 1024, 
            ["太玄道袍·神(女)"] = 1024, 
            ["龙鳞战甲(男)"] = 1020, 
            ["龙鳞战甲(女)"] = 1020, 
            ["璃梦法袍(男)"] = 1020, 
            ["璃梦法袍(女)"] = 1020, 
            ["天鼎道袍(男)"] = 1020, 
            ["天鼎道袍(女)"] = 1020, 
            ["龙鳞战甲·极(男)"] = 1023, 
            ["龙鳞战甲·极(女)"] = 1023, 
            ["璃梦法袍·极(男)"] = 1023, 
            ["璃梦法袍·极(女)"] = 1023, 
            ["天鼎道袍·极(男)"] = 1023, 
            ["天鼎道袍·极(女)"] = 1023, 
            ["龙鳞战甲·珍(男)"] = 1027, 
            ["龙鳞战甲·珍(女)"] = 1027, 
            ["璃梦法袍·珍(男)"] = 1027, 
            ["璃梦法袍·珍(女)"] = 1027, 
            ["天鼎道袍·珍(男)"] = 1027, 
            ["天鼎道袍·珍(女)"] = 1027, 
            ["龙鳞战甲·绝(男)"] = 1032, 
            ["龙鳞战甲·绝(女)"] = 1032, 
            ["璃梦法袍·绝(男)"] = 1032, 
            ["璃梦法袍·绝(女)"] = 1032, 
            ["天鼎道袍·绝(男)"] = 1032, 
            ["天鼎道袍·绝(女)"] = 1032, 
            ["龙鳞战甲·神(男)"] = 1038, 
            ["龙鳞战甲·神(女)"] = 1038, 
            ["璃梦法袍·神(男)"] = 1038, 
            ["璃梦法袍·神(女)"] = 1038, 
            ["天鼎道袍·神(男)"] = 1038, 
            ["天鼎道袍·神(女)"] = 1038, 
            ["流萤暮影"] = 1050, 
            ["流萤暮露"] = 1050, 
            ["鹤流瑶羽"] = 1050, 
            ["鹤流瑶纱"] = 1050, 
            ["无痕天饮"] = 1050, 
            ["无痕天曲"] = 1050, 
            ["流萤暮影(极)"] = 1054, 
            ["流萤暮露(极)"] = 1054, 
            ["鹤流瑶羽(极)"] = 1054, 
            ["鹤流瑶纱(极)"] = 1054, 
            ["无痕天饮(极)"] = 1054, 
            ["无痕天曲(极)"] = 1054, 
            ["流萤暮影(珍)"] = 1059, 
            ["流萤暮露(珍)"] = 1059, 
            ["鹤流瑶羽(珍)"] = 1059, 
            ["鹤流瑶纱(珍)"] = 1059, 
            ["无痕天饮(珍)"] = 1059, 
            ["无痕天曲(珍)"] = 1059, 
            ["流萤暮影(绝)"] = 1065, 
            ["流萤暮露(绝)"] = 1065, 
            ["鹤流瑶羽(绝)"] = 1065, 
            ["鹤流瑶纱(绝)"] = 1065, 
            ["无痕天饮(绝)"] = 1065, 
            ["无痕天曲(绝)"] = 1065, 
            ["流萤暮影(神)"] = 1072, 
            ["流萤暮露(神)"] = 1072, 
            ["鹤流瑶羽(神)"] = 1072, 
            ["鹤流瑶纱(神)"] = 1072, 
            ["无痕天饮(神)"] = 1072, 
            ["无痕天曲(神)"] = 1072, 
            ["新手之鞋"] = 1000, 
            ["圣诞礼袜(鞋)"] = 1000, 
            ["草鞋"] = 1000, 
            ["布鞋"] = 1000, 
            ["牛皮鞋"] = 1000, 
            ["紫霞靴"] = 1000, 
            ["阴阳靴"] = 1000, 
            ["浮云"] = 1000, 
            ["铁战靴子"] = 1000, 
            ["聚魂靴子"] = 1000, 
            ["玄光靴子"] = 1000, 
            ["圣武战靴"] = 1001, 
            ["苍冥魔靴"] = 1001, 
            ["飞尘道靴"] = 1001, 
            ["末日战靴"] = 1003, 
            ["血夜魔靴"] = 1003, 
            ["天劫道靴"] = 1003, 
            ["逐波天靴"] = 1000, 
            ["疾雷战靴"] = 1010, 
            ["火灵魔靴"] = 1010, 
            ["云扬道靴"] = 1010, 
            ["绝影天履"] = 1000, 
            ["天怒战靴"] = 1020, 
            ["深渊魔靴"] = 1020, 
            ["四象道靴"] = 1020, 
            ["逐光霞履"] = 1050, 
            ["飞龙战靴"] = 1050, 
            ["逍遥游梦"] = 1050, 
            ["绿玉项链"] = 1000, 
            ["奥普项链"] = 1000, 
            ["唤魔铃铛"] = 1000, 
            ["荧光项链"] = 1000, 
            ["灵光石项链"] = 1000, 
            ["新手项链"] = 1000, 
            ["王者之链"] = 1000, 
            ["残月之坠"] = 1000, 
            ["天极项链"] = 1000, 
            ["梵天之链"] = 1000, 
            ["天缺项链"] = 1000, 
            ["圣魂项链"] = 1000, 
            ["普通项链"] = 1000, 
            ["幸运符"] = 1000, 
            ["躲避项链"] = 1000, 
            ["黄金项链"] = 1000, 
            ["玲珑之玉"] = 1000, 
            ["力量水晶项链"] = 1000, 
            ["石琥珀项链"] = 1000, 
            ["水晶项链"] = 1000, 
            ["秘银项链"] = 1000, 
            ["明珠项链"] = 1000, 
            ["虎牙项链"] = 1000, 
            ["白金项链"] = 1000, 
            ["火晶挂坠"] = 1000, 
            ["银鳞吊坠1"] = 1000, 
            ["银鳞吊坠2"] = 1000, 
            ["蓝宝石项链"] = 1000, 
            ["增幅镜"] = 1000, 
            ["追魂之笛"] = 1000, 
            ["鬼牙项链"] = 1000, 
            ["末日项链"] = 1003, 
            ["血夜项链"] = 1003, 
            ["天劫项链"] = 1003, 
            ["疾雷项链"] = 1010, 
            ["火灵项链"] = 1010, 
            ["云扬项链"] = 1010, 
            ["天怒项链"] = 1020, 
            ["深渊项链"] = 1020, 
            ["四象项链"] = 1020, 
            ["逐光项链"] = 1050, 
            ["战龙项链"] = 1050, 
            ["逍遥项链"] = 1050, 
            ["武圣之戒"] = 1000, 
            ["破坏戒指"] = 1000, 
            ["奥普戒指"] = 1000, 
            ["摄魂戒指"] = 1000, 
            ["青云戒指"] = 1000, 
            ["混元戒指"] = 1000, 
            ["新手戒指"] = 1000, 
            ["结婚戒指"] = 1000, 
            ["君王战戒"] = 1000, 
            ["星冥魔戒"] = 1000, 
            ["上清玄指"] = 1000, 
            ["创世战戒"] = 1000, 
            ["天璃法戒"] = 1000, 
            ["天元道指"] = 1000, 
            ["古铜戒指"] = 1000, 
            ["元素戒指"] = 1000, 
            ["青铜戒指"] = 1000, 
            ["犀角戒指"] = 1000, 
            ["技巧戒指"] = 1000, 
            ["暴力戒指"] = 1000, 
            ["水晶戒指"] = 1000, 
            ["力量水晶戒指"] = 1000, 
            ["黑铁戒指"] = 1000, 
            ["六芒星戒指"] = 1000, 
            ["轻钢戒指"] = 1000, 
            ["珊瑚石戒指"] = 1000, 
            ["蛇眼石戒指"] = 1000, 
            ["翡翠珍珠戒指"] = 1000, 
            ["百裂指环"] = 1000, 
            ["猛禽戒指"] = 1000, 
            ["真金戒指"] = 1000, 
            ["品德戒指"] = 1000, 
            ["甲骨戒指"] = 1000, 
            ["魅惑戒指"] = 1000, 
            ["天机戒指"] = 1000, 
            ["龙形戒指"] = 1000, 
            ["红玛瑙戒指"] = 1000, 
            ["白金戒指"] = 1000, 
            ["赤炼戒指"] = 1000, 
            ["御战戒指"] = 1000, 
            ["御魔戒指"] = 1000, 
            ["御道戒指"] = 1000, 
            ["铁战戒指"] = 1000, 
            ["聚魂戒指"] = 1000, 
            ["玄光戒指"] = 1000, 
            ["圣武戒指"] = 1001, 
            ["苍冥戒指"] = 1001, 
            ["飞尘戒指"] = 1001, 
            ["末日戒指"] = 1003, 
            ["血夜魔指"] = 1003, 
            ["天劫道指"] = 1003, 
            ["疾雷戒指(神)"] = 1010, 
            ["火灵戒指(神)"] = 1010, 
            ["云扬戒指(神)"] = 1010, 
            ["疾雷戒指(圣)"] = 1010, 
            ["火灵戒指(圣)"] = 1010, 
            ["云扬戒指(圣)"] = 1010, 
            ["天怒戒指(神)"] = 1020, 
            ["深渊戒指(神)"] = 1020, 
            ["四象戒指(神)"] = 1020, 
            ["天怒戒指(圣)"] = 1020, 
            ["深渊戒指(圣)"] = 1020, 
            ["四象戒指(圣)"] = 1020, 
            ["逐光戒指"] = 1050, 
            ["战龙戒指"] = 1050, 
            ["逍遥戒指"] = 1050, 
            ["汗血宝马"] = 1000, 
            ["绝影"] = 1000, 
            ["疾风"] = 1000, 
            ["幽冥狼"] = 1000, 
            ["震空翼"] = 1000, 
            ["独角兽"] = 1000, 
            ["梦魇兽"] = 1000, 
            ["赤甲蝎"] = 1000, 
            ["绒球兽"] = 1000, 
            ["雪域天狼"] = 1000, 
            ["吼天兽"] = 1000, 
            ["裂天魔狮"] = 1000, 
            ["不死鸟"] = 1000, 
            ["陆行鸟"] = 1000, 
            ["神翼天鹅"] = 1000, 
            ["龙鹰"] = 1000, 
            ["狮鹫"] = 1000, 
            ["游天符"] = 1000, 
            ["混天轮"] = 1000, 
            ["风羽剑"] = 1000, 
            ["玄火轮"] = 1000, 
            ["腾云"] = 1000, 
            ["风火扇"] = 1000, 
            ["梭云兽"] = 1000, 
            ["鬼车"] = 1000, 
            ["神兽"] = 1000, 
            ["霸下玄龟"] = 1000, 
            ["海兽"] = 1000, 
            ["火麒麟"] = 1000, 
            ["地煞瞳兽"] = 1000, 
            ["仲秋神元宝刃"] = 1000, 
            ["仲秋神元神杖"] = 1000, 
            ["仲秋神元道剑"] = 1000, 
            ["仲秋神元护腕"] = 1000, 
            ["仲秋神元手镯"] = 1000, 
            ["仲秋神元手链"] = 1000, 
            ["仲秋神元铠甲(男)"] = 1000, 
            ["仲秋神元铠甲(女)"] = 1000, 
            ["仲秋神元法袍(男)"] = 1000, 
            ["仲秋神元法袍(女)"] = 1000, 
            ["仲秋神元道袍(男)"] = 1000, 
            ["仲秋神元道袍(女)"] = 1000, 
            ["仲秋神元之靴"] = 1000, 
            ["仲秋神元项链"] = 1000, 
            ["仲秋神元之链"] = 1000, 
            ["仲秋神元之坠"] = 1000, 
            ["仲秋神元指环"] = 1000, 
            ["仲秋神元戒指"] = 1000, 
            ["仲秋神元之戒"] = 1000, 
            ["仲秋神元头盔"] = 1000, 
            ["仲秋神元面具"] = 1000, 
            ["仲秋神元道冠"] = 1000, 
            ["巳蛇秘空宝刃"] = 1000, 
            ["巳蛇秘空神杖"] = 1000, 
            ["巳蛇秘空道剑"] = 1000, 
            ["巳蛇秘空头盔"] = 1000, 
            ["巳蛇秘空面具"] = 1000, 
            ["巳蛇秘空道冠"] = 1000, 
            ["巳蛇秘空手链"] = 1000, 
            ["巳蛇秘空护腕"] = 1000, 
            ["巳蛇秘空手镯"] = 1000, 
            ["巳蛇秘空铠甲(男)"] = 1000, 
            ["巳蛇秘空铠甲(女)"] = 1000, 
            ["巳蛇秘空法袍(男)"] = 1000, 
            ["巳蛇秘空法袍(女)"] = 1000, 
            ["巳蛇秘空道袍(男)"] = 1000, 
            ["巳蛇秘空道袍(女)"] = 1000, 
            ["巳蛇秘空之靴"] = 1000, 
            ["巳蛇秘空项链"] = 1000, 
            ["巳蛇秘空指环"] = 1000, 
            ["巳蛇秘空戒指"] = 1000, 
            ["巳蛇秘空之戒"] = 1000, 
            ["巳蛇秘空之链"] = 1000, 
            ["巳蛇秘空之坠"] = 1000, 
            ["庆国祈福宝刃"] = 1000, 
            ["庆国祈福神杖"] = 1000, 
            ["庆国祈福宝剑"] = 1000, 
            ["庆国祈福护腕"] = 1000, 
            ["庆国祈福手镯"] = 1000, 
            ["庆国祈福手链"] = 1000, 
            ["庆国祈福铠甲(男)"] = 1000, 
            ["庆国祈福铠甲(女)"] = 1000, 
            ["庆国祈福法袍(男)"] = 1000, 
            ["庆国祈福法袍(女)"] = 1000, 
            ["庆国祈福道袍(男)"] = 1000, 
            ["庆国祈福道袍(女)"] = 1000, 
            ["庆国祈福之靴"] = 1000, 
            ["庆国祈福项链"] = 1000, 
            ["庆国祈福之链"] = 1000, 
            ["庆国祈福之坠"] = 1000, 
            ["庆国祈福指环"] = 1000, 
            ["庆国祈福戒指"] = 1000, 
            ["庆国祈福之戒"] = 1000, 
            ["庆国祈福头盔"] = 1000, 
            ["庆国祈福面具"] = 1000, 
            ["庆国祈福道冠"] = 1000, 
        }
--荣耀证明的数量一列无效
huishou_table = {
	[0] =  {0 ,      {{"荣耀证明",1}}},
	[1] =  {1,       {{"荣耀证明",1}}},
	[2] =  {2,       {{"荣耀证明",1}}},
	[3] =  {4,       {{"荣耀证明",1}}},
	[4] =  {8,       {{"荣耀证明",1}}},
	[5] =  {16,      {{"荣耀证明",1}}},
	[6] =  {32,      {{"荣耀证明",1}}},
	[7] =  {64,      {{"荣耀证明",1}}},
	[8] =  {128,     {{"荣耀证明",1}}},
	[9] =  {256,     {{"荣耀证明",1}}},
	[10] = {512,     {{"荣耀证明",1}}},
	[11] = {1280,    {{"荣耀证明",1}}},
	[12] = {3200,    {{"荣耀证明",1}}},
	[13] = {8000,    {{"荣耀证明",1}}},
	[14] = {20000,   {{"荣耀证明",1}}},
	[15] = {50000,   {{"荣耀证明",1}}},
}

rongyao_item = 
{
--位置编号{"战士", 1, 1},表示在战士页签第一行左起第一个位置
--表单名称， 位置编号，金币， 荣耀值， 物品KeyName，{物品1， 物品1数量}， {物品2， 物品2数量}， 
    ["战士"] =  {
                    {1,  10000,    300,   "战神之证1",                        }, 
                    {2,  100000,   1400,  "战神之证2",     {"荣耀证明", 10},  }, 
                    {5,  1000000,  4000,  "战神之证3",     {"荣耀证明", 20},  }, 
                    {6,  1000000,  4000,  "血魂之靴",      {"荣耀证明", 20},  }, 
                    {9,  10000000, 8000,  "战神之证4",     {"荣耀证明", 40},  }, 
                    {10, 10000000, 8000,  "血魂护腕(神)",  {"荣耀证明", 40},  }, 
                    {11, 10000000, 8000,  "血魂护腕(圣)",  {"荣耀证明", 40},  }, 
                    {12, 10000000, 8000,  "血魂头盔",      {"荣耀证明", 40},  }, 
                    {13, 20000000, 13000, "战神之证5",     {"荣耀证明", 80},  }, 
                    {14, 20000000, 13000, "血魂项链",      {"荣耀证明", 80},  }, 
                    {15, 20000000, 13000, "血魂戒指(神)",  {"荣耀证明", 80},  }, 
                    {16, 20000000, 13000, "血魂戒指(圣)",  {"荣耀证明", 80},  }, 
                    {17, 50000000, 20000, "战神之证",      {"荣耀证明", 150}, }, 
                    {18, 50000000, 20000, "狼牙",          {"荣耀证明", 150}, }, 
                    {19, 50000000, 20000, "战神宝甲(男)",  {"荣耀证明", 150}, }, 
                    {20, 50000000, 20000, "战神宝甲(女)",  {"荣耀证明", 150}, }, 
                }, 
    ["法师"] =  {
                    {1,  10000,    300,   "法神之证1",                        }, 
                    {2,  100000,   1400,  "法神之证2",     {"荣耀证明", 10},  }, 
                    {5,  1000000,  4000,  "法神之证3",     {"荣耀证明", 20},  }, 
                    {6,  1000000,  4000,  "冰魄之靴",      {"荣耀证明", 20},  }, 
                    {9,  10000000, 8000,  "法神之证4",     {"荣耀证明", 40},  }, 
                    {10, 10000000, 8000,  "冰魄护腕(神)",  {"荣耀证明", 40},  }, 
                    {11, 10000000, 8000,  "冰魄护腕(圣)",  {"荣耀证明", 40},  }, 
                    {12, 10000000, 8000,  "冰魄头盔",      {"荣耀证明", 40},  }, 
                    {13, 20000000, 13000, "法神之证5",     {"荣耀证明", 80},  }, 
                    {14, 20000000, 13000, "冰魄项链",      {"荣耀证明", 80},  }, 
                    {15, 20000000, 13000, "冰魄戒指(神)",  {"荣耀证明", 80},  }, 
                    {16, 20000000, 13000, "冰魄戒指(圣)",  {"荣耀证明", 80},  }, 
                    {17, 50000000, 20000, "法神之证",      {"荣耀证明", 150}, }, 
                    {18, 50000000, 20000, "怒海",          {"荣耀证明", 150}, }, 
                    {19, 50000000, 20000, "法神长袍(男)",  {"荣耀证明", 150}, }, 
                    {20, 50000000, 20000, "法神长袍(女)",  {"荣耀证明", 150}, }, 
                }, 
    ["道士"] =  {
                    {1,  10000,    300,   "道尊之证1",                        }, 
                    {2,  100000,   1400,  "道尊之证2",     {"荣耀证明", 10},  }, 
                    {5,  1000000,  4000,  "道尊之证3",     {"荣耀证明", 20},  }, 
                    {6,  1000000,  4000,  "月殇之靴",      {"荣耀证明", 20},  }, 
                    {9,  10000000, 8000,  "道尊之证4",     {"荣耀证明", 40},  }, 
                    {10, 10000000, 8000,  "月殇护腕(神)",  {"荣耀证明", 40},  }, 
                    {11, 10000000, 8000,  "月殇护腕(圣)",  {"荣耀证明", 40},  }, 
                    {12, 10000000, 8000,  "月殇头盔",      {"荣耀证明", 40},  }, 
                    {13, 20000000, 13000, "道尊之证5",     {"荣耀证明", 80},  }, 
                    {14, 20000000, 13000, "月殇项链",      {"荣耀证明", 80},  }, 
                    {15, 20000000, 13000, "月殇戒指(神)",  {"荣耀证明", 80},  }, 
                    {16, 20000000, 13000, "月殇戒指(圣)",  {"荣耀证明", 80},  }, 
                    {17, 50000000, 20000, "道尊之证",      {"荣耀证明", 150}, }, 
                    {18, 50000000, 20000, "星矢",          {"荣耀证明", 150}, }, 
                    {19, 50000000, 20000, "道神宝衣(男)",  {"荣耀证明", 150}, }, 
                    {20, 50000000, 20000, "道神宝衣(女)",  {"荣耀证明", 150}, }, 
                }
}

					
function main(npc,player)
	local msg = "#COLORCOLOR_BROWN#━━━━━━━━━━━━━#COLOREND##COLORCOLOR_SKYBLUE#装备回收#COLOREND##COLORCOLOR_BROWN#━━━━━━━━━━━━━#COLOREND#\n"
	msg = msg .. "荣耀装备是目前游戏中最强的装备，想要获得就必须得付出百倍的努力\n \n"
	msg = msg .. "#OFFSET<X:0,Y:-4>##COLORCOLOR_BROWN#精炼过的装备价值更高，精炼等级10以上单件可换1~100个荣耀证明！#COLOREND#\n"
	msg = msg .. "#OFFSET<X:0,Y:-4>##COLORCOLOR_BROWN#─────────────────────────────#COLOREND#\n \n"
	msg = msg .. "#OFFSET<X:30,Y:5>##IMAGE1902700037##OFFSET<X:0,Y:-1>#<@huishou *01*装备回收>"
	--msg = msg .. "#OFFSET<X:30,Y:5>##IMAGE1902700037##OFFSET<X:0,Y:-1>##COLORCOLOR_DARKGREY#装备回收#COLOREND#"
	msg = msg .. "#OFFSET<X:130,Y:0>##IMAGE1902700017##OFFSET<X:0,Y:-1>#<@huishou_info *01*装备回收介绍>\n"
	msg = msg .. "#OFFSET<X:30,Y:5>##IMAGE1902700037##OFFSET<X:0,Y:-1>#<@duihuan *01*荣耀兑换>\n"
	msg = msg .. "#OFFSET<X:30,Y:5>##IMAGE1902700034#<@guanbi *01*离开>\n"
	return msg
end

function guanbi()
	return ""
end

function huishou_info(npc, player)
    local msg = "#COLORCOLOR_BROWN#━━━━━━━━━━━━━#COLOREND##COLORCOLOR_SKYBLUE#荣耀装备#COLOREND##COLORCOLOR_BROWN#━━━━━━━━━━━━━#COLOREND#\n"
    msg = msg .. "  装备回收是获得荣耀值的唯一途径！\n\n"
    msg = msg .. "  1.没精炼过的装备一般无法获得荣耀值(一些稀有装备除外)\n"
    msg = msg .. "  2.精炼等级越高的装备回收获得的荣耀值越高！\n"
    msg = msg .. "  3.精炼等级大于9级的装备回收时可获得荣耀证明！\n"
    msg = msg .. "  3.你也可以消耗荣耀值来兑换荣耀证明，每500点荣耀值兑换1个荣耀     证明！\n\n"
    msg = msg .. "#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01*返回>\n"
	return msg
end

function huishou(npc,player)
		lualib:ShowFormWithContent(player,"form文件表单","装备回收")
		return ""
end

function duihuan(npc,player)
	local msg = "这里是荣耀的殿堂，是对荣耀的肯定，看看你需要什么吧，需要买荣耀装备还是兑换荣耀牌！\n"
    msg = msg .. "#COLORCOLOR_RED#荣耀值达到兑换条件才可以消耗荣耀值和金币来购买荣耀装备，兑换装备之前注意看装备下方的说明，穿戴荣耀装备的也是需要荣耀值的！#COLOREND#\n\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@goumai *01*兑换荣耀装备> "
    msg = msg .. "#OFFSET<X:100,Y:0>##IMAGE<ID:1902700037>#<@duihuan_pai *01*兑换荣耀证明> \n\n"
    msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan_jingyan *01*荣耀兑换经验> \n"
    --msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan_jinbi *01*荣耀兑换金币> \n"
	--msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan_a *01*兑换荣耀牌>\n\n"
	msg = msg .. "#OFFSET<X:300,Y:0>##IMAGE<ID:1902700038>#<@main *01*返回>\n"
	return msg
end

function duihuan_pai(npc,player)
    local msg = "500点荣耀值可兑换1个荣耀证明！\n\n\n\n\n\n#IMAGE<ID:1902700037>#<@duihuan_pai_Ex *01* 我要兑换1个>\n"
    msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan_pai_10 *01* 我要兑换10个> \n"
    msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan_pai_100 *01* 我要兑换100个>"
	return msg
end

function duihuan_pai_Ex(npc,player)
    local cur_rongyao = lualib:GetInt(player, "jjc_rongyao")
    if cur_rongyao < 500 then
        return "你的荣耀值不足，请确认后再来！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    if not lualib:SetInt(player, "jjc_rongyao", cur_rongyao - 500) then
        return "减少荣耀值失败！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    if not lualib:AddItem(player, "荣耀证明", 1, false, "兑换荣耀证明", player) then
        return "添加道具失败！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    local msg = "恭喜你兑换成功，获得一个荣耀证明！\n\n\n\n\n\n\n\n<@duihuan_pai_Ex *01* 继续兑换>"
	return msg
end

function duihuan_pai_10(npc,player)
    local cur_rongyao = lualib:GetInt(player, "jjc_rongyao")
    if cur_rongyao < 5000 then
        return "你的荣耀值不足，请确认后再来！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    if not lualib:SetInt(player, "jjc_rongyao", cur_rongyao - 5000) then
        return "减少荣耀值失败！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    if not lualib:AddItem(player, "荣耀证明", 10, false, "兑换荣耀证明", player) then
        return "添加道具失败！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    local msg = "恭喜你兑换成功，获得10个荣耀证明！\n\n\n\n\n\n\n\n<@duihuan_pai_10 *01* 继续兑换>"
	return msg
end

function duihuan_pai_100(npc,player)
    local cur_rongyao = lualib:GetInt(player, "jjc_rongyao")
    if cur_rongyao < 50000 then
        return "你的荣耀值不足，请确认后再来！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    if not lualib:SetInt(player, "jjc_rongyao", cur_rongyao - 50000) then
        return "减少荣耀值失败！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    if not lualib:AddItem(player, "荣耀证明", 100, false, "兑换荣耀证明", player) then
        return "添加道具失败！\n\n\n\n\n\n\n\n#IMAGE<ID:1902700034>#<@guanbi *01*关闭>"
    end
    local msg = "恭喜你兑换成功，获得100个荣耀证明！\n\n\n\n\n\n\n\n<@duihuan_pai_100 *01* 继续兑换>"
	return msg
end

function duihuan_jingyan(npc,player)
    local msg = "每1点荣耀值可以在我这里兑换20000经验！\n\n"
    msg = msg .."#COLORCOLOR_RED#  1#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN#  20000#COLOREND#经验<@duihuan_jingyan_Ex#1#20000 *01*  我要兑换>\n"
    msg = msg .."#COLORCOLOR_RED#  2#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN#  40000#COLOREND#经验<@duihuan_jingyan_Ex#2#40000 *01*  我要兑换>\n"
    msg = msg .."#COLORCOLOR_RED#  5#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN# 100000#COLOREND#经验<@duihuan_jingyan_Ex#5#100000 *01*  我要兑换>\n"
    msg = msg .."#COLORCOLOR_RED# 10#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN# 200000#COLOREND#经验<@duihuan_jingyan_Ex#10#200000 *01*  我要兑换>\n"
    msg = msg .."#COLORCOLOR_RED# 20#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN# 400000#COLOREND#经验<@duihuan_jingyan_Ex#20#400000 *01*  我要兑换>\n"
    msg = msg .."#COLORCOLOR_RED# 50#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN#1000000#COLOREND#经验<@duihuan_jingyan_Ex#50#1000000 *01*  我要兑换>\n"
    msg = msg .."#COLORCOLOR_RED#100#COLOREND#点荣耀值可兑换#COLORCOLOR_BROWN#2000000#COLOREND#经验<@duihuan_jingyan_Ex#100#2000000 *01*  我要兑换>\n"
    msg = msg .. "#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01* 返回>"
    return msg
end

function duihuan_jingyan_Ex(npc, player, rongyao_request, jingyan)
    local rongyao_request, jingyan = tonumber(rongyao_request), tonumber(jingyan)
    if lualib:GetInt(player, "jjc_rongyao") < rongyao_request then
        return "荣耀值不足"..rongyao_request.."点！\n\n\n\n\n\n\n\n#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01* 返回>"
    end
    if not lualib:SetInt(player, "jjc_rongyao", lualib:GetInt(player, "jjc_rongyao") - rongyao_request) then
        return "扣除荣耀值失败！\n\n\n\n\n\n\n\n#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01* 返回>"
    end
    if not lualib:Player_AddExp(player, jingyan, "荣耀兑换经验", player) then
        return "加经验失败！\n\n\n\n\n\n\n\n#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01* 返回>"
    end
    local msg = "恭喜你兑换成功，获得"..jingyan.."经验！\n\n\n\n\n\n\n\n#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01* 返回>"
    return msg
end



function guanbi()
	return ""
end

function goumai(npc,player)
    local StartServerTime = lualib:GetConstVar("StartServerTime")
	local StartServerTime_int = lualib:Str2Time(StartServerTime)
	local times = lualib:GetAllTime()
    local time_cha = times - StartServerTime_int
    if time_cha < 86400 * 5 then 	--(5天) 
		local msg = "#OFFSET<X:0,Y:2>##COLORCOLOR_GREENG#荣耀装备兑换将在开服5天后开启，请5天后再来！~\n"
		msg = msg.."　　　　　　　　　　　　　　　　　　　　　　　　#OFFSET<X:0,Y:2>##IMAGE<ID:1902700019>##OFFSET<X:0,Y:-2>#<@main *01* [返回]>\n"
		return msg
	end
	local content = serialize(rongyao_item["战士"])
    local script = "server_rongyao = "..lualib:GetInt(player, "jjc_rongyao")
    lualib:ShowFormWithContent(player, "脚本表单", script)
	lualib:ShowFormWithContent(player, "荣耀装备兑换表单", content)
	return ""
end

function duihuan_a(npc,player)
	local msg = "由于有一些小人拿别人的荣耀来耀武扬威，故此荣耀值兑换成荣耀牌的时候10点荣耀值只能兑换荣耀牌(1点)，看看你要兑换什么！\n"
	msg = msg .. "#COLORCOLOR_GREENG#当前荣耀值："..lualib:GetInt(player, "jjc_rongyao").."#COLOREND# \n#COLORCOLOR_RED#请选择你要兑换的荣耀牌！#COLOREND#\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan1#1 *01*荣耀牌(1点)> 需要10点荣耀  #IMAGE<ID:1902700037>#<@duihuan1#2 *01*荣耀牌(2点)> 需要20点荣耀\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan1#3 *01*荣耀牌(3点)> 需要30点荣耀  #IMAGE<ID:1902700037>#<@duihuan1#4 *01*荣耀牌(4点)> 需要40点荣耀\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan1#5 *01*荣耀牌(5点)> 需要50点荣耀  #IMAGE<ID:1902700037>#<@duihuan1#6 *01*荣耀牌(6点)> 需要60点荣耀\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan1#7 *01*荣耀牌(7点)> 需要70点荣耀  #IMAGE<ID:1902700037>#<@duihuan1#8 *01*荣耀牌(8点)> 需要80点荣耀\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@duihuan1#9 *01*荣耀牌(9点)> 需要90点荣耀  #IMAGE<ID:1902700037>#<@duihuan1#10 *01*荣耀牌(10点)> 需要100点荣耀\n"
	msg = msg .. "#OFFSET<X:300,Y:0>##IMAGE1902700038#<@main *01*返回>\n"
	return msg
end


function duihuan1(npc,player,dianshu)
	dianshu = tonumber(dianshu)
	if lualib:GetInt(player, "jjc_rongyao") >= dianshu * 10 then
	else
		return "荣耀点不足！\n\n<@guanbi *01*关闭>"
	end
	
	if lualib:Player_GetBagFree(player) >= 1 then
		lualib:SetInt(player, "jjc_rongyao",lualib:GetInt(player, "jjc_rongyao") - dianshu * 10)
		lualib:AddItem(player,"荣耀牌"..dianshu,1,false,"兑换荣耀牌", player) --给物品
		return "荣耀牌("..dianshu.."点)兑换成功！\n\n<@duihuan *01*继续兑换>\n<@guanbi *01*关闭>\n"
	else
		return "包裹空位不足！请整理以后再来！\n\n<@guanbi *01*关闭>\n"
	end
	
	return ""
end

----------------------装备回收----------------------
function zhuangbei_huishou_1(player,item)
	--判断装备是否在包裹中
	if lualib:Item_GetSite(player,item) == "" then
		lualib:SysMsg_SendWarnMsg(player, "回收失败！物品不存在！")
		return
	end
	
	local item_keyname = lualib:KeyName(item)
	
	if zhuangb_table[item_keyname] == nil then
		lualib:SysMsg_SendWarnMsg(player, "该装备不可被回收！")
		return
	end
	
	local lv = lualib:Equip_GetRefineLevel(player,item)
	local baoguo = 0 --需要的包裹空位数
	
	if huishou_table[lv][2] ~= nil then
		for i=1,#huishou_table[lv][2] do
			for k,v in pairs(huishou_table[lv][2]) do
				baoguo = baoguo + v[2]
			end
		end
	end

	if lualib:Player_GetBagFree(player) < baoguo then
		lualib:MsgBox(player,"包裹空位不足"..baoguo.."个！请整理以后再来！")
		return
	end
    
    local item_rongyao = 0
    local item_rongyao_paizi_count = 0
    if zhuangb_table[item_keyname] > 1000 then
        item_rongyao = math.floor(zhuangb_table[item_keyname] * huishou_table[lv][1] / 1000) + zhuangb_table[item_keyname] - 1000
    else
        item_rongyao = math.floor(zhuangb_table[item_keyname] * huishou_table[lv][1] / 1000)
    end
    if item_rongyao >= 100 then
        item_rongyao_paizi_count = math.floor(item_rongyao / 100)
        item_rongyao = item_rongyao % 100
    end
    
    local t = lualib:Item_DataRow(item_keyname)
    local sellprice = t["SellPrice"]
    local max_naijiu = t["Durability"]
    local cur_naijiu = lualib:Item_GetDurability(player, item)
    local item_price = math.floor(sellprice * cur_naijiu / max_naijiu)
    local item_isbind = lualib:Item_IsBind(player, item)
    
	if not lualib:Item_Destroy(player, item, "回收装备", player) then
		lualib:SysMsg_SendWarnMsg(player, "回收装备失败！")
		return false
	end

	lualib:SetInt(player, "jjc_rongyao",lualib:GetInt(player, "jjc_rongyao") + item_rongyao) --增加荣耀值
    local s = ""
    if item_rongyao > 0 then
        s = "回收成功：获得荣耀*"..item_rongyao
    else
        if item_isbind == true then
            s = "由于装备灵气不足，无法获得荣耀值，获得了"..item_price.."绑定金币！"
        else
            s = "由于装备灵气不足，无法获得荣耀值，获得了"..item_price.."金币！"
        end
        lualib:Player_AddGold(player, item_price, item_isbind, "荣耀回收！", player)
    end
	if huishou_table[lv][2] ~= nil then
		for k,v in pairs(huishou_table[lv][2]) do
            if item_rongyao_paizi_count > 0 then
                lualib:AddItem(player, v[1], item_rongyao_paizi_count, false,"回收装备获得", player) --给物品
                s = s .. "、"..v[1].."*"..item_rongyao_paizi_count
            else
                s = s
            end
		end
	end
	
    
	lualib:MsgBox(player,s)
	local str = 
	[[
	RDItemCtrlClearGUIData(nil, "装备回收,物品")
	RichEditClear(nil,"装备回收,文字2")
	]]
	lualib:ShowFormWithContent(player, "脚本表单", str)
end