local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)
require("system/serializer")
require("system/logic_def_lua")

--装备改名消耗元宝
local yuanbao = 100

wuqi_table = 
{--位置，金币，元宝，合成物品，材料物品1，材料物品2，材料物品3，
    ["极"] = 
            {
                {1,  10000, 0, "审判", "鬼噬", "鬼噬", }, 
                {2,  10000, 0, "囚龙", "魔灵法杖", "魔灵法杖", }, 
                {3,  10000, 0, "忘机", "天玄剑", "天玄剑", }, 
                {5,  20000, 0, "十杀", "审判(珍)", "审判(珍)", }, 
                {6,  20000, 0, "天瀑", "囚龙(珍)", "囚龙(珍)", }, 
                {7,  20000, 0, "龙渊", "忘机(珍)", "忘机(珍)", }, 
                {9,  40000, 0, "断空", "十杀(珍)", "十杀(珍)", }, 
                {10, 40000, 0, "碎空", "天瀑(珍)", "天瀑(珍)", }, 
                {11, 40000, 0, "噬空", "龙渊(珍)", "龙渊(珍)", }, 
                {13, 80000, 0, "帝释", "断空(神)", "断空(神)", }, 
                {14, 80000, 0, "残虹", "碎空(神)", "碎空(神)", }, 
                {15, 80000, 0, "无常", "噬空(神)", "噬空(神)", }, 
                {17, 160000, 0, "十殿阎罗", "帝释(神)", "帝释(神)", }, 
                {18, 160000, 0, "七劫浮屠", "残虹(神)", "残虹(神)", }, 
                {19, 160000, 0, "赤霄白帝", "无常(神)", "无常(神)", }, 
                {21, 320000, 0, "罡风怒破", "十殿阎罗(神)", "十殿阎罗(神)", }, 
                {22, 320000, 0, "长空瓣轮", "七劫浮屠(神)", "七劫浮屠(神)", }, 
                {23, 320000, 0, "苍天梢月", "赤霄白帝(神)", "赤霄白帝(神)", }, 

                {29, 10000, 0, "审判(极)", "审判", "审判", }, 
                {30, 10000, 0, "囚龙(极)", "囚龙", "囚龙", }, 
                {31, 10000, 0, "忘机(极)", "忘机", "忘机", }, 
                {33, 20000, 0, "十杀(极)", "十杀", "十杀", }, 
                {34, 20000, 0, "龙渊(极)", "龙渊", "龙渊", }, 
                {35, 20000, 0, "天瀑(极)", "天瀑", "天瀑", },
                {37, 40000, 0, "断空(极)", "断空", "断空", }, 
                {38, 40000, 0, "碎空(极)", "碎空", "碎空", }, 
                {39, 40000, 0, "噬空(极)", "噬空", "噬空", }, 
                {41, 80000, 0, "帝释(极)", "帝释", "帝释", }, 
                {42, 80000, 0, "残虹(极)", "残虹", "残虹", }, 
                {43, 80000, 0, "无常(极)", "无常", "无常", }, 
                {45, 160000, 0, "十殿阎罗(极)", "十殿阎罗", "十殿阎罗", }, 
                {46, 160000, 0, "七劫浮屠(极)", "七劫浮屠", "七劫浮屠", }, 
                {47, 160000, 0, "赤霄白帝(极)", "赤霄白帝", "赤霄白帝", }, 
                {49, 320000, 0, "罡风怒破(极)", "罡风怒破", "罡风怒破", }, 
                {50, 320000, 0, "长空瓣轮(极)", "长空瓣轮", "长空瓣轮", }, 
                {51, 320000, 0, "苍天梢月(极)", "苍天梢月", "苍天梢月", }, 
            }, 
    ["珍"] = 
            {
                {1,  10000, 0, "审判(珍)", "审判(极)", "审判(极)", }, 
                {2,  10000, 0, "囚龙(珍)", "囚龙(极)", "囚龙(极)", }, 
                {3,  10000, 0, "忘机(珍)", "忘机(极)", "忘机(极)", }, 
                {5,  20000, 0, "十杀(珍)", "十杀(极)", "十杀(极)", }, 
                {6,  20000, 0, "龙渊(珍)", "龙渊(极)", "龙渊(极)", }, 
                {7,  20000, 0, "天瀑(珍)", "天瀑(极)", "天瀑(极)", }, 
                {9,  40000, 0, "断空(珍)", "断空(极)", "断空(极)", }, 
                {10, 40000, 0, "碎空(珍)", "碎空(极)", "碎空(极)", }, 
                {11, 40000, 0, "噬空(珍)", "噬空(极)", "噬空(极)", }, 
                {13, 80000, 0, "帝释(珍)", "帝释(极)", "帝释(极)", }, 
                {14, 80000, 0, "残虹(珍)", "残虹(极)", "残虹(极)", }, 
                {15, 80000, 0, "无常(珍)", "无常(极)", "无常(极)", }, 
                {17, 160000, 0, "十殿阎罗(珍)", "十殿阎罗(极)", "十殿阎罗(极)", }, 
                {18, 160000, 0, "七劫浮屠(珍)", "七劫浮屠(极)", "七劫浮屠(极)", }, 
                {19, 160000, 0, "赤霄白帝(珍)", "赤霄白帝(极)", "赤霄白帝(极)", }, 
                {21, 320000, 0, "罡风怒破(珍)", "罡风怒破(极)", "罡风怒破(极)", }, 
                {22, 320000, 0, "长空瓣轮(珍)", "长空瓣轮(极)", "长空瓣轮(极)", }, 
                {23, 320000, 0, "苍天梢月(珍)", "苍天梢月(极)", "苍天梢月(极)", }, 
            }, 
    ["绝"] = 
            {
                {1,  40000, 0, "断空(绝)", "断空(珍)", "断空(珍)", }, 
                {2,  40000, 0, "碎空(绝)", "碎空(珍)", "碎空(珍)", }, 
                {3,  40000, 0, "噬空(绝)", "噬空(珍)", "噬空(珍)", }, 
                {5,  80000, 0, "帝释(绝)", "帝释(珍)", "帝释(珍)", }, 
                {6,  80000, 0, "残虹(绝)", "残虹(珍)", "残虹(珍)", }, 
                {7,  80000, 0, "无常(绝)", "无常(珍)", "无常(珍)", }, 
                {9,  160000, 0, "十殿阎罗(绝)", "十殿阎罗(珍)", "十殿阎罗(珍)", }, 
                {10, 160000, 0, "七劫浮屠(绝)", "七劫浮屠(珍)", "七劫浮屠(珍)", }, 
                {11, 160000, 0, "赤霄白帝(绝)", "赤霄白帝(珍)", "赤霄白帝(珍)", }, 
                {13, 320000, 0, "罡风怒破(绝)", "罡风怒破(珍)", "罡风怒破(珍)", }, 
                {14, 320000, 0, "长空瓣轮(绝)", "长空瓣轮(珍)", "长空瓣轮(珍)", }, 
                {15, 320000, 0, "苍天梢月(绝)", "苍天梢月(珍)", "苍天梢月(珍)", }, 
                
            }, 
    ["神"] = 
            {
                {1,  40000, 0, "断空(神)", "断空(绝)", "断空(绝)", }, 
                {2,  40000, 0, "碎空(神)", "碎空(绝)", "碎空(绝)", }, 
                {3,  40000, 0, "噬空(神)", "噬空(绝)", "噬空(绝)", }, 
                {5,  80000, 0, "帝释(神)", "帝释(绝)", "帝释(绝)", }, 
                {6,  80000, 0, "残虹(神)", "残虹(绝)", "残虹(绝)", }, 
                {7,  80000, 0, "无常(神)", "无常(绝)", "无常(绝)", }, 
                {9,  160000, 0, "十殿阎罗(神)", "十殿阎罗(绝)", "十殿阎罗(绝)", }, 
                {10, 160000, 0, "七劫浮屠(神)", "七劫浮屠(绝)", "七劫浮屠(绝)", }, 
                {11, 160000, 0, "赤霄白帝(神)", "赤霄白帝(绝)", "赤霄白帝(绝)", }, 
                {13, 320000, 0, "罡风怒破(神)", "罡风怒破(绝)", "罡风怒破(绝)", }, 
                {14, 320000, 0, "长空瓣轮(神)", "长空瓣轮(绝)", "长空瓣轮(绝)", }, 
                {15, 320000, 0, "苍天梢月(神)", "苍天梢月(绝)", "苍天梢月(绝)", }, 
            }, 
}
yifu_table = 
{--  表单名称 ，表单序列，合成物品KeyName，材料物品KeyName1，材料物品KeyName2，...
    ["极"] =
            {
                {1,  10000,  0, "赤峰战甲·极(男)", "赤峰战甲(男)", "赤峰战甲(男)", }, 
                {2,  10000,  0, "阎罗长袍·极(男)", "阎罗长袍(男)", "阎罗长袍(男)", }, 
                {3,  10000,  0, "光明道袍·极(男)", "光明道袍(男)", "光明道袍(男)", }, 
                {5,  10000,  0, "赤峰战甲·极(女)", "赤峰战甲(女)", "赤峰战甲(女)", }, 
                {6,  10000,  0, "阎罗长袍·极(女)", "阎罗长袍(女)", "阎罗长袍(女)", }, 
                {7,  10000,  0, "光明道袍·极(女)", "光明道袍(女)", "光明道袍(女)", }, 
                {9,  20000,  0, "百裂战甲·极(男)", "百裂战甲(男)", "百裂战甲(男)", }, 
                {10, 20000,  0, "圣灵法衣·极(男)", "圣灵法衣(男)", "圣灵法衣(男)", }, 
                {11, 20000,  0, "太玄道袍·极(男)", "太玄道袍(男)", "太玄道袍(男)", }, 
                {13, 20000,  0, "百裂战甲·极(女)", "百裂战甲(女)", "百裂战甲(女)", }, 
                {14, 20000,  0, "圣灵法衣·极(女)", "圣灵法衣(女)", "圣灵法衣(女)", }, 
                {15, 40000,  0, "太玄道袍·极(女)", "太玄道袍(女)", "太玄道袍(女)", }, 
                {17, 40000,  0, "龙鳞战甲·极(男)", "龙鳞战甲(男)", "龙鳞战甲(男)", }, 
                {18, 40000,  0, "璃梦法袍·极(男)", "璃梦法袍(男)", "璃梦法袍(男)", }, 
                {19, 40000,  0, "天鼎道袍·极(男)", "天鼎道袍(男)", "天鼎道袍(男)", }, 
                {21, 40000,  0, "龙鳞战甲·极(女)", "龙鳞战甲(女)", "龙鳞战甲(女)", }, 
                {22, 40000,  0, "璃梦法袍·极(女)", "璃梦法袍(女)", "璃梦法袍(女)", }, 
                {23, 40000,  0, "天鼎道袍·极(女)", "天鼎道袍(女)", "天鼎道袍(女)", }, 
                {25, 80000,  0, "无痕天饮(极)",    "无痕天饮",     "无痕天饮",     }, 
                {26, 80000,  0, "流萤暮影(极)",    "流萤暮影",     "流萤暮影",     }, 
                {27, 80000,  0, "鹤流瑶羽(极)",    "鹤流瑶羽",     "鹤流瑶羽",     }, 
                {29, 80000,  0, "无痕天曲(极)",    "无痕天曲",     "无痕天曲",     }, 
                {30, 80000,  0, "流萤暮露(极)",    "流萤暮露",     "流萤暮露",     }, 
                {31, 80000,  0, "鹤流瑶纱(极)",    "鹤流瑶纱",     "鹤流瑶纱",     }, 
            }, 
    ["珍"] = 
            {
                {1,  10000,  0, "赤峰战甲·珍(男)", "赤峰战甲·极(男)", "赤峰战甲·极(男)", }, 
                {2,  10000,  0, "阎罗长袍·珍(男)", "阎罗长袍·极(男)", "阎罗长袍·极(男)", }, 
                {3,  10000,  0, "光明道袍·珍(男)", "光明道袍·极(男)", "光明道袍·极(男)", }, 
                {5,  10000,  0, "赤峰战甲·珍(女)", "赤峰战甲·极(女)", "赤峰战甲·极(女)", }, 
                {6,  10000,  0, "阎罗长袍·珍(女)", "阎罗长袍·极(女)", "阎罗长袍·极(女)", }, 
                {7,  10000,  0, "光明道袍·珍(女)", "光明道袍·极(女)", "光明道袍·极(女)", }, 
                {9,  20000,  0, "百裂战甲·珍(男)", "百裂战甲·极(男)", "百裂战甲·极(男)", }, 
                {10, 20000,  0, "圣灵法衣·珍(男)", "圣灵法衣·极(男)", "圣灵法衣·极(男)", }, 
                {11, 20000,  0, "太玄道袍·珍(男)", "太玄道袍·极(男)", "太玄道袍·极(男)", }, 
                {13, 20000,  0, "百裂战甲·珍(女)", "百裂战甲·极(女)", "百裂战甲·极(女)", }, 
                {14, 20000,  0, "圣灵法衣·珍(女)", "圣灵法衣·极(女)", "圣灵法衣·极(女)", }, 
                {15, 20000,  0, "太玄道袍·珍(女)", "太玄道袍·极(女)", "太玄道袍·极(女)", }, 
                {17, 40000,  0, "龙鳞战甲·珍(男)", "龙鳞战甲·极(男)", "龙鳞战甲·极(男)", }, 
                {18, 40000,  0, "璃梦法袍·珍(男)", "璃梦法袍·极(男)", "璃梦法袍·极(男)", }, 
                {19, 40000,  0, "天鼎道袍·珍(男)", "天鼎道袍·极(男)", "天鼎道袍·极(男)", }, 
                {21, 40000,  0, "龙鳞战甲·珍(女)", "龙鳞战甲·极(女)", "龙鳞战甲·极(女)", }, 
                {22, 40000,  0, "璃梦法袍·珍(女)", "璃梦法袍·极(女)", "璃梦法袍·极(女)", }, 
                {23, 40000,  0, "天鼎道袍·珍(女)", "天鼎道袍·极(女)", "天鼎道袍·极(女)", }, 
                {25, 80000,  0, "无痕天饮(珍)",    "无痕天饮(极)",     "无痕天饮(极)",   }, 
                {26, 80000,  0, "流萤暮影(珍)",    "流萤暮影(极)",     "流萤暮影(极)",   }, 
                {27, 80000,  0, "鹤流瑶羽(珍)",    "鹤流瑶羽(极)",     "鹤流瑶羽(极)",   }, 
                {29, 80000,  0, "无痕天曲(珍)",    "无痕天曲(极)",     "无痕天曲(极)",   }, 
                {30, 80000,  0, "流萤暮露(珍)",    "流萤暮露(极)",     "流萤暮露(极)",   }, 
                {31, 80000,  0, "鹤流瑶纱(珍)",    "鹤流瑶纱(极)",     "鹤流瑶纱(极)",   }, 
            }, 
    ["绝"] = 
            {
                {1,  10000,  0, "赤峰战甲·绝(男)", "赤峰战甲·珍(男)", "赤峰战甲·珍(男)", }, 
                {2,  10000,  0, "阎罗长袍·绝(男)", "阎罗长袍·珍(男)", "阎罗长袍·珍(男)", }, 
                {3,  10000,  0, "光明道袍·绝(男)", "光明道袍·珍(男)", "光明道袍·珍(男)", }, 
                {5,  10000,  0, "赤峰战甲·绝(女)", "赤峰战甲·珍(女)", "赤峰战甲·珍(女)", }, 
                {6,  10000,  0, "阎罗长袍·绝(女)", "阎罗长袍·珍(女)", "阎罗长袍·珍(女)", }, 
                {7,  10000,  0, "光明道袍·绝(女)", "光明道袍·珍(女)", "光明道袍·珍(女)", }, 
                {9,  20000,  0, "百裂战甲·绝(男)", "百裂战甲·珍(男)", "百裂战甲·珍(男)", }, 
                {10, 20000,  0, "圣灵法衣·绝(男)", "圣灵法衣·珍(男)", "圣灵法衣·珍(男)", }, 
                {11, 20000,  0, "太玄道袍·绝(男)", "太玄道袍·珍(男)", "太玄道袍·珍(男)", }, 
                {13, 20000,  0, "百裂战甲·绝(女)", "百裂战甲·珍(女)", "百裂战甲·珍(女)", }, 
                {14, 20000,  0, "圣灵法衣·绝(女)", "圣灵法衣·珍(女)", "圣灵法衣·珍(女)", }, 
                {15, 20000,  0, "太玄道袍·绝(女)", "太玄道袍·珍(女)", "太玄道袍·珍(女)", }, 
                {17, 40000,  0, "龙鳞战甲·绝(男)", "龙鳞战甲·珍(男)", "龙鳞战甲·珍(男)", }, 
                {18, 40000,  0, "璃梦法袍·绝(男)", "璃梦法袍·珍(男)", "璃梦法袍·珍(男)", }, 
                {19, 40000,  0, "天鼎道袍·绝(男)", "天鼎道袍·珍(男)", "天鼎道袍·珍(男)", }, 
                {21, 40000,  0, "龙鳞战甲·绝(女)", "龙鳞战甲·珍(女)", "龙鳞战甲·珍(女)", }, 
                {22, 40000,  0, "璃梦法袍·绝(女)", "璃梦法袍·珍(女)", "璃梦法袍·珍(女)", }, 
                {23, 40000,  0, "天鼎道袍·绝(女)", "天鼎道袍·珍(女)", "天鼎道袍·珍(女)", }, 
                {25, 80000,  0, "无痕天饮(绝)",    "无痕天饮(珍)",    "无痕天饮(珍)",    }, 
                {26, 80000,  0, "流萤暮影(绝)",    "流萤暮影(珍)",    "流萤暮影(珍)",    }, 
                {27, 80000,  0, "鹤流瑶羽(绝)",    "鹤流瑶羽(珍)",    "鹤流瑶羽(珍)",    }, 
                {29, 80000,  0, "无痕天曲(绝)",    "无痕天曲(珍)",    "无痕天曲(珍)",    }, 
                {30, 80000,  0, "流萤暮露(绝)",    "流萤暮露(珍)",    "流萤暮露(珍)",    }, 
                {31, 80000,  0, "鹤流瑶纱(绝)",    "鹤流瑶纱(珍)",    "鹤流瑶纱(珍)",    }, 
            }, 
    ["神"] = 
            {
                {1,  10000,  0, "赤峰战甲·神(男)", "赤峰战甲·绝(男)", "赤峰战甲·绝(男)", }, 
                {2,  10000,  0, "阎罗长袍·神(男)", "阎罗长袍·绝(男)", "阎罗长袍·绝(男)", }, 
                {3,  10000,  0, "光明道袍·神(男)", "光明道袍·绝(男)", "光明道袍·绝(男)", }, 
                {5,  10000,  0, "赤峰战甲·神(女)", "赤峰战甲·绝(女)", "赤峰战甲·绝(女)", }, 
                {6,  10000,  0, "阎罗长袍·神(女)", "阎罗长袍·绝(女)", "阎罗长袍·绝(女)", }, 
                {7,  10000,  0, "光明道袍·神(女)", "光明道袍·绝(女)", "光明道袍·绝(女)", }, 
                {9,  20000,  0, "百裂战甲·神(男)", "百裂战甲·绝(男)", "百裂战甲·绝(男)", }, 
                {10, 20000,  0, "圣灵法衣·神(男)", "圣灵法衣·绝(男)", "圣灵法衣·绝(男)", }, 
                {11, 20000,  0, "太玄道袍·神(男)", "太玄道袍·绝(男)", "太玄道袍·绝(男)", }, 
                {13, 20000,  0, "百裂战甲·神(女)", "百裂战甲·绝(女)", "百裂战甲·绝(女)", }, 
                {14, 20000,  0, "圣灵法衣·神(女)", "圣灵法衣·绝(女)", "圣灵法衣·绝(女)", }, 
                {15, 20000,  0, "太玄道袍·神(女)", "太玄道袍·绝(女)", "太玄道袍·绝(女)", }, 
                {17, 40000,  0, "龙鳞战甲·神(男)", "龙鳞战甲·神(男)", "龙鳞战甲·神(男)", }, 
                {18, 40000,  0, "璃梦法袍·神(男)", "璃梦法袍·神(男)", "璃梦法袍·神(男)", }, 
                {19, 40000,  0, "天鼎道袍·神(男)", "天鼎道袍·神(男)", "天鼎道袍·神(男)", }, 
                {21, 40000,  0, "龙鳞战甲·神(女)", "龙鳞战甲·神(女)", "龙鳞战甲·神(女)", }, 
                {22, 40000,  0, "璃梦法袍·神(女)", "璃梦法袍·神(女)", "璃梦法袍·神(女)", }, 
                {23, 40000,  0, "天鼎道袍·神(女)", "天鼎道袍·神(女)", "天鼎道袍·神(女)", }, 
                {25, 80000,  0, "无痕天饮(神)",    "无痕天饮(绝)",    "无痕天饮(绝)",    }, 
                {26, 80000,  0, "流萤暮影(神)",    "流萤暮影(绝)",    "流萤暮影(绝)",    }, 
                {27, 80000,  0, "鹤流瑶羽(神)",    "鹤流瑶羽(绝)",    "鹤流瑶羽(绝)",    }, 
                {29, 80000,  0, "无痕天曲(神)",    "无痕天曲(绝)",    "无痕天曲(绝)",    }, 
                {30, 80000,  0, "流萤暮露(神)",    "流萤暮露(绝)",    "流萤暮露(绝)",    }, 
                {31, 80000,  0, "鹤流瑶纱(神)",    "鹤流瑶纱(绝)",    "鹤流瑶纱(绝)",    }, 
            }, 
}

zulin_table = 
{
    ["武器"] = 
    {
        {"十杀·租赁", 100}, 
        {"龙渊·租赁", 100}, 
        {"天瀑·租赁", 100}, 
        {"噬空·租赁", 100}, 
        {"碎空·租赁", 100}, 
        {"断空·租赁", 100}, 
    }, 
    
    ["衣服"] = 
    {
        {"赤峰战甲(男)·租赁", 50}, 
        {"赤峰战甲(女)·租赁", 50}, 
        {"阎罗长袍(男)·租赁", 50}, 
        {"阎罗长袍(女)·租赁", 50}, 
        {"光明道袍(男)·租赁", 50}, 
        {"光明道袍(女)·租赁", 50}, 
    }, 
    
    ["首饰"] = 
    {
        {"王者之链·租赁", 20}, 
        {"麒麟战盔·租赁", 20}, 
        {"魔炫护腕·租赁", 20}, 
        {"君王战戒·租赁", 20}, 
        {"残月之坠·租赁", 20}, 
        {"龙牙面具·租赁", 20}, 
        {"紫炎护腕·租赁", 20}, 
        {"星冥魔戒·租赁", 20}, 
        {"天极项链·租赁", 20}, 
        {"无魂头盔·租赁", 20}, 
        {"天翼手镯·租赁", 20}, 
        {"上清玄指·租赁", 20}, 
        {"逐波天靴·租赁", 20}, 
    }, 
}


function main(npc,player)
	return main1(npc,player)
end

function main1(npc,player)
	local msg = "看看你要合成什么！\n"
    msg = msg .. "#COLORCOLOR_RED#只要你收集到了足够的装备，我便可以给你合成更高级的！看看你要合成什么！#COLOREND#\n\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@wuqi_hecheng *01*武器合成> \n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@yifu_hecheng *01*衣服合成> \n"
    msg = msg .. "#IMAGE<ID:1902700037>#<@zb_gaiming *01*个性改名> \n"
	msg = msg .. "#IMAGE<ID:1902700034>#<@guanbi *01*关闭>\n"
	return msg
end

function guanbi()
	return ""
end

function wuqi_hecheng(npc,player)
	local content = serialize(wuqi_table["极"])
	lualib:ShowFormWithContent(player, "武器合成表单", content)
	return ""
end

function yifu_hecheng(npc,player)
	local content = serialize(yifu_table["极"])
	lualib:ShowFormWithContent(player, "衣服合成表单", content)
	return ""
end

function zb_gaiming(npc,player)
	local msg="#COLORCOLOR_YELLOW#1.装备个性改名可不是一般人能奢侈的，需要#COLOREND##COLORCOLOR_RED#100元宝#COLOREND##COLORCOLOR_YELLOW#哦！#COLOREND#\n"
	msg = msg.."#COLORCOLOR_YELLOW#2.请将所要修改的装备放在包裹第一个格子#COLOREND#\n"
	msg = msg.."#COLORCOLOR_BROWN#▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂#COLOREND#\n \n \n \n"
	msg = msg.."#OFFSET<X:0,Y:0>##IMAGE1902700032##OFFSET<X:0,Y:-1>#<@zhuangbeigaiming *01*[我要改名]>\n \n \n"
	msg = msg.."                                              #OFFSET<X:0,Y:-5>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@main *01*「返回」>"	
	return msg
end

function zhuangbeigaiming(npc,player)
	local item_name = lualib:Player_GetItemGuid(player,lua_site_bag_0)
	local key = lualib:KeyName(item_name)
	local name = lualib:Name(item_name)
	local msg = "你要所修改的装备为 ["..name.."] ，你确定修改吗？\n"
	msg = msg.."#COLORCOLOR_BROWN#▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂#COLOREND#\n \n \n \n"
	msg = msg.."#OFFSET<X:0,Y:0>##IMAGE1902700032##OFFSET<X:0,Y:-1>#<@queding#"..item_name.."# *01*[确定修改]>\n \n \n \n"
	msg = msg.."                                              #OFFSET<X:0,Y:-5>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@main *01*「返回首页」>"
	return msg
end

function queding(npc,player,itemKey)
	local item_type = lualib:Item_GetType(player,itemKey)
	--print(itemKey)
	if item_type ~= 1 then
		return "包裹第一个位置不是装备,无法装备改名\n \n \n \n \n \n \n \n \n                                              #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@zhuangbeigaiming *01*「返回」>"
	end
	
	local z_name = lualib:KeyName(itemKey)
    local zulin_type = {"武器", "衣服", "首饰"}
    for i = 1, #zulin_type do
        for j = 1, #zulin_table[zulin_type[i]] do
            if z_name == zulin_table[zulin_type[i]][j] then
                return "租赁装备不能进行改名！\n\n \n \n \n \n \n \n \n                                               #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@main *01*「返回首页」>"
            end
        end
    end

	
	if not lualib:Player_IsIngotEnough(player, tonumber(yuanbao), false) then
	
		return "你没有"..yuanbao.."元宝，不能改名！\n \n \n \n \n \n \n \n \n                                              #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@main *01*「返回首页」>"
	end
	

	
	lualib:SysMsg_SendInputDlg(player, 1, "请输入你所要修改的装备名称", 45, 14, "EnterHot", npc.."#"..itemKey)
	return ""
end

function EnterHot(id,player,toName,param)
	local params = lualib:StrSplit(param, "#")
	local npc = params[1]
	local item_name = params[2]
	local msg = ""
	--print(npc,item_name)
	--local item_name = lualib:Player_GetItemGuid(player,lua_site_bag_0)
	local item_type = lualib:Item_GetType(player,item_name)
	local yuan_iName = lualib:Name(item_name)
	if string.find(toName,"[%]%[]") ~= nil then 
		local msg = "输入的名称不合法，请重新输入！\n \n \n \n \n \n \n \n \n                                              #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@zhuangbeigaiming *01*「返回」>"
		lualib:NPCTalkEx(npc, player, msg)
		return true
	end
	
	
	if lualib:IsBanString(toName) == true then 
		msg = "输入的名称不合法，请重新输入！\n \n \n \n \n \n \n \n \n                                              #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@zhuangbeigaiming *01*「返回」>"
		lualib:NPCTalkEx(npc, player, msg)
		return true
	end
	
	if item_type ~= 1 then
		msg = "包裹第一个位置不是装备，无法装备改名\n \n \n \n \n \n \n \n \n                                              #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@main *01*「返回」>"
		lualib:NPCTalkEx(npc, player, msg)
		return true
	end
	
	local cName = "(改)"..toName
	if not lualib:Item_ChangeName(player,item_name,cName) then return "改名失败" end
	local gaiming_p = lualib:KeyName(player)
	local play_name = lualib:Name(player)
	if lualib:Player_SubIngot(player, yuanbao, false, "装备改名", player) == false then
		lualib:NPCTalkEx(npc, player, "扣除元宝失败")
		return true
	end
	
	local gb2 = "玩家 ["..play_name.."] 在装备打造大师将 ["..yuan_iName.."] 命名为 ["..cName.."] !"
	lualib:SysMsg_SendCenterMsg(1, gb2,"")
	
	msg = "装备改名成功！\n \n \n \n \n \n \n \n \n                                          #OFFSET<X:0,Y:-4>##IMAGE1902700019##OFFSET<X:0,Y:-2>#<@main *01*「返回首页」>"
	lualib:NPCTalkEx(npc, player, msg)
	return true
end