local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)
require("system/serializer")

--装备改名消耗元宝

item_table = 
{--位置，金币，元宝，合成物品，{材料物品1，材料1数量}，{材料物品2，材料2数量}，{材料物品3，材料3数量}
    ["鉴定辨识"] = 
            {
--                {1, 0, 0,  "中级鉴定灵符",   {"低级鉴定灵符", 10}, }, 
--                {2, 0, 0,  "高级鉴定灵符",   {"中级鉴定灵符", 10}, }, 
                {1,  0, 0,  "暴击灵符2级",  {"暴击灵符1级", 2},  }, 
                {2,  5000, 0,  "暴击灵符3级",  {"暴击灵符2级", 2},  }, 
                {3,  10000, 0,  "暴击灵符4级",  {"暴击灵符3级", 2},  }, 
                {4,  20000, 0,  "暴击灵符5级",  {"暴击灵符4级", 2},  }, 
                {5,  40000, 0,  "暴击灵符6级",  {"暴击灵符5级", 2},  }, 
                {6,  80000, 0,  "暴击灵符7级",  {"暴击灵符6级", 2},  }, 
                {7,  160000, 0,  "暴击灵符8级",  {"暴击灵符7级", 2},  }, 
                {8,  320000, 0,  "暴击灵符9级",  {"暴击灵符8级", 2},  }, 
                {9,  640000, 0,  "暴击灵符10级", {"暴击灵符9级", 2},  }, 
                {13,  10000, 0, "辨识卷轴(武)", {"辨识之石", 2},     }, 
                {14,  10000, 0, "辨识卷轴(衣)", {"辨识之石", 2},     }, 
                {16,  5000, 0, "辨识卷轴(帽)", {"辨识之石", 2},     }, 
                {17,  5000, 0, "辨识卷轴(链)", {"辨识之石", 2},     }, 
                {18,  5000, 0, "辨识卷轴(手)", {"辨识之石", 2},     }, 
                {19,  5000, 0, "辨识卷轴(戒)", {"辨识之石", 2},     }, 
                {20,  5000, 0, "辨识卷轴(鞋)", {"辨识之石", 2},     }, 
            }, 
    ["翅膀神翼"] = 
    
            {
                {1, 0,   0, "神羽翅膀1级",      {"神羽", 50},                          }, 
                {2, 500000,   0, "神羽翅膀2级",      {"神羽翅膀1级", 1},    {"神羽", 50},   }, 
                {3, 1000000,  0, "神羽翅膀3级",      {"神羽翅膀2级", 1},    {"神羽", 100},  }, 
                {4, 2000000,  0, "神羽翅膀4级",      {"神羽翅膀3级", 1},    {"神羽", 200},  }, 
                {5, 4000000,  0, "神羽翅膀5级",      {"神羽翅膀4级", 1},    {"神羽", 400},  }, 
                {6, 8000000,  0, "神羽翅膀6级",      {"神羽翅膀5级", 1},    {"神羽", 800},  }, 
                {7, 16000000, 0, "神羽翅膀7级",      {"神羽翅膀6级", 1},    {"神羽", 1600}, }, 
                {17,1000000,  0, "城主金印",  {"城主之印", 1}, {"城主之印", 1}, {"城主之印", 1}}, 
            }, 
    ["包裹其它"] = 
            {
                {1,  0,       0, "麻布袋",       {"布料", 3},                                             }, 
                {2,  5000,    0, "丝绸袋",       {"麻布袋", 1},     {"麻布袋", 1},     {"麻布袋", 1},     }, 
                {3,  10000,   0, "锦织袋",       {"丝绸袋", 1},     {"丝绸袋", 1},     {"丝绸袋", 1},     }, 
                {4,  20000,   0, "皮革囊",       {"锦织袋", 1},     {"锦织袋", 1},     {"锦织袋", 1},     }, 
                {5,  40000,   0, "百珍囊",       {"皮革囊", 1},     {"皮革囊", 1},     {"皮革囊", 1},     }, 
                {6,  80000,   0, "乾坤囊(10格)", {"百珍囊", 1},     {"百珍囊", 1},     {"百珍囊", 1},     }, 
                {7,  160000,  0, "乾坤囊(20格)", {"乾坤囊(10格)", 1},     {"乾坤囊(10格)", 1},     {"乾坤囊(10格)", 1},     }, 
                {8,  320000,  0, "乾坤囊(30格)", {"乾坤囊(20格)", 1},     {"乾坤囊(20格)", 1},     {"乾坤囊(20格)", 1},     }, 
                {9,  640000,  0, "乾坤囊(40格)", {"乾坤囊(30格)", 1},     {"乾坤囊(30格)", 1},     {"乾坤囊(30格)", 1},     }, 
                {10, 10000,   0, "储存箱(1格)", {"布料", 3},     }, 
                {13,  0,   0, "中级转神石",   {"低级转神石", 3},                                       }, 
                {14, 50000,   0, "高级转神石",   {"中级转神石", 3},                                       }, 
                {15, 100000,   0, "特级转神石",   {"高级转神石", 3},                                       }, 
                {17, 0,   0, "低级灵元精粹", {"灵元精华", 3},                                        }, 
                {18, 50000,   0, "中级灵元精粹", {"低级灵元精粹", 1},  {"低级灵元精粹", 1}, {"低级灵元精粹", 1},             }, 
                {19, 100000,  0, "高级灵元精粹", {"中级灵元精粹", 1},  {"中级灵元精粹", 1}, {"中级灵元精粹", 1},             }, 
                {20, 200000,  0, "特级灵元精粹", {"高级灵元精粹", 1},  {"高级灵元精粹", 1}, {"高级灵元精粹", 1},             }, 
            }, 
    ["日常消耗"] = 
            {
                {1,  0, 0, "灵石",             {"灵石碎块", 20},                                                    }, 
                {2,  0, 0, "封魔令牌",         {"封魔印", 20},                                                      }, 
                {3,  0, 0, "坐骑口粮",         {"牧草", 20},                                                        }, 
                {5,  0, 0, "坐骑聚灵珠(中)",   {"坐骑聚灵珠(小)", 1}, {"坐骑聚灵珠(小)", 1}, {"坐骑聚灵珠(小)", 1}, }, 
                {6,  5000, 0, "坐骑聚灵珠(大)",   {"坐骑聚灵珠(中)", 1}, {"坐骑聚灵珠(中)", 1}, {"坐骑聚灵珠(中)", 1}, }, 
                {9,  0, 0, "聚灵珠(中)",       {"聚灵珠(小)", 1},     {"聚灵珠(小)", 1},     {"聚灵珠(小)", 1},     }, 
                {10, 5000, 0, "聚灵珠(大)",       {"聚灵珠(中)", 1},     {"聚灵珠(中)", 1},     {"聚灵珠(中)", 1},     }, 
                {11, 10000, 0, "超级聚灵珠",       {"聚灵珠(大)", 1},     {"聚灵珠(大)", 1},     {"聚灵珠(大)", 1},     },
                {13, 120000,  0, "道尊神符", {"超级护身符", 1}, {"超级护身符", 1}, {"超级护身符", 1},}, 
                {14, 120000,  0, "道尊神毒", {"超级灰色药粉", 1}, {"超级灰色药粉", 1}, {"超级灰色药粉", 1},}, 
                {15, 120000,  0, "道尊灵毒", {"超级黄色药粉", 1},{"超级黄色药粉", 1}, {"超级黄色药粉", 1},}, 				
            }, 
    
}


function main(npc,player)
	return main1(npc,player)
end

function main1(npc,player)
	local msg = "看看你要合成什么！\n"
    msg = msg .. "#COLORCOLOR_RED#道具可以在我这里进行合成，看看你要合成什么！#COLOREND#\n\n"
	msg = msg .. "#IMAGE<ID:1902700037>#<@item_hecheng *01*道具合成> \n"
	msg = msg .. "#IMAGE<ID:1902700034>#<@guanbi *01*关闭>\n"
	return msg
end

function guanbi()
	return ""
end

function item_hecheng(npc,player)
	local content = serialize(item_table["翅膀神翼"])
	lualib:ShowFormWithContent(player, "道具合成表单", content)
	return ""
end