local data = [[{
	{
		img = 1892000002,				--技能图片
		name = "强化刺杀剑术",				--技能名称
		desc = "提高刺杀剑术技能伤害",	--技能小描述
		[1] = {
			key = "刺杀剑术5级",		--给予技能
			own = "刺杀剑术4级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[2] = {
			key = "刺杀剑术6级",		--给予技能
			own = "刺杀剑术5级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[3] = {
			key = "刺杀剑术7级",		--给予技能
			own = "刺杀剑术6级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[4] = {
			key = "刺杀剑术8级",		--给予技能
			own = "刺杀剑术7级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[5] = {
			key = "刺杀剑术9级",		--给予技能
			own = "刺杀剑术8级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[6] = {
			key = "刺杀剑术10级",		--给予技能
			own = "刺杀剑术9级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[7] = {
			key = "刺杀剑术11级",		--给予技能
			own = "刺杀剑术10级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[8] = {
			key = "刺杀剑术12级",		--给予技能
			own = "刺杀剑术11级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
		[9] = {
			key = "刺杀剑术13级",		--给予技能
			own = "刺杀剑术12级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    刺杀剑术等级每提升1级，可增\n#OFFSET<Y:5>#加刺杀剑术 5%的威力。",--技能主要描述
		},
	},
	{
		img = 1892000004,				--技能图片
		name = "强化烈焰斩",				--技能名称
		desc = "提高烈焰斩技能伤害",	--技能小描述
		[1] = {
			key = "烈火剑法5级",		--给予技能
			own = "烈火剑法4级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[2] = {
			key = "烈火剑法6级",		--给予技能
			own = "烈火剑法5级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[3] = {
			key = "烈火剑法7级",		--给予技能
			own = "烈火剑法6级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 55,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[4] = {
			key = "烈火剑法8级",		--给予技能
			own = "烈火剑法7级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[5] = {
			key = "烈火剑法9级",		--给予技能
			own = "烈火剑法8级",		--需要拥有技能
			ingot = 100,			--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[6] = {
			key = "烈火剑法10级",		--给予技能
			own = "烈火剑法9级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 70,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[7] = {
			key = "烈火剑法11级",		--给予技能
			own = "烈火剑法10级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[8] = {
			key = "烈火剑法12级",		--给予技能
			own = "烈火剑法11级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
		[9] = {
			key = "烈火剑法13级",		--给予技能
			own = "烈火剑法12级",		--需要拥有技能
			ingot = 100,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 99},
			wl = "    烈焰斩等级每提升1级，可增加\n#OFFSET<Y:5>#烈焰斩10%伤害。并有几率让目标烧\n#OFFSET<Y:5>#伤。",--技能主要描述
		},
	},
	{
		img = 1892000006,				--技能图片
		name = "强化寒冰剑气",				--技能名称
		desc = "提高寒冰剑气技能伤害",	--技能小描述
		[1] = {
			key = "开天斩1重",		--给予技能
			own = "开天斩4级",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[2] = {
			key = "开天斩2重",		--给予技能
			own = "开天斩1重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[3] = {
			key = "开天斩3重",		--给予技能
			own = "开天斩2重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[4] = {
			key = "开天斩4重",		--给予技能
			own = "开天斩3重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 60,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[5] = {
			key = "开天斩5重",		--给予技能
			own = "开天斩4重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[6] = {
			key = "开天斩6重",		--给予技能
			own = "开天斩5重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[7] = {
			key = "开天斩7重",		--给予技能
			own = "开天斩6重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[8] = {
			key = "开天斩8重",		--给予技能
			own = "开天斩7重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
		[9] = {
			key = "开天斩9重",		--给予技能
			own = "开天斩8重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"书页", 10},
			wl = "    寒冰剑气等级每提升1级，可增\n#OFFSET<Y:5>#加寒冰剑气 5%伤害，并有几率对攻\n#OFFSET<Y:5>#击目标触发冰冻效果。",--技能主要描述

		},
	},
	{
		img = 1892000008,				--技能图片
		name = "强化追日剑法",				--技能名称
		desc = "提高追日剑法技能伤害",	--技能小描述
		[1] = {
			key = "追日剑法1重",		--给予技能
			own = "追日剑法4级",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[2] = {
			key = "追日剑法2重",		--给予技能
			own = "追日剑法1重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[3] = {
			key = "追日剑法3重",		--给予技能
			own = "追日剑法2重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[4] = {
			key = "追日剑法4重",		--给予技能
			own = "追日剑法3重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[5] = {
			key = "追日剑法5重",		--给予技能
			own = "追日剑法4重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[6] = {
			key = "追日剑法6重",		--给予技能
			own = "追日剑法5重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[7] = {
			key = "追日剑法7重",		--给予技能
			own = "追日剑法6重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[8] = {
			key = "追日剑法8重",		--给予技能
			own = "追日剑法7重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 80,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
		[9] = {
			key = "追日剑法9重",		--给予技能
			own = "追日剑法8重",		--需要拥有技能
			ingot = 20,					--升级成功几率百分比
			lv = 300,					--等级需求
			it = {"技能书页", 9},
			wl = "    追日剑法等级每提升1级，可增\n#OFFSET<Y:5>#加追日剑法 5%伤害。",--技能主要描述
		},
	},
}]]


local tab = loadstring(" return "..data)()


function show(player, npc)
	local s = ""
	for k, v in ipairs(tab) do
		s = s..lualib:GetInt(player, "skill_lv"..k).."#"
	end
	local str = " skill_npc = \""..npc.."\"; "
	str = str .." skill_all = \""..s.."\"; "
	str = str .." skill_tab = "..data.."; "
	lualib:ShowFormWithContent(player, "脚本表单", str)
	lualib:ShowFormWithContent(player, "form文件表单", "技能强化Wnd")
	return ""
end


function main(player, idx)
	local idx = tonumber(idx)
	if tab[idx] == nil then
		showmsg(player, "传递了非法数据。")
		return ""
	end
	local lv = lualib:GetInt(player, "skill_lv"..idx) + 1
	if tab[idx][lv] == nil then
		showmsg(player, "#COLORCOLOR_YELLOW#当前技能已经达到最高等级。#COLOREND#")
		return ""
	end
	if not lualib:HasSkill(player, tab[idx][lv].own, false) then
		showmsg(player, "#COLORCOLOR_YELLOW#您需要先领悟上一级#COLORCOLOR_RED#"..tab[idx].name.."。#COLOREND#")
		return ""
	end
	local level = lualib:Level(player)
	if level < tab[idx][lv].lv then
		showmsg(player, "#COLORCOLOR_YELLOW#您的等级不足。#COLOREND#")
		return ""
	end
	if not lualib:DelItem(player, tab[idx][lv].it[1], tab[idx][lv].it[2], 2, "技能升级", player) then
		showmsg(player, "#COLORCOLOR_YELLOW#您的书页数量不足。")
		return ""
	end
	local rate = tab[idx][lv].ingot
	if lualib:GenRandom(1, 100) > rate then
		showmsg(player, "#COLORCOLOR_YELLOW#很遗憾本次技能强化失败了。#COLOREND#")
		return ""
	end
	lualib:AddSkill(player, tab[idx][lv].key)
	lualib:SetInt(player, "skill_lv"..idx, lv)
	local str = [[
		Skill.state[]]..idx..[[] = ]]..lv..[[;
		Skill.Update(]]..idx..[[, ]]..lv..[[);
	]]
	lualib:ShowFormWithContent(player, "脚本表单", str)
	local msg = "恭喜玩家：『".. lualib:Name(player) .."』成功将技能:"..tab[idx].name.."提升一级,他在战斗中伤害更加爆炸。"
	lualib:SysMsg_SendBroadcastColor(msg, "", 1, 7)
	showmsg(player, "#COLORCOLOR_PURPLE#恭喜您将#COLORCOLOR_GREENG#"..tab[idx].name.."#COLORCOLOR_PURPLE#成功提升一级。#COLOREND#")
	return ""
end

function showmsg(player, msg)
	lualib:ShowFormWithContent(player, "脚本表单", "MessageBox(0, \""..msg.."\")")
end