local data = [[
cultivation_t = {--转生数据表
	[0] = {
		ysn = "未修仙",--境界名称
		att = "0 - 0\n#OFFSET<Y:16>#0 - 0\n#OFFSET<Y:16>#0 - 0\n#OFFSET<Y:16>#0 - 0\n#OFFSET<Y:16>#0 - 0\n#OFFSET<Y:16>#0",--属性值
	},
	[1] = {
		ysn = "筑基境(一重)",--境界名称
		buf = "筑基境1重",--给予buff
		llz = 100,--消耗修仙值
		att = "50 - 50\n#OFFSET<Y:16>#50 - 50\n#OFFSET<Y:16>#50 - 50\n#OFFSET<Y:16>#50 - 50\n#OFFSET<Y:16>#50 - 50\n#OFFSET<Y:16>#500",--属性值
	},
	[2] = {
		ysn = "筑基境(二重)",--境界名称
		buf = "筑基境2重",--给予buff
		llz = 100,--消耗修仙值
		att = "100 - 100\n#OFFSET<Y:16>#100 - 100\n#OFFSET<Y:16>#100 - 100\n#OFFSET<Y:16>#100 - 100\n#OFFSET<Y:16>#100 - 100\n#OFFSET<Y:16>#1000",--属性值
	},
	[3] = {
		ysn = "筑基境(三重)",--境界名称
		buf = "筑基境3重",--给予buff
		llz = 100,--消耗修仙值
		att = "150 - 150\n#OFFSET<Y:16>#150 - 150\n#OFFSET<Y:16>#150 - 150\n#OFFSET<Y:16>#150 - 150\n#OFFSET<Y:16>#150 - 150\n#OFFSET<Y:16>#1500",--属性值
	},
	[4] = {
		ysn = "筑基境(四重)",--境界名称
		buf = "筑基境4重",--给予buff
		llz = 100,--消耗修仙值
		att = "200 - 200\n#OFFSET<Y:16>#200 - 200\n#OFFSET<Y:16>#200 - 200\n#OFFSET<Y:16>#200 - 200\n#OFFSET<Y:16>#200 - 200\n#OFFSET<Y:16>#2000",--属性值
	},
	[5] = {
		ysn = "筑基境(五重)",--境界名称
		buf = "筑基境5重",--给予buff
		llz = 100,--消耗修仙值
		att = "250 - 250\n#OFFSET<Y:16>#250 - 250\n#OFFSET<Y:16>#250 - 250\n#OFFSET<Y:16>#250 - 250\n#OFFSET<Y:16>#250 - 250\n#OFFSET<Y:16>#2500",--属性值
	},
	[6] = {
		ysn = "筑基境(六重)",--境界名称
		buf = "筑基境6重",--给予buff
		llz = 100,--消耗修仙值
		att = "300 - 300\n#OFFSET<Y:16>#300 - 300\n#OFFSET<Y:16>#300 - 300\n#OFFSET<Y:16>#300 - 300\n#OFFSET<Y:16>#300 - 300\n#OFFSET<Y:16>#3000",--属性值
	},
	[7] = {
		ysn = "筑基境(七重)",--境界名称
		buf = "筑基境7重",--给予buff
		llz = 100,--消耗修仙值
		att = "350 - 350\n#OFFSET<Y:16>#350 - 350\n#OFFSET<Y:16>#350 - 350\n#OFFSET<Y:16>#350 - 350\n#OFFSET<Y:16>#350 - 350\n#OFFSET<Y:16>#3500",--属性值
	},
	[8] = {
		ysn = "筑基境(八重)",--境界名称
		buf = "筑基境8重",--给予buff
		llz = 100,--消耗修仙值
		att = "400 - 400\n#OFFSET<Y:16>#400 - 400\n#OFFSET<Y:16>#400 - 400\n#OFFSET<Y:16>#400 - 400\n#OFFSET<Y:16>#400 - 400\n#OFFSET<Y:16>#4000",--属性值
	},
	[9] = {
		ysn = "筑基境(九重)",--境界名称
		buf = "筑基境9重",--给予buff
		llz = 100,--消耗修仙值
		att = "450 - 450\n#OFFSET<Y:16>#450 - 450\n#OFFSET<Y:16>#450 - 450\n#OFFSET<Y:16>#450 - 450\n#OFFSET<Y:16>#450 - 450\n#OFFSET<Y:16>#4500",--属性值
	},
	[10] = {
		ysn = "筑基境(十重)",--境界名称
		buf = "筑基境10重",--给予buff
		llz = 300,--消耗修仙值
		att = "500 - 500\n#OFFSET<Y:16>#500 - 500\n#OFFSET<Y:16>#500 - 500\n#OFFSET<Y:16>#500 - 500\n#OFFSET<Y:16>#500 - 500\n#OFFSET<Y:16>#5000",--属性值
	},
	[11] = {
		ysn = "融合境(一重)",--境界名称
		buf = "开光境1重",--给予buff
		llz = 300,--消耗修仙值
		att = "600 - 600\n#OFFSET<Y:16>#600 - 600\n#OFFSET<Y:16>#600 - 600\n#OFFSET<Y:16>#600 - 600\n#OFFSET<Y:16>#600 - 600\n#OFFSET<Y:16>#6000",--属性值
	},
	[12] = {
		ysn = "融合境(二重)",--境界名称
		buf = "开光境2重",--给予buff
		llz = 300,--消耗修仙值
		att = "700 - 700\n#OFFSET<Y:16>#700 - 700\n#OFFSET<Y:16>#700 - 700\n#OFFSET<Y:16>#700 - 700\n#OFFSET<Y:16>#700 - 700\n#OFFSET<Y:16>#7000",--属性值
	},
	[13] = {
		ysn = "融合境(三重)",--境界名称
		buf = "开光境3重",--给予buff
		llz = 300,--消耗修仙值
		att = "800 - 800\n#OFFSET<Y:16>#800 - 800\n#OFFSET<Y:16>#800 - 800\n#OFFSET<Y:16>#800 - 800\n#OFFSET<Y:16>#800 - 800\n#OFFSET<Y:16>#8000",--属性值
	},
	[14] = {
		ysn = "融合境(四重)",--境界名称
		buf = "开光境4重",--给予buff
		llz = 300,--消耗修仙值
		att = "900 - 900\n#OFFSET<Y:16>#900 - 900\n#OFFSET<Y:16>#900 - 900\n#OFFSET<Y:16>#900 - 900\n#OFFSET<Y:16>#900 - 900\n#OFFSET<Y:16>#9000",--属性值
	},
	[15] = {
		ysn = "融合境(五重)",--境界名称
		buf = "开光境5重",--给予buff
		llz = 300,--消耗修仙值
		att = "1000-1000\n#OFFSET<Y:16>#1000-1000\n#OFFSET<Y:16>#1000-1000\n#OFFSET<Y:16>#1000-1000\n#OFFSET<Y:16>#1000-1000\n#OFFSET<Y:16>#10000",--属性值
	},
	[16] = {
		ysn = "融合境(六重)",--境界名称
		buf = "开光境6重",--给予buff
		llz = 300,--消耗修仙值
		att = "1100-1100\n#OFFSET<Y:16>#1100-1100\n#OFFSET<Y:16>#1100-1100\n#OFFSET<Y:16>#1100-1100\n#OFFSET<Y:16>#1100-1100\n#OFFSET<Y:16>#11000",--属性值
	},
	[17] = {
		ysn = "融合境(七重)",--境界名称
		buf = "开光境7重",--给予buff
		llz = 300,--消耗修仙值
		att = "1200-1200\n#OFFSET<Y:16>#1200-1200\n#OFFSET<Y:16>#1200-1200\n#OFFSET<Y:16>#1200-1200\n#OFFSET<Y:16>#1200-1200\n#OFFSET<Y:16>#12000",--属性值
	},
	[18] = {
		ysn = "融合境(八重)",--境界名称
		buf = "开光境8重",--给予buff
		llz = 300,--消耗修仙值
		att = "1300-1300\n#OFFSET<Y:16>#1300-1300\n#OFFSET<Y:16>#1300-1300\n#OFFSET<Y:16>#1300-1300\n#OFFSET<Y:16>#1300-1300\n#OFFSET<Y:16>#13000",--属性值
	},
	[19] = {
		ysn = "融合境(九重)",--境界名称
		buf = "开光境9重",--给予buff
		llz = 300,--消耗修仙值
		att = "1400-1400\n#OFFSET<Y:16>#1400-1400\n#OFFSET<Y:16>#1400-1400\n#OFFSET<Y:16>#1400-1400\n#OFFSET<Y:16>#1400-1400\n#OFFSET<Y:16>#14000",--属性值
	},
	[20] = {
		ysn = "融合境(十重)",--境界名称
		buf = "开光境10重",--给予buff
		llz = 500,--消耗修仙值
		att = "1500-1500\n#OFFSET<Y:16>#1500-1500\n#OFFSET<Y:16>#1500-1500\n#OFFSET<Y:16>#1500-1500\n#OFFSET<Y:16>#1500-1500\n#OFFSET<Y:16>#15000",--属性值
	},
	[21] = {
		ysn = "金丹境(一重)",--境界名称
		buf = "融合境1重",--给予buff
		llz = 500,--消耗修仙值
		att = "1650-1650\n#OFFSET<Y:16>#1650-1650\n#OFFSET<Y:16>#1650-1650\n#OFFSET<Y:16>#1650-1650\n#OFFSET<Y:16>#1650-1650\n#OFFSET<Y:16>#16500",--属性值
	},
	[22] = {
		ysn = "金丹境(二重)",--境界名称
		buf = "融合境2重",--给予buff
		llz = 500,--消耗修仙值
		att = "1800-1800\n#OFFSET<Y:16>#1800-1800\n#OFFSET<Y:16>#1800-1800\n#OFFSET<Y:16>#1800-1800\n#OFFSET<Y:16>#1800-1800\n#OFFSET<Y:16>#18000",--属性值
	},
	[23] = {
		ysn = "金丹境(三重)",--境界名称
		buf = "融合境3重",--给予buff
		llz = 500,--消耗修仙值
		att = "1950-1950\n#OFFSET<Y:16>#1950-1950\n#OFFSET<Y:16>#1950-1950\n#OFFSET<Y:16>#1950-1950\n#OFFSET<Y:16>#1950-1950\n#OFFSET<Y:16>#19500",--属性值
	},
	[24] = {
		ysn = "金丹境(四重)",--境界名称
		buf = "融合境4重",--给予buff
		llz = 500,--消耗修仙值
		att = "2100-2100\n#OFFSET<Y:16>#2100-2100\n#OFFSET<Y:16>#2100-2100\n#OFFSET<Y:16>#2100-2100\n#OFFSET<Y:16>#2100-2100\n#OFFSET<Y:16>#21000",--属性值
	},
	[25] = {
		ysn = "金丹境(五重)",--境界名称
		buf = "融合境5重",--给予buff
		llz = 500,--消耗修仙值
		att = "2250-2250\n#OFFSET<Y:16>#2250-2250\n#OFFSET<Y:16>#2250-2250\n#OFFSET<Y:16>#2250-2250\n#OFFSET<Y:16>#2250-2250\n#OFFSET<Y:16>#22500",--属性值
	},
	[26] = {
		ysn = "金丹境(六重)",--境界名称
		buf = "融合境6重",--给予buff
		llz = 500,--消耗修仙值
		att = "2400-2400\n#OFFSET<Y:16>#2400-2400\n#OFFSET<Y:16>#2400-2400\n#OFFSET<Y:16>#2400-2400\n#OFFSET<Y:16>#2400-2400\n#OFFSET<Y:16>#24000",--属性值
	},
	[27] = {
		ysn = "金丹境(七重)",--境界名称
		buf = "融合境7重",--给予buff
		llz = 500,--消耗修仙值
		att = "2550-2550\n#OFFSET<Y:16>#2550-2550\n#OFFSET<Y:16>#2550-2550\n#OFFSET<Y:16>#2550-2550\n#OFFSET<Y:16>#2550-2550\n#OFFSET<Y:16>#25500",--属性值
	},
	[28] = {
		ysn = "金丹境(八重)",--境界名称
		buf = "融合境8重",--给予buff
		llz = 500,--消耗修仙值
		att = "2700-2700\n#OFFSET<Y:16>#2700-2700\n#OFFSET<Y:16>#2700-2700\n#OFFSET<Y:16>#2700-2700\n#OFFSET<Y:16>#2700-2700\n#OFFSET<Y:16>#27000",--属性值
	},
	[29] = {
		ysn = "金丹境(九重)",--境界名称
		buf = "融合境9重",--给予buff
		llz = 500,--消耗修仙值
		att = "2850-2850\n#OFFSET<Y:16>#2850-2850\n#OFFSET<Y:16>#2850-2850\n#OFFSET<Y:16>#2850-2850\n#OFFSET<Y:16>#2850-2850\n#OFFSET<Y:16>#28500",--属性值
	},
	[30] = {
		ysn = "金丹境(十重)",--境界名称
		buf = "融合境10重",--给予buff
		llz = 1000,--消耗修仙值
		att = "3000-3000\n#OFFSET<Y:16>#3000-3000\n#OFFSET<Y:16>#3000-3000\n#OFFSET<Y:16>#3000-3000\n#OFFSET<Y:16>#3000-3000\n#OFFSET<Y:16>#30000",--属性值
	},
	[31] = {
		ysn = "元婴境(一重)",--境界名称
		buf = "心动境1重",--给予buff
		llz = 1000,--消耗修仙值
		att = "3200-3200\n#OFFSET<Y:16>#3200-3200\n#OFFSET<Y:16>#3200-3200\n#OFFSET<Y:16>#3200-3200\n#OFFSET<Y:16>#3200-3200\n#OFFSET<Y:16>#32000",--属性值
	},
	[32] = {
		ysn = "元婴境(二重)",--境界名称
		buf = "心动境2重",--给予buff
		llz = 1000,--消耗修仙值
		att = "3400-3400\n#OFFSET<Y:16>#3400-3400\n#OFFSET<Y:16>#3400-3400\n#OFFSET<Y:16>#3400-3400\n#OFFSET<Y:16>#3400-3400\n#OFFSET<Y:16>#34000",--属性值
	},
	[33] = {
		ysn = "元婴境(三重)",--境界名称
		buf = "心动境3重",--给予buff
		llz = 1000,--消耗修仙值
		att = "3600-3600\n#OFFSET<Y:16>#3600-3600\n#OFFSET<Y:16>#3600-3600\n#OFFSET<Y:16>#3600-3600\n#OFFSET<Y:16>#3600-3600\n#OFFSET<Y:16>#36000",--属性值
	},
	[34] = {
		ysn = "元婴境(四重)",--境界名称
		buf = "心动境4重",--给予buff
		llz = 1000,--消耗修仙值
		att = "3800-3800\n#OFFSET<Y:16>#3800-3800\n#OFFSET<Y:16>#3800-3800\n#OFFSET<Y:16>#3800-3800\n#OFFSET<Y:16>#3800-3800\n#OFFSET<Y:16>#38000",--属性值
	},
	[35] = {
		ysn = "元婴境(五重)",--境界名称
		buf = "心动境5重",--给予buff
		llz = 1000,--消耗修仙值
		att = "4000-4000\n#OFFSET<Y:16>#4000-4000\n#OFFSET<Y:16>#4000-4000\n#OFFSET<Y:16>#4000-4000\n#OFFSET<Y:16>#4000-4000\n#OFFSET<Y:16>#40000",--属性值
	},
	[36] = {
		ysn = "元婴境(六重)",--境界名称
		buf = "心动境6重",--给予buff
		llz = 1000,--消耗修仙值
		att = "4200-4200\n#OFFSET<Y:16>#4200-4200\n#OFFSET<Y:16>#4200-4200\n#OFFSET<Y:16>#4200-4200\n#OFFSET<Y:16>#4200-4200\n#OFFSET<Y:16>#42000",--属性值
	},
	[37] = {
		ysn = "元婴境(七重)",--境界名称
		buf = "心动境7重",--给予buff
		llz = 1000,--消耗修仙值
		att = "4400-4400\n#OFFSET<Y:16>#4400-4400\n#OFFSET<Y:16>#4400-4400\n#OFFSET<Y:16>#4400-4400\n#OFFSET<Y:16>#4400-4400\n#OFFSET<Y:16>#44000",--属性值
	},
	[38] = {
		ysn = "元婴境(八重)",--境界名称
		buf = "心动境8重",--给予buff
		llz = 1000,--消耗修仙值
		att = "4600-4600\n#OFFSET<Y:16>#4600-4600\n#OFFSET<Y:16>#4600-4600\n#OFFSET<Y:16>#4600-4600\n#OFFSET<Y:16>#4600-4600\n#OFFSET<Y:16>#46000",--属性值
	},
	[39] = {
		ysn = "元婴境(九重)",--境界名称
		buf = "心动境9重",--给予buff
		llz = 1000,--消耗修仙值
		att = "4800-4800\n#OFFSET<Y:16>#4800-4800\n#OFFSET<Y:16>#4800-4800\n#OFFSET<Y:16>#4800-4800\n#OFFSET<Y:16>#4800-4800\n#OFFSET<Y:16>#48000",--属性值
	},
	[40] = {
		ysn = "元婴境(十重)",--境界名称
		buf = "心动境10重",--给予buff
		llz = 2000,--消耗修仙值
		att = "5000-5000\n#OFFSET<Y:16>#5000-5000\n#OFFSET<Y:16>#5000-5000\n#OFFSET<Y:16>#5000-5000\n#OFFSET<Y:16>#5000-5000\n#OFFSET<Y:16>#50000",--属性值
	},
	[41] = {
		ysn = "洞虚境(一重)",--境界名称
		buf = "金丹境1重",--给予buff
		llz = 2000,--消耗修仙值
		att = "5300-5300\n#OFFSET<Y:16>#5300-5300\n#OFFSET<Y:16>#5300-5300\n#OFFSET<Y:16>#5300-5300\n#OFFSET<Y:16>#5300-5300\n#OFFSET<Y:16>#53000",--属性值
	},
	[42] = {
		ysn = "洞虚境(二重)",--境界名称
		buf = "金丹境2重",--给予buff
		llz = 2000,--消耗修仙值
		att = "5600-5600\n#OFFSET<Y:16>#5600-5600\n#OFFSET<Y:16>#5600-5600\n#OFFSET<Y:16>#5600-5600\n#OFFSET<Y:16>#5600-5600\n#OFFSET<Y:16>#56000",--属性值
	},
	[43] = {
		ysn = "洞虚境(三重)",--境界名称
		buf = "金丹境3重",--给予buff
		llz = 2000,--消耗修仙值
		att = "5900-5900\n#OFFSET<Y:16>#5900-5900\n#OFFSET<Y:16>#5900-5900\n#OFFSET<Y:16>#5900-5900\n#OFFSET<Y:16>#5900-5900\n#OFFSET<Y:16>#59000",--属性值
	},                                                                                                     
	[44] = {                                                                                               
		ysn = "洞虚境(四重)",--境界名称                                                                    
		buf = "金丹境4重",--给予buff                                                                       
		llz = 2000,--消耗修仙值                                                                          
		att = "6200-6200\n#OFFSET<Y:16>#6200-6200\n#OFFSET<Y:16>#6200-6200\n#OFFSET<Y:16>#6200-6200\n#OFFSET<Y:16>#6200-6200\n#OFFSET<Y:16>#62000",--属性值
	},                                                                                                     
	[45] = {                                                                                               
		ysn = "洞虚境(五重)",--境界名称                                                                    
		buf = "金丹境5重",--给予buff                                                                       
		llz = 2000,--消耗修仙值                                                                          
		att = "6500-6500\n#OFFSET<Y:16>#6500-6500\n#OFFSET<Y:16>#6500-6500\n#OFFSET<Y:16>#6500-6500\n#OFFSET<Y:16>#6500-6500\n#OFFSET<Y:16>#65000",--属性值
	},                                                                                                     
	[46] = {                                                                                               
		ysn = "洞虚境(六重)",--境界名称                                                                    
		buf = "金丹境6重",--给予buff                                                                       
		llz = 2000,--消耗修仙值                                                                          
		att = "6800-6800\n#OFFSET<Y:16>#6800-6800\n#OFFSET<Y:16>#6800-6800\n#OFFSET<Y:16>#6800-6800\n#OFFSET<Y:16>#6800-6800\n#OFFSET<Y:16>#68000",--属性值
	},                                                                                                     
	[47] = {                                                                                               
		ysn = "洞虚境(七重)",--境界名称                                                                    
		buf = "金丹境7重",--给予buff                                                                       
		llz = 2000,--消耗修仙值                                                                          
		att = "7100-7100\n#OFFSET<Y:16>#7100-7100\n#OFFSET<Y:16>#7100-7100\n#OFFSET<Y:16>#7100-7100\n#OFFSET<Y:16>#7100-7100\n#OFFSET<Y:16>#71000",--属性值
	},                                                                                                     
	[48] = {                                                                                               
		ysn = "洞虚境(八重)",--境界名称                                                                    
		buf = "金丹境8重",--给予buff                                                                       
		llz = 2000,--消耗修仙值                                                                          
		att = "7400-7400\n#OFFSET<Y:16>#7400-7400\n#OFFSET<Y:16>#7400-7400\n#OFFSET<Y:16>#7400-7400\n#OFFSET<Y:16>#7400-7400\n#OFFSET<Y:16>#74000",--属性值
	},                                                                                                     
	[49] = {                                                                                               
		ysn = "洞虚境(九重)",--境界名称                                                                    
		buf = "金丹境9重",--给予buff                                                                       
		llz = 2000,--消耗修仙值                                                                          
		att = "7700-7700\n#OFFSET<Y:16>#7700-7700\n#OFFSET<Y:16>#7700-7700\n#OFFSET<Y:16>#7700-7700\n#OFFSET<Y:16>#7700-7700\n#OFFSET<Y:16>#77000",--属性值
	},                                                                                                     
	[50] = {                                                                                               
		ysn = "洞虚境(十重)",--境界名称                                                                    
		buf = "金丹境10重",--给予buff                                                                      
		llz = 3000,--消耗修仙值                                                                          
		att = "8000-8000\n#OFFSET<Y:16>#8000-8000\n#OFFSET<Y:16>#8000-8000\n#OFFSET<Y:16>#8000-8000\n#OFFSET<Y:16>#8000-8000\n#OFFSET<Y:16>#80000",--属性值
	},                                                                                                     
	[51] = {                                                                                               
		ysn = "大乘境(一重)",--境界名称                                                                    
		buf = "元婴境1重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "8400-8400\n#OFFSET<Y:16>#8400-8400\n#OFFSET<Y:16>#8400-8400\n#OFFSET<Y:16>#8400-8400\n#OFFSET<Y:16>#8400-8400\n#OFFSET<Y:16>#84000",--属性值
	},                                                                                                     
	[52] = {                                                                                               
		ysn = "大乘境(二重)",--境界名称                                                                    
		buf = "元婴境2重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "8800-8800\n#OFFSET<Y:16>#8800-8800\n#OFFSET<Y:16>#8800-8800\n#OFFSET<Y:16>#8800-8800\n#OFFSET<Y:16>#8800-8800\n#OFFSET<Y:16>#88000",--属性值
	},                                                                                                     
	[53] = {                                                                                               
		ysn = "大乘境(三重)",--境界名称                                                                    
		buf = "元婴3重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "9200-9200\n#OFFSET<Y:16>#9200-9200\n#OFFSET<Y:16>#9200-9200\n#OFFSET<Y:16>#9200-9200\n#OFFSET<Y:16>#9200-9200\n#OFFSET<Y:16>#92000",--属性值
	},                                                                                                     
	[54] = {                                                                                               
		ysn = "大乘境(四重)",--境界名称                                                                    
		buf = "元婴境4重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "9600-9600\n#OFFSET<Y:16>#9600-9600\n#OFFSET<Y:16>#9600-9600\n#OFFSET<Y:16>#9600-9600\n#OFFSET<Y:16>#9600-9600\n#OFFSET<Y:16>#96000",--属性值
	},                                                                                                     
	[55] = {                                                                                               
		ysn = "大乘境(五重)",--境界名称                                                                    
		buf = "元婴境5重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "10000-10000\n#OFFSET<Y:16>#10000-10000\n#OFFSET<Y:16>#10000-10000\n#OFFSET<Y:16>#10000-10000\n#OFFSET<Y:16>#10000-10000\n#OFFSET<Y:16>#100000",--属性值
	},                                                                                                     
	[56] = {                                                                                               
		ysn = "大乘境(六重)",--境界名称                                                                    
		buf = "元婴境6重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "10400-10400\n#OFFSET<Y:16>#10400-10400\n#OFFSET<Y:16>#10400-10400\n#OFFSET<Y:16>#10400-10400\n#OFFSET<Y:16>#10400-10400\n#OFFSET<Y:16>#104000",--属性值
	},                                                                                                     
	[57] = {                                                                                               
		ysn = "大乘境(七重)",--境界名称                                                                    
		buf = "元婴境7重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "10800-10800\n#OFFSET<Y:16>#10800-10800\n#OFFSET<Y:16>#10800-10800\n#OFFSET<Y:16>#10800-10800\n#OFFSET<Y:16>#10800-10800\n#OFFSET<Y:16>#108000",--属性值
	},                                                                                                     
	[58] = {                                                                                               
		ysn = "大乘境(八重)",--境界名称                                                                    
		buf = "元婴境8重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "11200-11200\n#OFFSET<Y:16>#11200-11200\n#OFFSET<Y:16>#11200-11200\n#OFFSET<Y:16>#11200-11200\n#OFFSET<Y:16>#11200-11200\n#OFFSET<Y:16>#112000",--属性值
	},                                                                                                     
	[59] = {                                                                                               
		ysn = "大乘境(九重)",--境界名称                                                                    
		buf = "元婴境9重",--给予buff                                                                       
		llz = 3000,--消耗修仙值                                                                          
		att = "11600-11600\n#OFFSET<Y:16>#11600-11600\n#OFFSET<Y:16>#11600-11600\n#OFFSET<Y:16>#11600-11600\n#OFFSET<Y:16>#11600-11600\n#OFFSET<Y:16>#116000",--属性值
	},                                                                                                     
	[60] = {                                                                                               
		ysn = "大乘境(十重)",--境界名称                                                                    
		buf = "元婴境10重",--给予buff                                                                      
		llz = 4000,--消耗修仙值                                                                          
		att = "12000-12000\n#OFFSET<Y:16>#12000-12000\n#OFFSET<Y:16>#12000-12000\n#OFFSET<Y:16>#12000-12000\n#OFFSET<Y:16>#12000-12000\n#OFFSET<Y:16>#120000",--属性值
	},                                                                                                     
	[61] = {                                                                                               
		ysn = "渡劫境(一重)",--境界名称                                                                    
		buf = "出窍境1重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "12500-12500\n#OFFSET<Y:16>#12500-12500\n#OFFSET<Y:16>#12500-12500\n#OFFSET<Y:16>#12500-12500\n#OFFSET<Y:16>#12500-12500\n#OFFSET<Y:16>#125000",--属性值
	},                                                                                                     
	[62] = {                                                                                               
		ysn = "渡劫境(二重)",--境界名称                                                                    
		buf = "出窍境2重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "13000-13000\n#OFFSET<Y:16>#13000-13000\n#OFFSET<Y:16>#13000-13000\n#OFFSET<Y:16>#13000-13000\n#OFFSET<Y:16>#13000-13000\n#OFFSET<Y:16>#130000",--属性值
	},                                                                                                     
	[63] = {                                                                                               
		ysn = "渡劫境(三重)",--境界名称                                                                    
		buf = "出窍境3重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "13500-13500\n#OFFSET<Y:16>#13500-13500\n#OFFSET<Y:16>#13500-13500\n#OFFSET<Y:16>#13500-13500\n#OFFSET<Y:16>#13500-13500\n#OFFSET<Y:16>#135000",--属性值
	},                                                                                                     
	[64] = {                                                                                               
		ysn = "渡劫境(四重)",--境界名称                                                                    
		buf = "出窍境4重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "14000-14000\n#OFFSET<Y:16>#14000-14000\n#OFFSET<Y:16>#14000-14000\n#OFFSET<Y:16>#14000-14000\n#OFFSET<Y:16>#14000-14000\n#OFFSET<Y:16>#140000",--属性值
	},                                                                                                     
	[65] = {                                                                                               
		ysn = "渡劫境(五重)",--境界名称                                                                    
		buf = "出窍境5重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "14500-14500\n#OFFSET<Y:16>#14500-14500\n#OFFSET<Y:16>#14500-14500\n#OFFSET<Y:16>#14500-14500\n#OFFSET<Y:16>#14500-14500\n#OFFSET<Y:16>#145000",--属性值
	},                                                                                                     
	[66] = {                                                                                               
		ysn = "渡劫境(六重)",--境界名称                                                                    
		buf = "出窍境6重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "15000-15000\n#OFFSET<Y:16>#15000-15000\n#OFFSET<Y:16>#15000-15000\n#OFFSET<Y:16>#15000-15000\n#OFFSET<Y:16>#15000-15000\n#OFFSET<Y:16>#150000",--属性值
	},                                                                                                     
	[67] = {                                                                                               
		ysn = "渡劫境(七重)",--境界名称                                                                    
		buf = "出窍境7重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "15500-15500\n#OFFSET<Y:16>#15500-15500\n#OFFSET<Y:16>#15500-15500\n#OFFSET<Y:16>#15500-15500\n#OFFSET<Y:16>#15500-15500\n#OFFSET<Y:16>#155000",--属性值
	},                                                                                                     
	[68] = {                                                                                               
		ysn = "渡劫境(八重)",--境界名称                                                                    
		buf = "出窍境8重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "16000-16000\n#OFFSET<Y:16>#16000-16000\n#OFFSET<Y:16>#16000-16000\n#OFFSET<Y:16>#16000-16000\n#OFFSET<Y:16>#16000-16000\n#OFFSET<Y:16>#160000",--属性值
	},                                                                                                     
	[69] = {                                                                                               
		ysn = "渡劫境(九重)",--境界名称                                                                    
		buf = "出窍境9重",--给予buff                                                                       
		llz = 4000,--消耗修仙值                                                                          
		att = "16500-16500\n#OFFSET<Y:16>#16500-16500\n#OFFSET<Y:16>#16500-16500\n#OFFSET<Y:16>#16500-16500\n#OFFSET<Y:16>#16500-16500\n#OFFSET<Y:16>#165000",--属性值
	},                                                                                                     
	[70] = {                                                                                               
		ysn = "渡劫境(十重)",--境界名称                                                                    
		buf = "出窍境10重",--给予buff                                                                      
		llz = 5000,--消耗修仙值                                                                          
		att = "17000-17000\n#OFFSET<Y:16>#17000-17000\n#OFFSET<Y:16>#17000-17000\n#OFFSET<Y:16>#17000-17000\n#OFFSET<Y:16>#17000-17000\n#OFFSET<Y:16>#170000",--属性值
	},                                                                                                     
	[71] = {                                                                                               
		ysn = "散仙(一重)",--境界名称                                                                    
		buf = "分神境1重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "17600-17600\n#OFFSET<Y:16>#17600-17600\n#OFFSET<Y:16>#17600-17600\n#OFFSET<Y:16>#17600-17600\n#OFFSET<Y:16>#17600-17600\n#OFFSET<Y:16>#176000",--属性值
	},                                                                                                     
	[72] = {                                                                                               
		ysn = "散仙(二重)",--境界名称                                                                    
		buf = "分神境2重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "18200-18200\n#OFFSET<Y:16>#18200-18200\n#OFFSET<Y:16>#18200-18200\n#OFFSET<Y:16>#18200-18200\n#OFFSET<Y:16>#18200-18200\n#OFFSET<Y:16>#182000",--属性值
	},                                                                                                     
	[73] = {                                                                                               
		ysn = "散仙(三重)",--境界名称                                                                    
		buf = "分神境3重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "18800-18800\n#OFFSET<Y:16>#18800-18800\n#OFFSET<Y:16>#18800-18800\n#OFFSET<Y:16>#18800-18800\n#OFFSET<Y:16>#18800-18800\n#OFFSET<Y:16>#188000",--属性值
	},                                                                                                     
	[74] = {                                                                                               
		ysn = "散仙(四重)",--境界名称                                                                    
		buf = "分神境4重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "19400-19400\n#OFFSET<Y:16>#19400-19400\n#OFFSET<Y:16>#19400-19400\n#OFFSET<Y:16>#19400-19400\n#OFFSET<Y:16>#19400-19400\n#OFFSET<Y:16>#194000",--属性值
	},                                                                                                     
	[75] = {                                                                                               
		ysn = "散仙(五重)",--境界名称                                                                    
		buf = "分神境5重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "20000-20000\n#OFFSET<Y:16>#20000-20000\n#OFFSET<Y:16>#20000-20000\n#OFFSET<Y:16>#20000-20000\n#OFFSET<Y:16>#20000-20000\n#OFFSET<Y:16>#200000",--属性值
	},                                                                                                     
	[76] = {                                                                                               
		ysn = "散仙(六重)",--境界名称                                                                    
		buf = "分神境6重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "20600-20600\n#OFFSET<Y:16>#20600-20600\n#OFFSET<Y:16>#20600-20600\n#OFFSET<Y:16>#20600-20600\n#OFFSET<Y:16>#20600-20600\n#OFFSET<Y:16>#206000",--属性值
	},                                                                                                     
	[77] = {                                                                                               
		ysn = "散仙(七重)",--境界名称                                                                    
		buf = "分神境7重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "21200-21200\n#OFFSET<Y:16>#21200-21200\n#OFFSET<Y:16>#21200-21200\n#OFFSET<Y:16>#21200-21200\n#OFFSET<Y:16>#21200-21200\n#OFFSET<Y:16>#212000",--属性值
	},                                                                                                     
	[78] = {                                                                                               
		ysn = "散仙(八重)",--境界名称                                                                    
		buf = "分神境8重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "21800-21800\n#OFFSET<Y:16>#21800-21800\n#OFFSET<Y:16>#21800-21800\n#OFFSET<Y:16>#21800-21800\n#OFFSET<Y:16>#21800-21800\n#OFFSET<Y:16>#218000",--属性值
	},                                                                                                     
	[79] = {                                                                                               
		ysn = "散仙(九重)",--境界名称                                                                    
		buf = "分神境9重",--给予buff                                                                       
		llz = 5000,--消耗修仙值                                                                          
		att = "22400-22400\n#OFFSET<Y:16>#22400-22400\n#OFFSET<Y:16>#22400-22400\n#OFFSET<Y:16>#22400-22400\n#OFFSET<Y:16>#22400-22400\n#OFFSET<Y:16>#224000",--属性值
	},                                                                                                     
	[80] = {                                                                                               
		ysn = "散仙(十重)",--境界名称                                                                    
		buf = "分神境10重",--给予buff                                                                      
		llz = 6000,--消耗修仙值                                                                          
		att = "23000-23000\n#OFFSET<Y:16>#23000-23000\n#OFFSET<Y:16>#23000-23000\n#OFFSET<Y:16>#23000-23000\n#OFFSET<Y:16>#23000-23000\n#OFFSET<Y:16>#230000",--属性值
	},                                                                                                     
	[81] = {                                                                                               
		ysn = "太乙真仙(一重)",--境界名称                                                                    
		buf = "合体境1重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "23700-23700\n#OFFSET<Y:16>#23700-23700\n#OFFSET<Y:16>#23700-23700\n#OFFSET<Y:16>#23700-23700\n#OFFSET<Y:16>#23700-23700\n#OFFSET<Y:16>#237000",--属性值
	},                                                                                                     
	[82] = {                                                                                               
		ysn = "太乙真仙(二重)",--境界名称                                                                    
		buf = "合体境2重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "24400-24400\n#OFFSET<Y:16>#24400-24400\n#OFFSET<Y:16>#24400-24400\n#OFFSET<Y:16>#24400-24400\n#OFFSET<Y:16>#24400-24400\n#OFFSET<Y:16>#244000",--属性值
	},                                                                                                     
	[83] = {                                                                                               
		ysn = "太乙真仙(三重)",--境界名称                                                                    
		buf = "合体境3重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "25100-25100\n#OFFSET<Y:16>#25100-25100\n#OFFSET<Y:16>#25100-25100\n#OFFSET<Y:16>#25100-25100\n#OFFSET<Y:16>#25100-25100\n#OFFSET<Y:16>#251000",--属性值
	},                                                                                                     
	[84] = {                                                                                               
		ysn = "太乙真仙(四重)",--境界名称                                                                    
		buf = "合体境4重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "25800-25800\n#OFFSET<Y:16>#25800-25800\n#OFFSET<Y:16>#25800-25800\n#OFFSET<Y:16>#25800-25800\n#OFFSET<Y:16>#25800-25800\n#OFFSET<Y:16>#258000",--属性值
	},                                                                                                     
	[85] = {                                                                                               
		ysn = "太乙真仙(五重)",--境界名称                                                                    
		buf = "合体境5重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "26500-26500\n#OFFSET<Y:16>#26500-26500\n#OFFSET<Y:16>#26500-26500\n#OFFSET<Y:16>#26500-26500\n#OFFSET<Y:16>#26500-26500\n#OFFSET<Y:16>#265000",--属性值
	},                                                                                                     
	[86] = {                                                                                               
		ysn = "太乙真仙(六重)",--境界名称                                                                    
		buf = "合体境6重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "27200-27200\n#OFFSET<Y:16>#27200-27200\n#OFFSET<Y:16>#27200-27200\n#OFFSET<Y:16>#27200-27200\n#OFFSET<Y:16>#27200-27200\n#OFFSET<Y:16>#272000",--属性值
	},                                                                                                     
	[87] = {                                                                                               
		ysn = "太乙真仙(七重)",--境界名称                                                                    
		buf = "合体境7重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "27900-27900\n#OFFSET<Y:16>#27900-27900\n#OFFSET<Y:16>#27900-27900\n#OFFSET<Y:16>#27900-27900\n#OFFSET<Y:16>#27900-27900\n#OFFSET<Y:16>#279000",--属性值
	},                                                                                                     
	[88] = {                                                                                               
		ysn = "太乙真仙(八重)",--境界名称                                                                    
		buf = "合体境8重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "28600-28600\n#OFFSET<Y:16>#28600-28600\n#OFFSET<Y:16>#28600-28600\n#OFFSET<Y:16>#28600-28600\n#OFFSET<Y:16>#28600-28600\n#OFFSET<Y:16>#286000",--属性值
	},                                                                                                     
	[89] = {                                                                                               
		ysn = "太乙真仙(九重)",--境界名称                                                                    
		buf = "合体境9重",--给予buff                                                                       
		llz = 6000,--消耗修仙值                                                                          
		att = "29300-29300\n#OFFSET<Y:16>#29300-29300\n#OFFSET<Y:16>#29300-29300\n#OFFSET<Y:16>#29300-29300\n#OFFSET<Y:16>#29300-29300\n#OFFSET<Y:16>#293000",--属性值
	},                                                                                                     
	[90] = {                                                                                               
		ysn = "太乙真仙(十重)",--境界名称                                                                    
		buf = "合体境10重",--给予buff                                                                      
		llz = 7000,--消耗修仙值                                                                          
		att = "30000-30000\n#OFFSET<Y:16>#30000-30000\n#OFFSET<Y:16>#30000-30000\n#OFFSET<Y:16>#30000-30000\n#OFFSET<Y:16>#30000-30000\n#OFFSET<Y:16>#300000",--属性值
	},                                                                                                     
	[91] = {                                                                                               
		ysn = "太乙玄仙(一重)",--境界名称                                                                    
		buf = "洞虚境1重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "30800-30800\n#OFFSET<Y:16>#30800-30800\n#OFFSET<Y:16>#30800-30800\n#OFFSET<Y:16>#30800-30800\n#OFFSET<Y:16>#30800-30800\n#OFFSET<Y:16>#308000",--属性值
	},                                                                                                     
	[92] = {                                                                                               
		ysn = "太乙玄仙(二重)",--境界名称                                                                    
		buf = "洞虚境2重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "31600-31600\n#OFFSET<Y:16>#31600-31600\n#OFFSET<Y:16>#31600-31600\n#OFFSET<Y:16>#31600-31600\n#OFFSET<Y:16>#31600-31600\n#OFFSET<Y:16>#316000",--属性值
	},                                                                                                     
	[93] = {                                                                                               
		ysn = "太乙玄仙(三重)",--境界名称                                                                    
		buf = "洞虚境3重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "32400-32400\n#OFFSET<Y:16>#32400-32400\n#OFFSET<Y:16>#32400-32400\n#OFFSET<Y:16>#32400-32400\n#OFFSET<Y:16>#32400-32400\n#OFFSET<Y:16>#324000",--属性值
	},                                                                                                     
	[94] = {                                                                                               
		ysn = "太乙玄仙(四重)",--境界名称                                                                    
		buf = "洞虚境4重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "33200-33200\n#OFFSET<Y:16>#33200-33200\n#OFFSET<Y:16>#33200-33200\n#OFFSET<Y:16>#33200-33200\n#OFFSET<Y:16>#33200-33200\n#OFFSET<Y:16>#332000",--属性值
	},                                                                                                     
	[95] = {                                                                                               
		ysn = "太乙玄仙(五重)",--境界名称                                                                    
		buf = "洞虚境5重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "34000-34000\n#OFFSET<Y:16>#34000-34000\n#OFFSET<Y:16>#34000-34000\n#OFFSET<Y:16>#34000-34000\n#OFFSET<Y:16>#34000-34000\n#OFFSET<Y:16>#340000",--属性值
	},                                                                                                     
	[96] = {                                                                                               
		ysn = "太乙玄仙(六重)",--境界名称                                                                    
		buf = "洞虚境6重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "34800-34800\n#OFFSET<Y:16>#34800-34800\n#OFFSET<Y:16>#34800-34800\n#OFFSET<Y:16>#34800-34800\n#OFFSET<Y:16>#34800-34800\n#OFFSET<Y:16>#348000",--属性值
	},                                                                                                     
	[97] = {                                                                                               
		ysn = "太乙玄仙(七重)",--境界名称                                                                    
		buf = "洞虚境7重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "35600-35600\n#OFFSET<Y:16>#35600-35600\n#OFFSET<Y:16>#35600-35600\n#OFFSET<Y:16>#35600-35600\n#OFFSET<Y:16>#35600-35600\n#OFFSET<Y:16>#356000",--属性值
	},                                                                                                     
	[98] = {                                                                                               
		ysn = "太乙玄仙(八重)",--境界名称                                                                    
		buf = "洞虚境8重",--给予buff                                                                       
		llz = 7000,--消耗修仙值                                                                        
		att = "36400-36400\n#OFFSET<Y:16>#36400-36400\n#OFFSET<Y:16>#36400-36400\n#OFFSET<Y:16>#36400-36400\n#OFFSET<Y:16>#36400-36400\n#OFFSET<Y:16>#364000",--属性值
	},
	[99] = {
		ysn = "太乙玄仙(九重)",--境界名称
		buf = "洞虚境9重",--给予buff
		llz = 7000,--消耗修仙值
		att = "37200-37200\n#OFFSET<Y:16>#37200-37200\n#OFFSET<Y:16>#37200-37200\n#OFFSET<Y:16>#37200-37200\n#OFFSET<Y:16>#37200-37200\n#OFFSET<Y:16>#372000",--属性值
	},                                                                                                      
	[100] = {                                                                                               
		ysn = "太乙玄仙(十重)",--境界名称                                                                     
		buf = "洞虚境10重",--给予buff                                                                       
		llz = 8000,--消耗修仙值                                                                         
		att = "38000-38000\n#OFFSET<Y:16>#38000-38000\n#OFFSET<Y:16>#38000-38000\n#OFFSET<Y:16>#38000-38000\n#OFFSET<Y:16>#38000-38000\n#OFFSET<Y:16>#380000",--属性值
	},                                                                                                      
	[101] = {                                                                                               
		ysn = "大罗金仙(一重)",--境界名称                                                                     
		buf = "大乘境1重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "38900-38900\n#OFFSET<Y:16>#38900-38900\n#OFFSET<Y:16>#38900-38900\n#OFFSET<Y:16>#38900-38900\n#OFFSET<Y:16>#38900-38900\n#OFFSET<Y:16>#389000",--属性值
	},                                                                                                      
	[102] = {                                                                                               
		ysn = "大罗金仙(二重)",--境界名称                                                                     
		buf = "大乘境2重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "39800-39800\n#OFFSET<Y:16>#39800-39800\n#OFFSET<Y:16>#39800-39800\n#OFFSET<Y:16>#39800-39800\n#OFFSET<Y:16>#39800-39800\n#OFFSET<Y:16>#398000",--属性值
	},                                                                                                      
	[103] = {                                                                                               
		ysn = "大罗金仙(三重)",--境界名称                                                                     
		buf = "大乘境3重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "40700-40700\n#OFFSET<Y:16>#40700-40700\n#OFFSET<Y:16>#40700-40700\n#OFFSET<Y:16>#40700-40700\n#OFFSET<Y:16>#40700-40700\n#OFFSET<Y:16>#407000",--属性值
	},                                                                                                      
	[104] = {                                                                                               
		ysn = "大罗金仙(四重)",--境界名称                                                                     
		buf = "大乘境4重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "41600-41600\n#OFFSET<Y:16>#41600-41600\n#OFFSET<Y:16>#41600-41600\n#OFFSET<Y:16>#41600-41600\n#OFFSET<Y:16>#41600-41600\n#OFFSET<Y:16>#416000",--属性值
	},                                                                                                      
	[105] = {                                                                                               
		ysn = "大罗金仙(五重)",--境界名称                                                                     
		buf = "大乘境5重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "42500-42500\n#OFFSET<Y:16>#42500-42500\n#OFFSET<Y:16>#42500-42500\n#OFFSET<Y:16>#42500-42500\n#OFFSET<Y:16>#42500-42500\n#OFFSET<Y:16>#425000",--属性值
	},                                                                                                      
	[106] = {                                                                                               
		ysn = "大罗金仙(六重)",--境界名称                                                                     
		buf = "大乘境6重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "43400-43400\n#OFFSET<Y:16>#43400-43400\n#OFFSET<Y:16>#43400-43400\n#OFFSET<Y:16>#43400-43400\n#OFFSET<Y:16>#43400-43400\n#OFFSET<Y:16>#434000",--属性值
	},                                                                                                      
	[107] = {                                                                                               
		ysn = "大罗金仙(七重)",--境界名称                                                                     
		buf = "大乘境7重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "44300-44300\n#OFFSET<Y:16>#44300-44300\n#OFFSET<Y:16>#44300-44300\n#OFFSET<Y:16>#44300-44300\n#OFFSET<Y:16>#44300-44300\n#OFFSET<Y:16>#443000",--属性值
	},                                                                                                      
	[108] = {                                                                                               
		ysn = "大罗金仙(八重)",--境界名称                                                                     
		buf = "大乘境8重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "45200-45200\n#OFFSET<Y:16>#45200-45200\n#OFFSET<Y:16>#45200-45200\n#OFFSET<Y:16>#45200-45200\n#OFFSET<Y:16>#45200-45200\n#OFFSET<Y:16>#452000",--属性值
	},                                                                                                      
	[109] = {                                                                                               
		ysn = "大罗金仙(九重)",--境界名称                                                                     
		buf = "大乘境9重",--给予buff                                                                        
		llz = 8000,--消耗修仙值                                                                         
		att = "46100-46100\n#OFFSET<Y:16>#46100-46100\n#OFFSET<Y:16>#46100-46100\n#OFFSET<Y:16>#46100-46100\n#OFFSET<Y:16>#46100-46100\n#OFFSET<Y:16>#461000",--属性值
	},                                                                                                      
	[110] = {                                                                                               
		ysn = "大罗金仙(十重)",--境界名称                                                                     
		buf = "大乘境10重",--给予buff                                                                       
		llz = 9000,--消耗修仙值                                                                         
		att = "47000-47000\n#OFFSET<Y:16>#47000-47000\n#OFFSET<Y:16>#47000-47000\n#OFFSET<Y:16>#47000-47000\n#OFFSET<Y:16>#47000-47000\n#OFFSET<Y:16>#470000",--属性值

	},                                                                                                      
	[111] = {                                                                                               
		ysn = "混元大罗金仙(一重)",--境界名称                                                                     
		buf = "渡劫境1重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "48000-48000\n#OFFSET<Y:16>#48000-48000\n#OFFSET<Y:16>#48000-48000\n#OFFSET<Y:16>#48000-48000\n#OFFSET<Y:16>#48000-48000\n#OFFSET<Y:16>#480000",--属性值
	},                                                                                                      
	[112] = {                                                                                               
		ysn = "混元大罗金仙(二重)",--境界名称                                                                     
		buf = "渡劫境2重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "49000-49000\n#OFFSET<Y:16>#49000-49000\n#OFFSET<Y:16>#49000-49000\n#OFFSET<Y:16>#49000-49000\n#OFFSET<Y:16>#49000-49000\n#OFFSET<Y:16>#490000",--属性值
	},                                                                                                      
	[113] = {                                                                                               
		ysn = "混元大罗金仙(三重)",--境界名称                                                                     
		buf = "渡劫境3重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "50000-50000\n#OFFSET<Y:16>#50000-50000\n#OFFSET<Y:16>#50000-50000\n#OFFSET<Y:16>#50000-50000\n#OFFSET<Y:16>#50000-50000\n#OFFSET<Y:16>#500000",--属性值
	},                                                                                                      
	[114] = {                                                                                               
		ysn = "混元大罗金仙(四重)",--境界名称                                                                     
		buf = "渡劫境4重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "51000-51000\n#OFFSET<Y:16>#51000-51000\n#OFFSET<Y:16>#51000-51000\n#OFFSET<Y:16>#51000-51000\n#OFFSET<Y:16>#51000-51000\n#OFFSET<Y:16>#510000",--属性值
	},                                                                                                      
	[115] = {                                                                                               
		ysn = "混元大罗金仙(五重)",--境界名称                                                                     
		buf = "渡劫境5重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "52000-52000\n#OFFSET<Y:16>#52000-52000\n#OFFSET<Y:16>#52000-52000\n#OFFSET<Y:16>#52000-52000\n#OFFSET<Y:16>#52000-52000\n#OFFSET<Y:16>#520000",--属性值
	},                                                                                                      
	[116] = {                                                                                               
		ysn = "混元大罗金仙(六重)",--境界名称                                                                     
		buf = "渡劫境6重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "53000-53000\n#OFFSET<Y:16>#53000-53000\n#OFFSET<Y:16>#53000-53000\n#OFFSET<Y:16>#53000-53000\n#OFFSET<Y:16>#53000-53000\n#OFFSET<Y:16>#530000",--属性值
	},                                                                                                      
	[117] = {                                                                                               
		ysn = "混元大罗金仙(七重)",--境界名称                                                                     
		buf = "渡劫境7重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "54000-54000\n#OFFSET<Y:16>#54000-54000\n#OFFSET<Y:16>#54000-54000\n#OFFSET<Y:16>#54000-54000\n#OFFSET<Y:16>#54000-54000\n#OFFSET<Y:16>#540000",--属性值
	},                                                                                                      
	[118] = {                                                                                               
		ysn = "混元大罗金仙(八重)",--境界名称                                                                     
		buf = "渡劫境8重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "55000-55000\n#OFFSET<Y:16>#55000-55000\n#OFFSET<Y:16>#55000-55000\n#OFFSET<Y:16>#55000-55000\n#OFFSET<Y:16>#55000-55000\n#OFFSET<Y:16>#550000",--属性值
	},                                                                                                      
	[119] = {                                                                                               
		ysn = "混元大罗金仙(九重)",--境界名称                                                                     
		buf = "渡劫境9重",--给予buff                                                                        
		llz = 10000,--消耗修仙值                                                                         
		att = "56000-56000\n#OFFSET<Y:16>#56000-56000\n#OFFSET<Y:16>#56000-56000\n#OFFSET<Y:16>#56000-56000\n#OFFSET<Y:16>#56000-56000\n#OFFSET<Y:16>#560000",--属性值
	},                                                                                                      
	[120] = {                                                                                               
		ysn = "混元大罗金仙(十重)",--境界名称                                                                     
		buf = "渡劫境10重",--给予buff                                                                       
		llz = 160000,--消耗修仙值                                                                         
		att = "57000-57000\n#OFFSET<Y:16>#57000-57000\n#OFFSET<Y:16>#57000-57000\n#OFFSET<Y:16>#57000-57000\n#OFFSET<Y:16>#57000-57000\n#OFFSET<Y:16>#570000",--属性值
	},
}]]


local _data = [[
exercise_t = {--内功数据表
	[1] = {
		spd = 2,--恢复速度百分比
		res = 2,--伤害减免百分比
		max = 100,--龙吟之力上限
		llz = 200,--消耗修仙值
		ysn = "筑基境(十重)",--需求境界名称
		item = {"内丹●玄级", 10},--消耗材料 + 数量
		name = "渡劫一重",--内功等级名称
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#2%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#100点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#2%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#2%",--内功状态描述
	},
	[2] = {
		spd = 4,
		res = 4,
		max = 200,
		llz = 300,
		ysn = "融合境(十重)",
		item = {"内丹●玄级", 30},
		name = "渡劫二重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#4%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#200点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#4%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#4%",
	},
	[3] = {
		spd = 6,
		res = 6,
		max = 300,
		llz = 500,
		ysn = "金丹境(十重)",
		item = {"内丹●皇级", 30},
		name = "渡劫三重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#6%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#300点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#6%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#6%",
	},
	[4] = {
		spd = 8,
		res = 8,
		max = 400,
		llz = 800,
		ysn = "元婴境(十重)",
		item = {"内丹●皇级", 60},
		name = "渡劫四重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#8%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#400点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#8%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#8%",
	},
	[5] = {
		spd = 10,
		res = 10,
		max = 500,
		llz = 1500,
		ysn = "洞虚境(十重)",
		item = {"内丹●皇级", 90},
		name = "渡劫五重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#10%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#500点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#10%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#10%",
	},
	[6] = {
		spd = 12,
		res = 12,
		max = 600,
		llz = 1800,
		ysn = "大乘境(十重)",
		item = {"内丹●皇级", 120},
		name = "渡劫六重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#12%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#600点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#12%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#12%",
	},
	[7] = {
		spd = 14,
		res = 14,
		max = 700,
		llz = 2100,
		ysn = "渡劫境(十重)",
		item = {"内丹●地级", 60},
		name = "渡劫七重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#14%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#700点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#14%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#14%",
	},
	[8] = {
		spd = 16,
		res = 16,
		max = 800,
		llz = 2500,
		ysn = "散仙(十重)",--境界名称
		item = {"内丹●地级", 90},
		name = "渡劫八重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#16%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#800点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#16%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#16%",
	},
	[9] = {
		spd = 18,
		res = 18,
		max = 900,
		llz = 3000,
		ysn = "太乙真仙(十重)",
		item = {"内丹●地级", 120},
		name = "渡劫九重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#18%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#900点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#18%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#18%",
	},
	[10] = {
		spd = 20,
		res = 20,
		max = 1000,
		llz = 4000,
		ysn = "太乙玄仙(十重)",
		item = {"内丹●地级", 150},
		name = "渡劫十重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#20%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#1000点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#20%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#20%",
	},
	[11] = {
		spd = 22,
		res = 22,
		max = 1200,
		llz = 5000,
		ysn = "大罗金仙(十重)",
		item = {"内丹●天级", 99},
		name = "渡劫十一重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#22%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#1200点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#22%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#22%",
	},
	[12] = {
		spd = 25,
		res = 25,
		max = 1500,
		llz = 10000,
		ysn = "混元大罗金仙(十重)",
		item = {"内丹●圣级", 198},
		name = "渡劫十二重",
		desc = "#COLORCOLOR_BROWN#恢复速度：#COLORCOLOR_GREENG##OFFSET<X:45>#25%\n#OFFSET<Y:10>##COLORCOLOR_BROWN#龙吟之力：#COLORCOLOR_GREENG##OFFSET<X:38>#1500点\n#OFFSET<Y:11>##COLORCOLOR_BROWN#物伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#25%\n#OFFSET<Y:11>##COLORCOLOR_BROWN#魔伤减免：#COLORCOLOR_GREENG##OFFSET<X:45>#25%",
	},
}]]

loadstring(data)()

loadstring(_data)()

local second = 30	--内功多少秒恢复一次

local point = 5	--多少分钟兑换1点修为

local times = 300	--多少秒后自动传入地图

local map_t = {"雷劫之地", 67, 67}--传送地图。坐标x，坐标y

local zhuanshu_t = {
	{"《渡劫筑基境》", 34, 70},--1级渡劫传送专属地图+坐标x，坐标y
	{"《渡劫融合境》", 34, 70},
	{"《渡劫金丹境》", 34, 70},
	{"《渡劫元婴境》", 34, 70},
	{"《渡劫洞虚境》", 34, 70},
	{"《渡劫大乘境》", 34, 70},
	{"《飞升渡劫境》", 34, 70},
	{"《散仙青云境》", 34, 70},
	{"《太乙真仙境》", 34, 70},
	{"《太乙玄仙境》", 34, 70},
	{"《大罗金仙境》", 34, 70},
	{"《混元金仙境》", 34, 70},
}

lualib:SetFormAllowFunc({"show", "award", "exchange", "update", "map"});


function map(player)
	local mes = " NpcKeyName = \"《渡劫专属地图》\""--标题
	lualib:ShowFormWithContent(player, "脚本表单", mes)
	
	local strs = [[
		local handle = GetWindow(nil, "Cultivation")
		if handle ~= 0 then WndClose(handle) return end
	]]
	lualib:ShowFormWithContent(player, "脚本表单", strs)

	local lv = lualib:GetInt(player, "exerciselv")
	local msg = "\n\n"
	for k, v in ipairs(zhuanshu_t) do
		if k % 2 == 0 then
			if lv >= k then
				msg = msg.."#POS<X:235>##OFFSET<Y:2>##IMAGE1902700014##OFFSET<Y:-2>#<@jinru#"..k.." *01*"..v[1].."[专属]> #COLORCOLOR_GREENG#←已激活\n\n"
			else
				msg = msg.."#POS<X:235>##OFFSET<Y:2>##IMAGE1902700014##OFFSET<Y:-2>##COLORCOLOR_RED#"..v[1].."[专属]#COLORCOLOR_DARK# ←未激活\n\n"
			end
		else
			if lv >= k then
				msg = msg.."#POS<X:22>##IMAGE1902700014##OFFSET<Y:-2>#<@jinru#"..k.." *01*"..v[1].."[专属]> #COLORCOLOR_GREENG#←已激活"
			else
				msg = msg.."#POS<X:22>##IMAGE1902700014##OFFSET<Y:-2>##COLORCOLOR_RED#"..v[1].."[专属]#COLORCOLOR_DARK# ←未激活"
			end
		end
	end
	msg = msg .. "\n\n#POS<X:22>##COLORCOLOR_PURPLE#提示：晋升对应渡劫可进入对应的专属地图，渡劫越高进的地图越多。#COLOREND#\n"
	msg = msg .. "#OFFSET<Y:5>##POS<X:22>##COLORCOLOR_PURPLE#说明：本游戏所有BOSS均可爆终极，只要你努力一切皆有可能。#COLOREND#\n"
	lualib:NPCTalkDetail(player, msg, 445, 292)
	lualib:ShowFormWithContent(player, "脚本表单", [[NpcTalk.SetNpcTalkHalfImgPos()]])
	return ""
end

function jinru(npc, player, idx)
	local idx = tonumber(idx)
	local lv = lualib:GetInt(player, "exerciselv")
	if lv < idx then
		lualib:MsgBox(player, "#COLORCOLOR_GREENG#您当前的爵位称号不具备进入该地图的权限，请先去进阶称号。#COLOREND#")
		return ""
	end
	lualib:Player_MapMoveXY(player, zhuanshu_t[idx][1], zhuanshu_t[idx][2], zhuanshu_t[idx][3], 3)
	local msg = "勇士["..lualib:Name(player).."]前往称号福利地图〖"..zhuanshu_t[idx][1].."·专属〗，大量BOSS等待着他（她）！"
	lualib:SysMsg_SendBroadcastMsg(msg, "最新情报")
	return ""
end


function success(player)
	local lv = lualib:Meritor(player)
	local xiuxian = lualib:GetInt(player, "xiuxian")
	local is = lualib:GetInt(player, "exerciselv") + 1
	lualib:SetInt(player, "exerciselv", is)
	lualib:SetInt(player, "exercisexp", exercise_t[is].max)
	lualib:SysMsg_SendBroadcastMsg("恭喜玩家【"..lualib:Name(player).."】成功突破“"..exercise_t[is].name.."”！", "系统")
	local script = [[
		if if Cultivation ~= nil then
			Cultivation.SetContent(]]..lv..[[, ]]..is..[[, ]]..xiuxian..[[);
		end
	]]
	lualib:ShowFormWithContent(player, "脚本表单", script)
	addtimer(player)
end


function entermap(player)
	lualib:SetInt(player, "dujieing", 1)
	lualib:Player_MapMoveXY(player, map_t[1], map_t[2], map_t[3], 3)
	lualib:SysWarnMsg(player, "渡劫开始：死亡、退出游戏、都会被认定渡劫失败，渡劫失败会需从新申请渡劫。")
	lualib:SysWarnMsg(player, "渡劫开始：死亡、退出游戏、都会被认定渡劫失败，渡劫失败会需从新申请渡劫。")
	lualib:SysWarnMsg(player, "渡劫开始：死亡、退出游戏、都会被认定渡劫失败，渡劫失败会需从新申请渡劫。")
end


function show(player, npc)
	local lv = lualib:Meritor(player)
	local is = lualib:GetInt(player, "exerciselv")
	local xiuxian = lualib:GetInt(player, "xiuxian")
	local s = lv.."#"..is.."#"..xiuxian
	local str = " cultivation_time = "..lualib:GetInt(player, "online_time")
	str = str.. " cultivation_state = "..string.format("%q", s)
	str = str.. " cultivation_npc = "..string.format("%q", npc)
	lualib:ShowFormWithContent(player, "脚本表单", str)
	lualib:ShowFormWithContent(player, "脚本表单", data)
	lualib:ShowFormWithContent(player, "脚本表单", _data)
	lualib:ShowFormWithContent(player, "form文件表单", "Cultivation")
	return ""
end

function check(player)
	local lv = lualib:Meritor(player) + 1
	
	local str = " cultivation_time = "..lualib:GetInt(player, "online_time")
	lualib:ShowFormWithContent(player, "脚本表单", str)
	
	if cultivation_t[lv] == nil then return end
	
	local xiuxian = lualib:GetInt(player, "xiuxian")
	
	if xiuxian >= cultivation_t[lv].llz then
		lualib:SetInt(player, "xiuxian", xiuxian - cultivation_t[lv].llz)
		lualib:SetMeritor(player, lv)
		lualib:AddBuff(player, cultivation_t[lv].buf, 0)
		showmsg(player, "您的修仙晋升至“"..cultivation_t[lv].ysn.."”！")
		
		lv = lualib:Meritor(player)
		local is = lualib:GetInt(player, "exerciselv")
		xiuxian = lualib:GetInt(player, "xiuxian")
		local script = [[
			if Cultivation ~= nil then
				Cultivation.SetContent(]]..lv..[[, ]]..is..[[, ]]..xiuxian..[[);
			end
		]]
		lualib:ShowFormWithContent(player, "脚本表单", script)
		
		lualib:SetStr(player, "_na_", cultivation_t[lv].ysn)
		lualib:NotifyVar(player, "_na_")
		
		if cultivation_t[lv + 1] ~= nil then 
			if xiuxian > cultivation_t[lv + 1].llz then
				check(player)
			end
		end
	else
		lv = lualib:Meritor(player)
		local is = lualib:GetInt(player, "exerciselv")
		local script = [[
			if Cultivation ~= nil then
				Cultivation.SetContent(]]..lv..[[, ]]..is..[[, ]]..xiuxian..[[);
			end
		]]
		lualib:ShowFormWithContent(player, "脚本表单", script)
	end
end

function award(player)
	local is = lualib:GetInt(player, "exerciselv") + 1
	if exercise_t[is] == nil then
		showmsg(player, "已达最高修炼等级。")
		return ""
	end
	
	local lv = lualib:Meritor(player)
	if lv < is * 10 then
		showmsg(player, "您需要达到"..exercise_t[is].ysn.."。")
		return ""
	end
	
	local xiuxian = lualib:GetInt(player, "xiuxian") - exercise_t[is].llz
	if xiuxian < 0 then
		showmsg(player, "您的修仙值不足，无法突破。")
		return ""
	end
	
	if lualib:GetInt(player, "dujieing") == 1 then
		showmsg(player, "您已经开始渡劫了，耐心等待。")
		return ""
	end
	
	if not lualib:DelItem(player, exercise_t[is].item[1], exercise_t[is].item[2], 2, "元神奖励", player) then
		showmsg(player, "材料不足，无法突破。")
		return ""
	end
	
	local msg = "【".. lualib:Name(player) .."】玩家触发雷劫，五分钟后前往雷劫之地渡劫。"
	
	lualib:SysMsg_SendBroadcastMsg(msg, "系统")
	lualib:SysMsg_SendBroadcastMsg(msg, "系统")
	lualib:SysMsg_SendBroadcastMsg(msg, "系统")
	
	lualib:SetInt(player, "xiuxian", xiuxian)
	
	lualib:SetInt(player, "dujieing", 1)
	
	lualib:AddTimer(player, 15273, times * 1000, 1, "entermap")

	lv = lualib:Meritor(player)
		local is = lualib:GetInt(player, "exerciselv")
		local script = [[
			if Cultivation ~= nil then
				Cultivation.SetContent(]]..lv..[[, ]]..is..[[, ]]..xiuxian..[[);
			end
		]]
		lualib:ShowFormWithContent(player, "脚本表单", script)
		
	return ""
end

function exchange(player)
	lualib:SysMsg_SendInputDlg(player, 888, "输入要兑换的修仙值", 30, 12, "exchangex", "")
	return ""
end

function exchangex(dlg, player, silver)
	silver = tonumber(silver)
	silver = math.floor(silver)
	if silver == nil then
		showmsg(player, "请输入纯数字！")
	return end
	
	if silver <= 0 then
		showmsg(player, "请输入大于0的正整数！")
	return end
	
	local online_time = lualib:GetInt(player, "online_time")
	if online_time < silver * point then
		showmsg(player, "您的在线时间不足。")
	return end
	
	if not lualib:SetInt(player, "online_time", online_time - silver * point) then
		showmsg(player, "扣除在线时间失败。")
	return end
	
	local xiuxian = lualib:GetInt(player, "xiuxian") + silver
	lualib:SetInt(player, "xiuxian", xiuxian)
	lualib:SysWarnMsg(player, "恭喜您成功兑换"..silver.."点修仙值！")

	check(player)
end


function addtimer(player)
	
	local lv = lualib:GetInt(player, "exerciselv")
	if lv ~= 0 and lualib:HasTimer(player, 186) == false then
		lualib:AddTimer(player, 186, 2000, -1, "addexercise")
	end
	if not lualib:HasTimer(player, 18808) then
		lualib:AddTimer(player, 18808, 60000, -1, "addonlinetime")
	end
	local xxlv = lualib:Meritor(player)
	if xxlv ~= 0 then
		lualib:SetStr(player, "_na_", cultivation_t[xxlv].ysn)
		lualib:NotifyVar(player, "_na_")
	end
	update(player)
end


function addonlinetime(player, id)
	if lualib:IsOffline(player) == false then
		lualib:SysTipsMsg(player, "在线时间+1分钟")
		lualib:SetInt(player, "online_time", lualib:GetInt(player, "online_time") + 1)
	end
end


local color = {--七彩变色
	[0] = "#ED1C24",
	[1] = "#FF7F27",
	[2] = "#FFF200",
	[3] = "#22B14C",
	[4] = "#00A2E8",
	[5] = "#3F48CC",
	[6] = "#9000FF",
}

function addexercise(player, id)
	local no = lualib:GetTempInt(player, "color")
	lualib:SetTempInt(player, "color", no + 1)
	lualib:SetStr(player, "_tc_", color[no % 7])
	lualib:NotifyVar(player, "_tc_")
	------------------------------------------------
	local continue = lualib:GetTempInt(player, "continue") + 2
	if continue % second == 0 then
		local lv = lualib:GetInt(player, "exerciselv")
		local value = lualib:GetInt(player, "exercisexp")
		if value >= exercise_t[lv].max then return end
		local respct = lualib:GetInt(player, "respct")
		local addval = math.ceil((exercise_t[lv].res + respct) * exercise_t[lv].max / 100)
		lualib:SetInt(player, "exercisexp", math.min(value + addval, exercise_t[lv].max))
		lualib:SysTipsMsg(player, "龙吟之力+"..addval)
		update(player)
	end
	lualib:SetTempInt(player, "continue", continue)
end

function update(player)
	local respct = lualib:GetInt(player, "respct")
	local lv = lualib:GetInt(player, "exerciselv")
	local value = lualib:GetInt(player, "exercisexp")
	local max = exercise_t[lv] and exercise_t[lv].max or 0
	local spd = exercise_t[lv] and exercise_t[lv].res + respct or 0
	local jmpct = exercise_t[lv] and exercise_t[lv].spd or 0
	local script = [[
		if Rage ~= nil then
			Rage.Exercise(]]..lv..[[, ]]..value..[[, ]]..max..[[, ]]..spd..[[, ]]..jmpct..[[);
		end
	]]
	lualib:ShowFormWithContent(player, "脚本表单", script)
	return ""
end

function showmsg(player, msg)
	lualib:ShowFormWithContent(player, "脚本表单", "msgbox = "..string.format("%q", msg))
	lualib:ShowFormWithContent(player, "form文件表单", "MsgBox")
end