--
--
--
--
--
--
--

local tbl = {

				{
					{"轻型战甲"	,   "轻型战袍"		},	
					{"重型铠甲男"	,   "重型铠甲女"	},
					{"战神铠甲男"	,   "战神铠甲女"	},
					{"天魔神甲"	,   "圣战宝甲"		},    
					{"战将战甲"	,   "战将战袍"		},    
					{"武魂战甲"	,   "武魂战袍"		},    
					{"天武战甲"	,   "天武战袍"		},    
					{"神武战甲"	,   "神武战袍"		},    
					{"圣武战甲"	,   "圣武战袍"		},    
					{"威武战甲"	,   "威武战袍"		},    
					{"洪武行天战甲"	,   "洪武行天战袍"	},
					{"雄武震天战甲"	,   "雄武震天战袍"	},
					{"尊武凌天战甲"	,   "尊武凌天战袍"	},
					{"神威亢天战甲"	,   "神威亢天战袍"	},
					{"至尊傲天战甲"	,   "至尊傲天战袍"	},
				},
				{
					{"魔力轻铠男"	,   "魔力轻铠女"	},
					{"魔法长袍男"	,   "魔法长袍女"	},
					{"恶魔长袍"	,   "恶魔长衣"		},
					{"法神披风"	,   "法神羽衣"		},
					{"法灵法袍"	,   "法灵羽衣"		},
					{"魔魂法袍"	,   "魔魂羽衣"		},
					{"天魔法袍"	,   "天魔羽衣"		},
					{"神魔法袍"	,   "神魔羽衣"		},
					{"圣魔法袍"	,   "圣魔羽衣"		},
					{"幻神法袍"	,   "幻神羽衣"		},
					{"天地玄极法袍"	,   "天地玄极羽衣"	},
					{"天异玄奥法袍"	,   "天异玄奥羽衣"	},
					{"天魁玄灵法袍"	,   "天魁玄灵羽衣"	},
					{"天暴玄宗法袍"	,   "天暴玄宗羽衣"	},
					{"天狂玄傲法袍"	,   "天狂玄傲羽衣"	},
				},
				{
					{"轻型道袍"	,   "轻型道衣"		},
					{"幽灵道袍"	,   "幽灵道衣"		},
					{"灵巧道袍"	,   "灵巧道衣"		},
					{"天尊道袍"	,   "天尊道衣"		},
					{"散人道袍"	,   "散人道衣"		},
					{"玄魂道袍"	,   "玄魂道衣"		},
					{"天灵道袍"	,   "天灵道衣"		},
					{"神灵道袍"	,   "神灵道衣"		},
					{"圣灵道袍"	,   "圣灵道衣"		},
					{"无量道袍"	,   "无量道衣"		},
					{"玄天妙法道袍"	,   "玄天妙法道衣"	},
					{"混天广法道袍"	,   "混天广法道衣"	},
					{"鸿天明法道袍"	,   "鸿法明尊道衣"	},
					{"昊天玄尊道袍"	,   "昊天玄尊道衣"	},
					{"傲天元法道袍"	,   "傲天元法道衣"	},
				}
			}

function main( sPlayerID , sItemID )
lualib:SetVipLevel( sPlayerID , lualib:GetVipLevel( sPlayerID ) + 1 )
--[[
	local iGender = lualib:Gender( sPlayerID )
	--1男2女
	local iJob = lualib:Job( sPlayerID )
	--123战法道
	local tbl_equip = tbl[iJob]
	for i=1,#tbl_equip do
		local sEquipKey = tbl_equip[i][iGender]
		lualib:SysMsg_SendBroadcastMsg("sEquipKey=="..sEquipKey , "血禅师")
		lualib:AddItem( sPlayerID , sEquipKey , 1 , false , "加装备测试" , sPlayerID )
	end
]]--
	return true
end

function on_create( sItemID )
	
end

function on_delitem( sPlayerID , timerID )

end