local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)
require("system/logic_def_lua")

function main(player, item)
    local key_table = {"天魔宝匣1", "天魔宝匣2", "天魔宝匣3", "天魔宝匣4", "天魔宝匣5", "天魔宝匣6", "天魔宝匣7"}
    local key = lualib:KeyName(item)
    local num = 1
    for j = 1, table.getn(key_table) do
        if key_table[j] == key then
            num = j
            break
        end
    end
    local level = {30, 35, 40, 45, 50, 55, 60}
    --武器，衣服，套装，散件，技能，杂货
    local item_all = 
    {
        --30级
        {   {"鬼噬", "天玄剑", "魔灵法杖", "鬼噬", "天玄剑", "魔灵法杖", "鬼噬", "天玄剑", "魔灵法杖", "审判", "忘机", "囚龙", }, 
            {"黄金铠甲(男)", "黄金铠甲(女)", "魔力法袍(男)", "魔力法袍(女)", "降魔道衣(男)", "降魔道衣(女)", }, 
            {"御战护腕", "御战戒指", "御战头盔", "御魔护腕", "御魔戒指", "御魔头盔", "御道护腕", "御道戒指", "御道头盔", }, 
            {"鬼牙项链", "龙形戒指", "红玛瑙戒指", "白金戒指", "精钢手镯", "魔王手镯", }, 
            {"月弧弯刀", "死亡射线", "烈焰火海", "锁妖咒", "天罡护体咒", }, 
            {"灵元珠", "灵元珠", "神羽", "钱袋(1万)", "钱袋(2万)", "钱袋(5万)", "钱袋(5万)", }, 
        },  
        --35级
        {   {"审判", "忘机", "囚龙", }, 
            {"黄金铠甲(男)", "黄金铠甲(女)", "魔力法袍(男)", "魔力法袍(女)", "降魔道衣(男)", "降魔道衣(女)", "斗士铠甲(男)", "斗士铠甲(女)", "灵魂法衣(男)", "灵魂法衣(女)", "护体道袍(男)", "护体道袍(女)", }, 
            {"御战护腕", "御战戒指", "御战头盔", "御魔护腕", "御魔戒指", "御魔头盔", "御道护腕", "御道戒指", "御道头盔", "铁战护腕", "铁战戒指", "铁战靴子", "聚魂护腕", "聚魂戒指", "聚魂靴子", "玄光护腕", "玄光戒指", "玄光靴子", }, 
            {"黄金手镯", "勇士头盔", "奥普手镯", "境魂护腕", "武圣之戒", "奥普戒指", "奥普项链", "青云戒指", "荧光项链", }, 
            {"蛮力冲锋", "雷霆极光", "流光护盾", "回春咒", "月弧弯刀", "死亡射线", "烈焰火海", "锁妖咒", "天罡护体咒", }, 
            {"灵元珠", "灵元珠", "神羽", "钱袋(1万)", "钱袋(2万)", "钱袋(5万)", "钱袋(5万)", }, 
        }, 
        --40级
        {   {"审判", "忘机", "囚龙", "审判", "忘机", "囚龙", "审判", "忘机", "囚龙", "十杀", "龙渊", "天瀑", }, 
            {"斗士铠甲(男)", "斗士铠甲(女)", "灵魂法衣(男)", "灵魂法衣(女)", "护体道袍(男)", "护体道袍(女)", }, 
            {"铁战护腕", "铁战戒指", "铁战靴子", "聚魂护腕", "聚魂戒指", "聚魂靴子", "玄光护腕", "玄光戒指", "玄光靴子", }, 
            {"骷髅手套", "绿玉项链", "破坏戒指", "摄魂戒指", "龙牙手镯", "唤魔铃铛", "混元戒指", "幻邪手镯", "灵光石项链", "黄金头盔", "阎魔头盔", "魔化面具", }, 
            {"蛮力冲锋", "雷霆极光", "流光护盾", "回春咒", }, 
            {"灵元珠", "封印鉴定符", "神羽", "钱袋(1万)", "钱袋(2万)", "钱袋(5万)", "钱袋(10万)", }, 
        }, 
        --45级
        {   {"十杀", "龙渊", "天瀑", }, 
            {"斗士铠甲(男)", "斗士铠甲(女)", "灵魂法衣(男)", "灵魂法衣(女)", "护体道袍(男)", "护体道袍(女)", "赤峰战甲(男)", "赤峰战甲(女)", "阎罗长袍(男)", "阎罗长袍(女)", "光明道袍(男)", "光明道袍(女)", }, 
            {"铁战护腕", "铁战戒指", "铁战靴子", "聚魂护腕", "聚魂戒指", "聚魂靴子", "玄光护腕", "玄光戒指", "玄光靴子", "圣武战靴", "圣武戒指", "圣武护腕", "圣武头盔", "苍冥魔靴", "苍冥戒指", "苍冥护腕", "苍冥头盔", "飞尘道靴", "飞尘戒指", "飞尘护腕", "飞尘头盔", }, 
            {"骷髅手套", "绿玉项链", "破坏戒指", "摄魂戒指", "龙牙手镯", "唤魔铃铛", "混元戒指", "幻邪手镯", "灵光石项链", "黄金头盔", "阎魔头盔", "魔化面具", "王者之链", "麒麟战盔", "魔炫护腕", "君王战戒", "残月之坠", "龙牙面具", "紫炎护腕", "星冥魔戒", "天极项链", "无魂头盔", "天翼手镯", "上清玄指", "逐波天靴", }, 
            {"烈焰斩", "天庭之唤", "杀生术", "冰爆漩涡", "蛮力冲锋", "雷霆极光", "流光护盾", "回春咒", }, 
            {"灵元珠", "封印鉴定符", "神羽", "钱袋(1万)", "钱袋(2万)", "钱袋(5万)", "钱袋(10万)", }, 
        }, 
        --50级
        {   {"十杀", "龙渊", "天瀑", "十杀", "龙渊", "天瀑", "十杀", "龙渊", "天瀑", "断空", "碎空", "噬空", }, 
            {"赤峰战甲(男)", "赤峰战甲(女)", "阎罗长袍(男)", "阎罗长袍(女)", "光明道袍(男)", "光明道袍(女)", }, 
            {"圣武战靴", "圣武戒指", "圣武护腕", "圣武头盔", "苍冥魔靴", "苍冥戒指", "苍冥护腕", "苍冥头盔", "飞尘道靴", "飞尘戒指", "飞尘护腕", "飞尘头盔", }, 
            {"王者之链", "麒麟战盔", "魔炫护腕", "君王战戒", "残月之坠", "龙牙面具", "紫炎护腕", "星冥魔戒", "天极项链", "无魂头盔", "天翼手镯", "上清玄指", "逐波天靴", }, 
            {"烈焰斩", "天庭之唤", "杀生术", "冰爆漩涡", }, 
            {"封印鉴定符", "封印鉴定符", "神羽", "钱袋(2万)", "钱袋(5万)", "钱袋(5万)", "钱袋(10万)", }, 
        }, 
        --55级
        {   {"断空", "碎空", "噬空", }, 
            {"赤峰战甲(男)", "赤峰战甲(女)", "阎罗长袍(男)", "阎罗长袍(女)", "光明道袍(男)", "光明道袍(女)", "百裂战甲(男)", "百裂战甲(女)", "圣灵法衣(男)", "圣灵法衣(女)", "太玄道袍(男)", "太玄道袍(女)", }, 
            {"圣武战靴", "圣武戒指", "圣武护腕", "圣武头盔", "苍冥魔靴", "苍冥戒指", "苍冥护腕", "苍冥头盔", "飞尘道靴", "飞尘戒指", "飞尘护腕", "飞尘头盔", "末日头盔", "末日项链", "末日戒指", "末日护腕", "末日战靴", "血夜魔盔", "血夜项链", "血夜魔指", "血夜护腕", "血夜魔靴", "天劫道盔", "天劫项链", "天劫道指", "天劫护腕", }, 
            {"王者之链", "麒麟战盔", "魔炫护腕", "君王战戒", "残月之坠", "龙牙面具", "紫炎护腕", "星冥魔戒", "天极项链", "无魂头盔", "天翼手镯", "上清玄指", "逐波天靴", "梵天之链", "魅影战盔", "麒煌护腕", "创世战戒", "天缺项链", "天邪头盔", "七炫护腕", "天璃法戒", "圣魂项链", "龙元道盔", "上玄手镯", "天元道指", "绝影天履", }, 
            {"烈焰斩", "天庭之唤", "杀生术", "冰爆漩涡", "龙咆哮残页", "裂地斩残页", "引经魔轰残页", "陨星灭世残页", "太极玄清术残页", "通幽之术残页", }, 
            {"封印鉴定符", "封印鉴定符", "神羽", "钱袋(2万)", "钱袋(5万)", "钱袋(5万)", "钱袋(10万)", }, 
        }, 
        --60级
        {   {"断空", "碎空", "噬空", "断空", "碎空", "噬空", "断空", "碎空", "噬空", "帝释", "残虹", "无常", }, 
            {"百裂战甲(男)", "百裂战甲(女)", "圣灵法衣(男)", "圣灵法衣(女)", "太玄道袍(男)", "太玄道袍(女)", }, 
            {"末日头盔", "末日项链", "末日戒指", "末日护腕", "末日战靴", "血夜魔盔", "血夜项链", "血夜魔指", "血夜护腕", "血夜魔靴", "天劫道盔", "天劫项链", "天劫道指", "天劫护腕", }, 
            {"梵天之链", "魅影战盔", "麒煌护腕", "创世战戒", "天缺项链", "天邪头盔", "七炫护腕", "天璃法戒", "圣魂项链", "龙元道盔", "上玄手镯", "天元道指", "绝影天履", }, 
            {"龙咆哮残页", "裂地斩残页", "引经魔轰残页", "陨星灭世残页", "太极玄清术残页", "通幽之术残页", }, 
            {"封印鉴定符", "封印鉴定符", "神羽", "钱袋(2万)", "钱袋(5万)", "钱袋(10万)", "钱袋(10万)", }, 
        }, 
    }
    local rate_all =    {
    --武器，衣服，套装，散件，技能，杂货
    {1000, 1000, 1500, 1500, 1500, 3500}, --30
    {1000, 1000, 1500, 1500, 1500, 3500}, --35
    {1000, 1000, 1500, 1500, 1500, 3500}, --40
    {1000, 1000, 1500, 1500, 1500, 3500}, --45
    {500, 500, 1000, 2000, 1000, 5000}, --50
    {500, 500, 1000, 2000, 1000, 5000}, --55
    {500, 500, 1000, 2000, 1000, 5000}, --60
                        }
    local items = item_all[num]
    local rates = rate_all[num]

    local rnd = 0;
    local item_name = ""
	local max, qujian = 0, 0
	for k = 1, table.getn(rates) do
		max = max + rates[k]
	end
	rnd = lualib:GenRandom(1, max)
	for k = 1, table.getn(rates) do
		qujian = qujian + rates[k]
		if rnd <= qujian then
			for i = 1, table.getn(items) do
				if i == k then
					local ce = lualib:GenRandom(1, #items[i])
					item_name = items[i][ce];
					if not lualib:Player_GiveItemUnbind(player, item_name, 1, "给物品：开启天魔宝匣", "天魔宝匣") then
						lualib:Error("天魔宝匣给物品失败！")
						return false
					end
					lualib:SysMsg_SendCenterMsg(1, lualib:Player_GetStrProp(player, lua_role_user_name).."开启镇魔殿中的天魔宝匣，获得了"..item_name.."！", "系统公告")
					return true
				end
			end
		end
	end


end


function on_create(item)
	lualib:AddTimerEx(item, 1, 500, 1, "tip", "")
	
end

function tip(item)
	local item_name = lualib:Name(item)
	local item_map_guid = lualib:MapGuid(item)
	local item_map_name = lualib:Name(item_map_guid)
	local item_map_x = lualib:X(item)
	local item_map_y = lualib:Y(item)
	local item_role = lualib:ItemRole(item)
	local player_name = lualib:Name(item_role)
	
	if item_map_x < 20000 then
		if player_name == "" then
			local s = "【"..item_name.."】掉落在"..item_map_name.."["..item_map_x..":"..item_map_y.."]！"
			lualib:SysMsg_SendCenterMsg(1, s, "")
			 lualib:SysMsg_SendBroadcastColor(s, "", 1, 12)
		else
			--local s = "【"..item_name.."】被→→→".."["..player_name.."]一个人品爆发打了出来，掉落在"..item_map_name.."["..item_map_x..":"..item_map_y.."]！"
            local s = "【"..item_name.."】掉落在"..item_map_name.."的["..item_map_x..":"..item_map_y.."]！！！"
			local s1 = "#COLORCOLOR_BROWN#["..item_name.."] #COLORCOLOR_YELLOW#掉落在#COLORCOLOR_BROWN#["..item_map_name.."]#COLORCOLOR_YELLOW#的["..item_map_x..":"..item_map_y.."]！！！"
			lualib:SysMsg_SendCenterMsg(1, s, "")
			 lualib:SysMsg_SendBroadcastColor(s1, "", 1, 12)
		end
	else	
		return
	end
end
