 
local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)
require("system/serializer")

local itemsAll = {
			{
				{"圣武戒指","圣武手镯","圣武项链","圣武头盔","圣武腰带","圣武靴子"},      --转一到转八
				{"神魔头盔","神魔戒指","神魔项链","神魔靴子","神魔腰带","神魔项链"},
				{"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				{"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				{"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
				{"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				{"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				{"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
			},
			{
				{"圣魔戒指","圣魔手镯","圣魔项链","圣魔头盔","圣魔腰带","圣魔靴子"},      --转一到转八
				{"神魔头盔","神魔戒指","神魔项链","神魔靴子","神魔腰带","神魔项链"},
				{"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				{"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				{"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
				{"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				{"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				{"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
			},
			{
				{"圣灵戒指","圣灵手镯","圣灵项链","圣灵头盔","圣灵腰带","圣灵靴子"},       --转一到转八
				{"神魔头盔","神魔戒指","神魔项链","神魔靴子","神魔腰带","神魔项链"},
				{"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				{"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				{"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
				{"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				{"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				{"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
			},
			
				}
function main(player, item)
	local job = lualib:Job(player)
	local item_tab = {"",{}}
	item_tab[1] = lualib:Name(item)
	local items = itemsAll[job]
	for i=1,#items do 
		if string.find(item_tab[1],i) then 
			item_tab[2]=items[i]
		end
	end
	lualib:ShowFormWithContent(player,"form文件表单","EquipOption#"..serialize(item_tab))
    return false                               
end


