
local award_tb = {
					[20] = {
									[1] = {
											[1] = {"凌霜剑","轻型战甲","金手镯","灯笼项链","青铜头盔战","金戒指"},
											[2] = {"凌霜剑","轻型战袍","金手镯","灯笼项链","青铜头盔战","金戒指"}
											},
									[2] = {
											[1] = {"海魂","魔力轻铠男","黑檀手镯","生命项链","青铜头盔法","六角戒指"},
											[2]	= {"海魂","魔力轻铠女","黑檀手镯","生命项链","青铜头盔法","六角戒指"}
											},
									[3] = {
											[1] = {"半月","轻型道袍","道士手镯","白金项链","青铜头盔道","珍珠戒指"},
											[2] = {"半月","轻型道衣","道士手镯","白金项链","青铜头盔道","珍珠戒指"}
											}
									},
					[35] = {
									[1] = {
											[1] = {"井中月","重型铠甲男","死神手套","魔鬼项链","骷髅头盔战","降妖除魔戒指"},
											[2] = {"井中月","重型铠甲女","死神手套","魔鬼项链","骷髅头盔战","降妖除魔戒指"}
											},
									[2] = {
											[1] = {"魔杖","魔法长袍男","思贝儿手镯","恶魔铃铛小","黑铁头盔法","蛇眼戒指"},
											[2]	= {"魔杖","魔法长袍女","思贝儿手镯","恶魔铃铛小","黑铁头盔法","蛇眼戒指"}
											},
									[3] = {
											[1] = {"银蛇","幽灵道袍","心灵手镯","黄色水晶项链","道士头盔","道德戒指"},
											[2] = {"银蛇","幽灵道衣","心灵手镯","黄色水晶项链","道士头盔","道德戒指"}
											}
									},
					[45] = {
									[1] = {
											[1] = {"裁决","战神铠甲男","坚固手套","蓝翡翠项链","黑铁头盔","力量戒指"},
											[2] = {"裁决","战神铠甲女","坚固手套","蓝翡翠项链","黑铁头盔","力量戒指"}
											},
									[2] = {
											[1] = {"血饮","恶魔长袍男","龙之手镯","恶魔铃铛大","魔法头盔","紫碧螺"},
											[2]	= {"血饮","恶魔长袍女","龙之手镯","恶魔铃铛大","魔法头盔","紫碧螺"}
											},
									[3] = {
											[1] = {"龙纹","灵巧道袍","三眼手镯","凤凰明珠","骷髅头盔道","泰坦戒指"},
											[2] = {"龙纹","灵巧道衣","三眼手镯","凤凰明珠","骷髅头盔道","泰坦戒指"}
											}
									},
					[60] = {"天使之翼"},
					}
					
