local award_table = 
	{--[1]物品keyname，		[2]权重，[3]活动给的总数量，[4]单次给的物品数量，[5]物品类型1是道具，2是变量，3是元宝，4绑定元宝，5绑定金币，6经验
		{"元宝50",          200, 		999999, 			50, 			    	3},
		{"绑定元宝200",		200, 		9999999,			200,					4},
		{"元宝100",       	100, 		9999999, 			100, 					3},
		{"绑定元宝500", 	200, 		9999999, 			500,					4},
		{"绑定金币1万",		6000, 		9999999, 			10000, 					5},
		{"boss_points", 	1500,		999999, 			2000, 					2},--BOSS积分
		{"ach_score", 		1500, 		999999, 			2000, 					2},--功勋
		{"Ach_jifen", 		1500, 		999999, 			2000, 					2},--成就
		{"经验",			 6000, 		999999, 			60000, 					6},
	} 
	
for k, v in ipairs(award_table) do 
	print(v[1])	
end