tb_vip_map={
			
			["第一个"] = {"VIP1挂机", 	46, 	59,	 1},	--VIP等级1级
			["第二个"] = {"VIP2挂机", 	46, 	59,	 2},	--VIP等级2级
			{"VIP3挂机", 	46, 	59,  3},	--VIP等级3级
			{"VIP4挂机", 	46, 	59,	 4},	--VIP等级4级
			{"VIP5挂机", 	46, 	59,	 5},	--VIP等级5级
			{"VIP6挂机", 	46, 	59,	 6},	--VIP等级6级
			{"VIP7挂机", 	46, 	59,	 7},	--VIP等级7级
			{"VIP8挂机", 	46, 	59,	 8},	--VIP等级8级
			{"VIP9挂机", 	46, 	59,	 9}, 	--VIP等级9级
			{"VIP10挂机", 	46, 	59,  10}, 	--VIP等级10级
			
}
--[[
for k,v in pairs(tb_vip_map) do 
	print(k,v)
end

--]]

for k,v in pairs(tb_vip_map) do 
	print(k,v[1])
end


local award_tb = {
					[20] = {
									[1] = {
											[1] = {"凌霜剑","轻型战甲","金手镯","灯笼项链","青铜头盔战","金戒指"},
											[2] = {"凌霜剑","轻型战袍","金手镯","灯笼项链","青铜头盔战","金戒指"}
											},
									[2] = {
											[1] = {"海魂","魔力轻铠男","黑檀手镯","生命项链","青铜头盔法","六角戒指"},
											[2]	= {"海魂","魔力轻铠女","黑檀手镯","生命项链","青铜头盔法","六角戒指"}
											},
									[3] = {
											[1] = {"半月","轻型道袍","道士手镯","白金项链","青铜头盔道","珍珠戒指"},
											[2] = {"半月","轻型道衣","道士手镯","白金项链","青铜头盔道","珍珠戒指"}
											}
									},
					[35] = {
									[1] = {
											[1] = {"井中月","重型铠甲男","死神手套","魔鬼项链","骷髅头盔战","降妖除魔戒指"},
											[2] = {"井中月","重型铠甲女","死神手套","魔鬼项链","骷髅头盔战","降妖除魔戒指"}
											},
									[2] = {
											[1] = {"魔杖","魔法长袍男","思贝儿手镯","恶魔铃铛小","黑铁头盔法","蛇眼戒指"},
											[2]	= {"魔杖","魔法长袍女","思贝儿手镯","恶魔铃铛小","黑铁头盔法","蛇眼戒指"}
											},
									[3] = {
											[1] = {"银蛇","幽灵道袍","心灵手镯","黄色水晶项链","道士头盔","道德戒指"},
											[2] = {"银蛇","幽灵道衣","心灵手镯","黄色水晶项链","道士头盔","道德戒指"}
											}
									},
					[45] = {
									[1] = {
											[1] = {"裁决","战神铠甲男","坚固手套","蓝翡翠项链","黑铁头盔","力量戒指"},
											[2] = {"裁决","战神铠甲女","坚固手套","蓝翡翠项链","黑铁头盔","力量戒指"}
											},
									[2] = {
											[1] = {"血饮","恶魔长袍","龙之手镯","恶魔铃铛大","魔法头盔","紫碧螺"},
											[2]	= {"血饮","恶魔长衣","龙之手镯","恶魔铃铛大","魔法头盔","紫碧螺"}
											},
									[3] = {
											[1] = {"龙纹","灵巧道袍","三眼手镯","凤凰明珠","骷髅头盔道","泰坦戒指"},
											[2] = {"龙纹","灵巧道衣","三眼手镯","凤凰明珠","骷髅头盔道","泰坦戒指"}
											}
									},
					 [60] = {"天使之翼"},
					}
for k in pairs(award_tb) do 
	print(k)  ------------------------------输出表的K
end	