local rein_att_t = {

--3-HP上限，5-MP上限，21-背包负重，23-装备负重，25-腕力，物防上下(6,7),魔防上下(8,9)，物攻上下(10,11)，魔攻上下(12,13)，道术上下(14,15)，16-命中，17-闪避
--属性:3, 5, 21, 23, 25, 10, 11, 12, 13, 14, 15, 6, 7, 8, 9        
--此等级经验、0到此等级经验、   需求等级、金币、转生石、转生后等级、     {增加属性att(依次为战、法、道)}、{增加属性的值(依次为战、法、道)}
{0, 0,                      0, 0, 0, 0,                        {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-0", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },     {"0-0", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }}, 
{0, 0,                     45, 0, 50,    "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-1", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-1", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },     {"0-0", "0-0", "0-1", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }},  
{0, 0,                     46, 0, 60,    "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-2", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-2", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },     {"0-0", "0-0", "0-2", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }}, 
{0, 0,                     47, 0, 70,    "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-3", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-3", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-3", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }}, 
{0, 0,                     48, 0, 80,    "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-4", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-4", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-4", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }}, 
{0, 0,                     49, 0, 90,    "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-5", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-5", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-5", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }}, 
{0, 0,                     50, 0, 100,   "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-6", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-6", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-6", "0-0", "0-0", "0", "0", "0", "0", "0",                                           }, }}, 
{0, 0,                     51, 0, 500,   "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-8", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",             },         {"0-0", "0-8", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-8", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     52, 0, 1000,  "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-10", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-10", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-10", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     53, 0, 2000,  "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-12", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-12", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-12", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     54, 0, 4000,  "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-14", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-14", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-14", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     55, 0, 6000,  "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-16", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-16", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-16", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     56, 0, 8000,  "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-18", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-18", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-18", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     57, 0, 10000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-20", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-20", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-20", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     58, 0, 12000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-22", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-22", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-22", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     59, 0, 14000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-24", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-24", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-24", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     60, 0, 16000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-26", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-26", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-26", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     61, 0, 18000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-28", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-28", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-28", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     62, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-30", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-30", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-30", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     63, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-32", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-32", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-32", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     64, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-34", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-34", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-34", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     65, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-36", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-36", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-36", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     66, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-38", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-38", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-38", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     67, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-40", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-40", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-40", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     68, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-42", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-42", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-42", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     69, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-44", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-44", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-44", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }}, 
{0, 0,                     70, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-46", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },         {"0-0", "0-46", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",            },     {"0-0", "0-0", "0-46", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }},
{0, 0,                     71, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-48", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },          {"0-0", "0-48", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },     {"0-0", "0-0", "0-48", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }},
{0, 0,                     72, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-50", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },          {"0-0", "0-50", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },     {"0-0", "0-0", "0-50", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }},
{0, 0,                     73, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-52", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },          {"0-0", "0-52", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },     {"0-0", "0-0", "0-52", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }},
{0, 0,                     74, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-54", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },          {"0-0", "0-54", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },     {"0-0", "0-0", "0-54", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }},
{0, 0,                     75, 0, 20000, "不变",               {{"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", },  {"物理攻击", "魔法攻击", "道术攻击", "物理防御", "魔法防御", "HP上限", "MP上限", "背包负重", "装备负重", "腕力上限", }},   {{"0-56", "0-0", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },          {"0-0", "0-56", "0-0", "0-0", "0-0", "0", "0", "0", "0", "0",           },     {"0-0", "0-0", "0-56", "0-0", "0-0", "0", "0", "0", "0", "0",                                          }, }},
}


LuaUI["转生表单"].OnInit = function(handle, param, x, y)
	zs_level = tonumber(LuaParam[2])
	--print(""..zs_level.."")
	--WndCalSize(handle)
	WndSetSize(handle, nil, 604, 294)--手动设置窗口大小
	CenterWnd(handle) --将窗口居中
	WndSetFlags(handle, nil, flg_wndBase_autoTop) --设置窗口自动置顶
	WndSetMoveWithLB(handle, nil, true) --设定窗口允许鼠标左键拖动
	WndSetEscClose(handle, nil, true) --设置窗口按下Esc自动关闭
	WndSetCanRevMsg(handle, "GUI_2", false)
	
	--显示转生属性
	if not UI:Lua_GetPlayerSelfProperty32(ROLE_PROP32_JOB) then return end
	local job = LuaRet
	
	
	if zs_level < 31 then
		for i = 1, 10 do
			WndSetCanRevMsg(handle, "tupian_"..i, false)
			EditSetProp(handle, "AttName_a"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..rein_att_t[zs_level + 1][7][job][i])
			EditSetProp(handle, "AttName_b"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..rein_att_t[zs_level + 2][7][job][i])
			
			EditSetProp(handle, "AttValue_a"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..rein_att_t[zs_level +1][8][job][i])
			EditSetProp(handle, "AttValue_b"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..rein_att_t[zs_level + 2][8][job][i])
			
			if i < 6 then
				local minValue = 0
				local maxValue = 0
				
				local str_value_a, str_value_b = string.find(rein_att_t[zs_level + 1][8][job][i], "-")
				local str_up_value_a, str_up_value_b = string.find(rein_att_t[zs_level + 2][8][job][i], "-")
				
				local str_min_v = tonumber(string.sub(rein_att_t[zs_level + 2][8][job][i], 1, str_up_value_a - 1)) - tonumber(string.sub(rein_att_t[zs_level + 1][8][job][i], 1, str_value_a - 1))
				local str_max_v = tonumber(string.sub(rein_att_t[zs_level + 2][8][job][i], str_up_value_a + 1)) - tonumber(string.sub(rein_att_t[zs_level + 1][8][job][i], str_value_a + 1))
				EditSetProp(handle, "Count_"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..str_min_v.."-"..str_max_v)
			else
				local value = tonumber(rein_att_t[zs_level + 2][8][job][i]) - tonumber(rein_att_t[zs_level + 1][8][job][i])
				EditSetProp(handle, "Count_"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..value)
			end
		end
	
	--设置需求显示
	local reqinfo = {"转生需求等级", "所需道具", "转生后等级", "需求金币"}
	for i = 1, #reqinfo do
		EditSetProp(handle, "Req_Info"..i, true, true, false, false, MakeARGB(255, 215, 170, 113), false, " "..reqinfo[i])
	end
	
	
	--[[
	local req_exp = rein_att_t[rein_att_t[zs_level + 2][3] + 1][2] - rein_att_t[rein_att_t[zs_level + 2][3] - rein_att_t[zs_level + 2][6] + 1][2]
	
	if not UI:Lua_GetPlayerSelfProperty32(ROLE_PROP32_LEVEL) then return end
	local self_level = LuaRet
	if not UI:Lua_GetPlayerSelfProperty64(ROLE_PROP64_EXP) then return end
	local self_exp = tonumber(LuaRet) + rein_att_t[self_level + 1][2] - req_exp
	]]
	
	if not UI:Lua_GetPlayerSelfProperty32(ROLE_PROP32_LEVEL) then return end
	local self_level = LuaRet
	if not UI:Lua_GetPlayerSelfProperty64(ROLE_PROP64_EXP) then return end
--[[	local abc = rein_att_t[zs_level + 2][3] - rein_att_t[zs_level + 2][6] - 1
	local self_exp = tonumber(LuaRet) + rein_att_t[abc + 1][2]
	--msg("自身经验："..self_exp)
	
	local levelCount = self_level - rein_att_t[zs_level + 2][3]
	--msg(""..levelCount)
	if levelCount > 0 then
		for i = rein_att_t[zs_level + 2][3] + 1, self_level do
			self_exp = self_exp + rein_att_t[i][1]
		end
	end
	--msg("计算后："..self_exp)
	
	local next_level = 0
	for i = 1, #rein_att_t do
		if self_exp + 300 < rein_att_t[i][2] then
			next_level = i - 1
			break
		end
	end--]]

	if self_level >= rein_att_t[zs_level + 2][3] then
		EditSetProp(handle, "Req_Value4", true, true, false, false, MakeARGB(255, 50, 215, 50), false, ""..rein_att_t[zs_level + 2][4])
		EditSetProp(handle, "Req_Value3", true, true, false, false, MakeARGB(255, 50, 215, 50), false, "  "..rein_att_t[zs_level + 2][6])
		EditSetProp(handle, "Req_Value2", true, true, false, false, MakeARGB(255, 50, 215, 50), false, " 转生石"..rein_att_t[zs_level + 2][5].."个")
		EditSetProp(handle, "Req_Value1", true, true, false, false, MakeARGB(255, 50, 215, 50), false, ""..rein_att_t[zs_level + 2][3])
	else
		EditSetProp(handle, "Req_Value4", true, true, false, false, MakeARGB(255, 215, 170, 113), false, "  --/--")
		EditSetProp(handle, "Req_Value3", true, true, false, false, MakeARGB(255, 215, 170, 113), false, "  --/--")
		EditSetProp(handle, "Req_Value2", true, true, false, false, MakeARGB(255, 215, 170, 113), false, "  --/--")
		EditSetProp(handle, "Req_Value1", true, true, false, false, MakeARGB(255, 255, 15, 15), false, ""..rein_att_t[zs_level + 2][3])
	end
	
	
	--EditSetProp(handle, "Avatar_info", true, true, false, false, MakeARGB(255, 50, 215, 50), false, "转生后可获得形象")	
		
	local big_icon_job = {
							--{{1990420474, 1990420591},{1990420475, 1990420591}},
							--{{1990420546, 1990420592},{1990420547, 1990420592}},
							--{{1990420594, 1990420545},{1990420595, 1990420545}},
						}
	--设置人物全身像
	if not UI:Lua_GetPlayerSelfProperty32(ROLE_PROP32_GENDER) then return end
	local sex = LuaRet
	ImageSetImageID(handle, "Avatar", big_icon_job[job][sex][1])
	ImageSetImageID(handle, "Avatar2", big_icon_job[job][sex][2])
	
	else
		EditSetProp(handle, "Avatar_info", true, true, false, false, MakeARGB(255, 50, 215, 50), false, "你已到达最高的31转")	
	end
		
end

LuaUI["转生表单"]["Close"].OnLButtonUp = function(handle, param, x, y)
	if WndPtInWindow(handle, nil, x, y) then WndClose(handle, "parent") end
end

LuaUI["转生表单"]["Button_ShowForm"].OnLButtonUp = function(handle, param, x, y)
	local script = "UI:Lua_SubmitForm(\"转生表单\" ,\"main\",\""..tostring(zs_level + 1).."\")"
	MessageBox(1, "你确定转生吗？", script)
	
	--if WndPtInWindow(handle, nil, x, y) then WndClose(handle, "parent") end
	--CreateWnd(nil, nil, "转生表单")
	--UI:Lua_SubmitForm("转生表单" ,"main",tostring(zs_level + 1));
end