--[[
自定义变量列表
h_cur_exp:                  坐骑当前exp
变量类型:                   int

h_type:                     坐骑品级
变量类型:                   int

h_level:                    坐骑等级
变量类型:                   int

--]]

--当前exp
function get_horse_cur_exp(player, item)
    local h_cur_exp = lualib:Item_GetCustomVarInt(player, item, "h_cur_exp")
    return h_cur_exp
end

--设置当前exp
function set_horse_cur_exp(player, item, h_cur_exp)
    lualib:Item_SetCustomVarInt(player, item, "h_cur_exp", h_cur_exp)
    lualib:Item_NotifyCustomParam(player, item, "h_cur_exp")
end

--设置exp上限
function get_horse_max_exp(player, item)
    local h_max_exp = lualib:Item_GetCustomVarInt(player, item, "h_max_exp")
    return h_max_exp
end

--设置exp上限
function set_horse_max_exp(player, item, h_max_exp)
    lualib:Item_SetCustomVarInt(player, item, "h_max_exp", h_max_exp)
    lualib:Item_NotifyCustomParam(player, item, "h_max_exp")
end

--坐骑品级
function get_horse_type(player, item)
    local h_type = lualib:Item_GetCustomVarInt(player, item, "h_type")
    return h_type
end

--设置坐骑品级
function set_horse_type(player, item, h_type)
    lualib:Item_SetCustomVarInt(player, item, "h_type", h_type)
    lualib:Item_NotifyCustomParam(player, item, "h_type")
end

--坐骑等级
function get_horse_level(player, item)
    local h_level = lualib:Item_GetCustomVarInt(player, item, "h_level")
    return h_level
end

--设置坐骑等级
function set_horse_level(player, item, h_level)
    lualib:Item_SetCustomVarInt(player, item, "h_level", h_level)
    lualib:Item_NotifyCustomParam(player, item, "h_level")
end

--[[
升级表
品阶索引	    等级	升级经验	    属性2概率	属性3概率	属性4概率	属性5概率
1	            1	    10	            0	        0	        0	        0
1	            2	    10	            0	        0	        0	        0
2	            2	    20	            0	        0	        0	        0
3	            3	    30	            0	        0	        0	        0
4	            4	    40	            0	        0	        0	        0
5	            5	    60	            0	        0	        0	        0
白绿蓝紫金
--]]
horse_level_up_t =
{
    {
        -- 升级经验	    属性2概率	属性3概率	属性4概率	属性5概率
		--白
		{50,0,0,0,0,},		--1级
		{280,0,0,0,0,},		--2级
		{775,0,0,0,0,},		--3级
		{1600,0,0,0,0,},		--4级
		{2795,0,0,0,0,},		--5级
		{4405,0,0,0,0,},		--6级
		{6480,0,0,0,0,},		--7级
		{9050,0,0,0,0,},		--8级
		{12150,0,0,0,0,},		--9级
		{15810,0,0,0,0,},		--10级
		{20065,0,0,0,0,},		--11级
		{24940,0,0,0,0,},		--12级
		{30465,0,0,0,0,},		--13级
		{36665,0,0,0,0,},		--14级
		{43570,0,0,0,0,},		--15级
		{51200,0,0,0,0,},		--16级
		{59575,0,0,0,0,},		--17级
		{68730,0,0,0,0,},		--18级
		{78675,0,0,0,0,},		--19级
		{89440,0,0,0,0,},		--20级
		{101045,0,0,0,0,},		--21级
		{113505,0,0,0,0,},		--22级
		{126845,0,0,0,0,},		--23级
		{141090,0,0,0,0,},		--24级
		{156250,0,0,0,0,},		--25级
		{172345,0,0,0,0,},		--26级
		{189395,0,0,0,0,},		--27级
		{207425,0,0,0,0,},		--28级
		{226445,0,0,0,0,},		--29级
		{246475,0,0,0,0,},		--30级
		{267530,0,0,0,0,},		--31级
		{289630,0,0,0,0,},		--32级
		{312790,0,0,0,0,},		--33级
		{337025,0,0,0,0,},		--34级
		{362355,0,0,0,0,},		--35级
		{388795,0,0,0,0,},		--36级
		{416365,0,0,0,0,},		--37级
		{445070,0,0,0,0,},		--38级
		{474930,0,0,0,0,},		--39级
		{505960,0,0,0,0,},		--40级
		{538180,0,0,0,0,},		--41级
		{571600,0,0,0,0,},		--42级
		{606235,0,0,0,0,},		--43级
		{642095,0,0,0,0,},		--44级
		{679205,0,0,0,0,},		--45级
		{717570,0,0,0,0,},		--46级
		{757205,0,0,0,0,},		--47级
		{798125,0,0,0,0,},		--48级
		{840350,0,0,0,0,},		--49级
		{0,0,0,0,0,},			--50级
    },
    --绿
    {
		{50,1,0,0,0,},			--1级
		{280,1,0,0,0,},			--2级
		{775,1,0,0,0,},			--3级
		{1600,1,0,0,0,},		--4级
		{2795,1,0,0,0,},		--5级
		{4405,1,0,0,0,},		--6级
		{6480,1,0,0,0,},		--7级
		{9050,1,0,0,0,},		--8级
		{12150,1,0,0,0,},		--9级
		{15810,1,0,0,0,},		--10级
		{20065,1,0,0,0,},		--11级
		{24940,1,0,0,0,},		--12级
		{30465,1,0,0,0,},		--13级
		{36665,1,0,0,0,},		--14级
		{43570,1,0,0,0,},		--15级
		{51200,1,0,0,0,},		--16级
		{59575,1,0,0,0,},		--17级
		{68730,1,0,0,0,},		--18级
		{78675,1,0,0,0,},		--19级
		{89440,1,0,0,0,},		--20级
		{101045,1,0,0,0,},		--21级
		{113505,2,0,0,0,},		--22级
		{126845,4,0,0,0,},		--23级
		{141090,6,0,0,0,},		--24级
		{156250,9,0,0,0,},		--25级
		{172345,14,0,0,0,},		--26级
		{189395,21,0,0,0,},		--27级
		{207425,30,0,0,0,},		--28级
		{226445,43,0,0,0,},		--29级
		{246475,60,0,0,0,},		--30级
		{267530,83,0,0,0,},		--31级
		{289630,115,0,0,0,},		--32级
		{312790,156,0,0,0,},		--33级
		{337025,211,0,0,0,},		--34级
		{362355,282,0,0,0,},		--35级
		{388795,374,0,0,0,},		--36级
		{416365,492,0,0,0,},		--37级
		{445070,642,0,0,0,},		--38级
		{474930,833,0,0,0,},		--39级
		{505960,1073,0,0,0,},		--40级
		{538180,1374,0,0,0,},		--41级
		{571600,1749,0,0,0,},		--42级
		{606235,2213,0,0,0,},		--43级
		{642095,2785,0,0,0,},		--44级
		{679205,3486,0,0,0,},		--45级
		{717570,4343,0,0,0,},		--46级
		{757205,5386,0,0,0,},		--47级
		{798125,6648,0,0,0,},		--48级
		{840350,8170,0,0,0,},		--49级
		{0,10000,0,0,0,},			--50级
    },
    --蓝
    {
		{50,1,1,0,0,},		--1级
		{280,1,1,0,0,},		--2级
		{775,1,1,0,0,},		--3级
		{1600,1,1,0,0,},		--4级
		{2795,1,1,0,0,},		--5级
		{4405,1,1,0,0,},		--6级
		{6480,1,1,0,0,},		--7级
		{9050,1,1,0,0,},		--8级
		{12150,1,1,0,0,},		--9级
		{15810,1,1,0,0,},		--10级
		{20065,1,1,0,0,},		--11级
		{24940,1,1,0,0,},		--12级
		{30465,2,1,0,0,},		--13级
		{36665,4,1,0,0,},		--14级
		{43570,9,1,0,0,},		--15级
		{51200,18,1,0,0,},		--16级
		{59575,34,1,0,0,},		--17级
		{68730,60,1,0,0,},		--18级
		{78675,103,1,0,0,},		--19级
		{89440,173,1,0,0,},		--20级
		{101045,282,1,0,0,},		--21级
		{113505,449,2,0,0,},		--22级
		{126845,701,4,0,0,},		--23级
		{141090,1073,6,0,0,},		--24级
		{156250,1615,9,0,0,},		--25级
		{172345,2390,14,0,0,},		--26级
		{189395,3486,21,0,0,},		--27级
		{207425,5016,30,0,0,},		--28级
		{226445,7124,43,0,0,},		--29级
		{246475,10000,60,0,0,},		--30级
		{267530,10000,83,0,0,},		--31级
		{289630,10000,115,0,0,},		--32级
		{312790,10000,156,0,0,},		--33级
		{337025,10000,211,0,0,},		--34级
		{362355,10000,282,0,0,},		--35级
		{388795,10000,374,0,0,},		--36级
		{416365,10000,492,0,0,},		--37级
		{445070,10000,642,0,0,},		--38级
		{474930,10000,833,0,0,},		--39级
		{505960,10000,1073,0,0,},		--40级
		{538180,10000,1374,0,0,},		--41级
		{571600,10000,1749,0,0,},		--42级
		{606235,10000,2213,0,0,},		--43级
		{642095,10000,2785,0,0,},		--44级
		{679205,10000,3486,0,0,},		--45级
		{717570,10000,4343,0,0,},		--46级
		{757205,10000,5386,0,0,},		--47级
		{798125,10000,6648,0,0,},		--48级
		{840350,10000,8170,0,0,},		--49级
		{0,10000,10000,0,0,},			--50级
    },
    --紫
    {
		{50,1,1,1,0,},		--1级
		{280,1,1,1,0,},		--2级
		{775,1,1,1,0,},		--3级
		{1600,1,1,1,0,},		--4级
		{2795,1,1,1,0,},		--5级
		{4405,1,1,1,0,},		--6级
		{6480,1,1,1,0,},		--7级
		{9050,1,1,1,0,},		--8级
		{12150,1,1,1,0,},		--9级
		{15810,1,1,1,0,},		--10级
		{20065,2,1,1,0,},		--11级
		{24940,6,1,1,0,},		--12级
		{30465,14,1,1,0,},		--13级
		{36665,30,1,1,0,},		--14级
		{43570,60,2,1,0,},		--15级
		{51200,115,3,1,0,},		--16级
		{59575,211,7,1,0,},		--17级
		{68730,374,12,1,0,},		--18级
		{78675,642,22,1,0,},		--19级
		{89440,1073,37,1,0,},		--20级
		{101045,1749,60,1,0,},		--21级
		{113505,2785,96,2,0,},		--22级
		{126845,4343,150,4,0,},		--23级
		{141090,6648,229,6,0,},		--24级
		{156250,10000,345,9,0,},		--25级
		{172345,10000,511,14,0,},		--26级
		{189395,10000,746,21,0,},		--27级
		{207425,10000,1073,30,0,},		--28级
		{226445,10000,1525,43,0,},		--29级
		{246475,10000,2140,60,0,},		--30级
		{267530,10000,2971,83,0,},		--31级
		{289630,10000,4081,115,0,},		--32级
		{312790,10000,5552,156,0,},		--33级
		{337025,10000,7483,211,0,},		--34级
		{362355,10000,10000,282,0,},		--35级
		{388795,10000,10000,374,0,},		--36级
		{416365,10000,10000,492,0,},		--37级
		{445070,10000,10000,642,0,},		--38级
		{474930,10000,10000,833,0,},		--39级
		{505960,10000,10000,1073,0,},		--40级
		{538180,10000,10000,1374,0,},		--41级
		{571600,10000,10000,1749,0,},		--42级
		{606235,10000,10000,2213,0,},		--43级
		{642095,10000,10000,2785,0,},		--44级
		{679205,10000,10000,3486,0,},		--45级
		{717570,10000,10000,4343,0,},		--46级
		{757205,10000,10000,5386,0,},		--47级
		{798125,10000,10000,6648,0,},		--48级
		{840350,10000,10000,8170,0,},		--49级
		{0,10000,10000,10000,0,},			--50级
    },
    --金
    {
		{50,1,1,1,1,},		--1级
		{280,1,1,1,1,},		--2级
		{775,1,1,1,1,},		--3级
		{1600,1,1,1,1,},		--4级
		{2795,1,1,1,1,},		--5级
		{4405,1,1,1,1,},		--6级
		{6480,1,1,1,1,},		--7级
		{9050,1,1,1,1,},		--8级
		{12150,3,1,1,1,},		--9级
		{15810,9,1,1,1,},		--10级
		{20065,25,1,1,1,},		--11级
		{24940,60,1,1,1,},		--12级
		{30465,134,2,1,1,},		--13级
		{36665,282,4,1,1,},		--14级
		{43570,563,9,1,1,},		--15级
		{51200,1073,18,1,1,},		--16级
		{59575,1968,34,1,1,},		--17级
		{68730,3486,60,3,1,},		--18级
		{78675,5987,103,5,1,},		--19级
		{89440,10000,173,9,1,},		--20级
		{101045,10000,282,15,1,},		--21级
		{113505,10000,449,25,2,},		--22级
		{126845,10000,701,39,4,},		--23级
		{141090,10000,1073,60,6,},		--24级
		{156250,10000,1615,90,9,},		--25级
		{172345,10000,2390,134,14,},		--26级
		{189395,10000,3486,196,21,},		--27级
		{207425,10000,5016,282,30,},		--28级
		{226445,10000,7124,401,43,},		--29级
		{246475,10000,10000,563,60,},		--30级
		{267530,10000,10000,781,83,},		--31级
		{289630,10000,10000,1073,115,},		--32级
		{312790,10000,10000,1460,156,},		--33级
		{337025,10000,10000,1968,211,},		--34级
		{362355,10000,10000,2630,282,},		--35级
		{388795,10000,10000,3486,374,},		--36级
		{416365,10000,10000,4585,492,},		--37级
		{445070,10000,10000,5987,642,},		--38级
		{474930,10000,10000,7763,833,},		--39级
		{505960,10000,10000,10000,1073,},		--40级
		{538180,10000,10000,10000,1374,},		--41级
		{571600,10000,10000,10000,1749,},		--42级
		{606235,10000,10000,10000,2213,},		--43级
		{642095,10000,10000,10000,2785,},		--44级
		{679205,10000,10000,10000,3486,},		--45级
		{717570,10000,10000,10000,4343,},		--46级
		{757205,10000,10000,10000,5386,},		--47级
		{798125,10000,10000,10000,6648,},		--48级
		{840350,10000,10000,10000,8170,},		--49级
		{0,10000,10000,10000,10000,},			--50级
    },
}

--[[
属性成长表
属性索引	属性	    属性值	属性权重
2	        hp上限	    5	    1000
2	        mp上限	    10	    1000
3	        物防上限	2	    100
4	        物防下限	1	    100
5	        魔防上限	2	    100
5	        魔防下限	1	    100
--]]
horse_att_t =
{
    --1
    {
    },

    --  属性	    属性值	属性权重
    --  hp上限	    5	    1000
	--2
    {
        {3, 5, 200},    --hp上限
        {5, 10, 200},    --mp上限
        {6, 2, 10},    --物防上限
        {7, 1, 10},    --物防下限
        {8, 2, 10},    --魔防上限
        {9, 1, 10},    --魔防下限
        {10, 2, 10},    --物攻上限
        {11, 1, 10},    --物攻下限
        {12, 2, 10},    --魔攻上限
        {13, 1, 10},    --魔攻下限
        {14, 2, 10},    --道术上限
        {15, 1, 10},    --道术下限
        {21, 2, 250},    --上限背包负重
        {23, 2, 200},    --上限装备负重
        {25, 2, 150},    --上限腕力
        {3, 2, 1800},    --hp上限
        {5, 5, 1800},    --mp上限
        {6, 2, 90},    --物防上限
        {7, 1, 90},    --物防下限
        {8, 2, 90},    --魔防上限
        {9, 1, 90},    --魔防下限
        {10, 2, 90},    --物攻上限
        {11, 1, 90},    --物攻下限
        {12, 2, 90},    --魔攻上限
        {13, 1, 90},    --魔攻下限
        {14, 2, 90},    --道术上限
        {15, 1, 90},    --道术下限
        {21, 2, 2250},    --上限背包负重
        {23, 1, 1800},    --上限装备负重
        {25, 2, 1350},    --上限腕力
    },
    --3
    {
        {3, 15, 200},    --hp上限
        {5, 20, 200},    --mp上限
        {6, 4, 20},    --物防上限
        {7, 2, 20},    --物防下限
        {8, 4, 20},    --魔防上限
        {9, 2, 20},    --魔防下限
        {10, 4, 20},    --物攻上限
        {11, 2, 20},    --物攻下限
        {12, 4, 20},    --魔攻上限
        {13, 2, 20},    --魔攻下限
        {14, 4, 20},    --道术上限
        {15, 2, 20},    --道术下限
        {21, 5, 300},    --上限背包负重
        {23, 5, 200},    --上限装备负重
        {25, 5, 100},    --上限腕力
        {44, 5, 150},    --hp回复值
        {45, 5, 150},    --mp回复值
        {106, 2, 200},    --hp回复速度百分比
        {107, 2, 200},    --mp回复速度百分比
        {81, 2, 50},    --hp百分比
        {82, 2, 150},    --mp百分比
        {3, 5, 1800},    --hp上限
        {5, 10, 1800},    --mp上限
        {6, 4, 180},    --物防上限
        {7, 2, 180},    --物防下限
        {8, 4, 180},    --魔防上限
        {9, 2, 180},    --魔防下限
        {10, 4, 180},    --物攻上限
        {11, 2, 180},    --物攻下限
        {12, 4, 180},    --魔攻上限
        {13, 2, 180},    --魔攻下限
        {14, 4, 180},    --道术上限
        {15, 2, 180},    --道术下限
        {21, 4, 2700},    --上限背包负重
        {23, 2, 1800},    --上限装备负重
        {25, 4, 900},    --上限腕力
        {44, 2, 1350},    --hp回复值
        {45, 4, 1350},    --mp回复值
        {106, 2, 1800},    --hp回复速度百分比
        {107, 4, 1800},    --mp回复速度百分比
        {81, 2, 450},    --hp百分比
        {82, 4, 1350},    --mp百分比
    },
    --4
    {
        {3, 25, 200},    --hp上限
        {5, 40, 200},    --mp上限
        {6, 10, 20},    --物防上限
        {7, 5, 20},    --物防下限
        {8, 10, 20},    --魔防上限
        {9, 5, 20},    --魔防下限
        {10, 10, 20},    --物攻上限
        {11, 5, 20},    --物攻下限
        {12, 10, 20},    --魔攻上限
        {13, 5, 20},    --魔攻下限
        {14, 10, 20},    --道术上限
        {15, 5, 20},    --道术下限
        {21, 10, 500},    --上限背包负重
        {23, 10, 400},    --上限装备负重
        {25, 10, 300},    --上限腕力
        {44, 8, 150},    --hp回复值
        {45, 8, 150},    --mp回复值
        {106, 4, 200},    --hp回复速度百分比
        {107, 4, 200},    --mp回复速度百分比
        {81, 4, 50},    --hp百分比
        {82, 4, 150},    --mp百分比
        {83, 2, 20},    --物防上限百分比
        {84, 4, 20},    --物防下限百分比
        {85, 2, 20},    --魔防上限百分比
        {86, 4, 20},    --魔防下限百分比
        {87, 2, 20},    --物攻上限百分比
        {88, 4, 20},    --物攻下限百分比
        {89, 2, 20},    --魔攻上限百分比
        {90, 4, 20},    --魔攻下限百分比
        {91, 2, 20},    --道术上限百分比
        {92, 4, 20},    --道术下限百分比
        {103, 2, 250},    --背包负重百分比
        {104, 2, 200},    --装备负重百分比
        {105, 2, 150},    --腕力百分比
        {3, 10, 1800},    --hp上限
        {5, 20, 1800},    --mp上限
        {6, 8, 180},    --物防上限
        {7, 5, 180},    --物防下限
        {8, 8, 180},    --魔防上限
        {9, 5, 180},    --魔防下限
        {10, 8, 180},    --物攻上限
        {11, 5, 180},    --物攻下限
        {12, 8, 180},    --魔攻上限
        {13, 5, 180},    --魔攻下限
        {14, 8, 180},    --道术上限
        {15, 5, 180},    --道术下限
        {21, 10, 4500},    --上限背包负重
        {23, 5, 3600},    --上限装备负重
        {25, 5, 2700},    --上限腕力
        {44, 5, 1350},    --hp回复值
        {45, 10, 1350},    --mp回复值
        {106, 4, 1800},    --hp回复速度百分比
        {107, 10, 1800},    --mp回复速度百分比
        {81, 5, 450},    --hp百分比
        {82, 8, 1350},    --mp百分比
        {83, 4, 180},    --物防上限百分比
        {84, 4, 180},    --物防下限百分比
        {85, 4, 180},    --魔防上限百分比
        {86, 4, 180},    --魔防下限百分比
        {87, 4, 180},    --物攻上限百分比
        {88, 4, 180},    --物攻下限百分比
        {89, 4, 180},    --魔攻上限百分比
        {90, 4, 180},    --魔攻下限百分比
        {91, 4, 180},    --道术上限百分比
        {92, 4, 180},    --道术下限百分比
        {103, 4, 2250},    --背包负重百分比
        {104, 4, 1800},    --装备负重百分比
        {105, 4, 1350},    --腕力百分比
    },
    --5
    {
        {3, 50, 250},    --hp上限
        {5, 100, 250},    --mp上限
        {6, 20, 20},    --物防上限
        {7, 10, 20},    --物防下限
        {8, 20, 20},    --魔防上限
        {9, 10, 20},    --魔防下限
        {10, 20, 20},    --物攻上限
        {11, 10, 20},    --物攻下限
        {12, 20, 20},    --魔攻上限
        {13, 10, 20},    --魔攻下限
        {14, 20, 20},    --道术上限
        {15, 10, 20},    --道术下限
        {21, 20, 300},    --上限背包负重
        {23, 20, 250},    --上限装备负重
        {25, 20, 200},    --上限腕力
        {44, 12, 50},    --hp回复值
        {45, 12, 100},    --mp回复值
        {106, 8, 50},    --hp回复速度百分比
        {107, 8, 50},    --mp回复速度百分比
        {81, 8, 50},    --hp百分比
        {82, 8, 150},    --mp百分比
        {83, 3, 20},    --物防上限百分比
        {84, 5, 20},    --物防下限百分比
        {85, 3, 20},    --魔防上限百分比
        {86, 5, 20},    --魔防下限百分比
        {87, 3, 20},    --物攻上限百分比
        {88, 5, 20},    --物攻下限百分比
        {89, 3, 20},    --魔攻上限百分比
        {90, 5, 20},    --魔攻下限百分比
        {91, 3, 20},    --道术上限百分比
        {92, 5, 20},    --道术下限百分比
        {103, 5, 125},    --背包负重百分比
        {104, 5, 125},    --装备负重百分比
        {105, 5, 200},    --腕力百分比
        {18, 5, 100},    --移动速度，基准值
        {19, 5, 100},    --攻击速度，基准值
        {109, 2, 50},    --移动速度百分比
        {110, 2, 50},    --攻击速度百分比
        {111, 5, 50},    --吸当前hp-数值
        {114, 5, 50},    --吸当前mp-数值
        {16, 1, 10},    --命中
        {17, 1, 10},    --闪避
        {49, 1, 10},    --暴击率
        {50, 1, 10},    --幸运诅咒
        {117, 5, 50},    --物理伤害反射-数值
        {119, 5, 50},    --魔法伤害反射-数值
        {121, 5, 50},    --魔法伤害减免-数值
        {123, 5, 50},    --物理伤害减免-数值
        {3, 20, 2250},    --hp上限
        {5, 50, 2250},    --mp上限
        {6, 15, 180},    --物防上限
        {7, 6, 180},    --物防下限
        {8, 15, 180},    --魔防上限
        {9, 6, 180},    --魔防下限
        {10, 15, 180},    --物攻上限
        {11, 6, 180},    --物攻下限
        {12, 15, 180},    --魔攻上限
        {13, 6, 180},    --魔攻下限
        {14, 15, 180},    --道术上限
        {15, 6, 180},    --道术下限
        {21, 20, 2700},    --上限背包负重
        {23, 10, 2250},    --上限装备负重
        {25, 10, 1800},    --上限腕力
        {44, 10, 450},    --hp回复值
        {45, 10, 900},    --mp回复值
        {106, 10, 450},    --hp回复速度百分比
        {107, 15, 450},    --mp回复速度百分比
        {81, 10, 450},    --hp百分比
        {82, 15, 1350},    --mp百分比
        {83, 6, 180},    --物防上限百分比
        {84, 6, 180},    --物防下限百分比
        {85, 6, 180},    --魔防上限百分比
        {86, 6, 180},    --魔防下限百分比
        {87, 6, 180},    --物攻上限百分比
        {88, 6, 180},    --物攻下限百分比
        {89, 6, 180},    --魔攻上限百分比
        {90, 6, 180},    --魔攻下限百分比
        {91, 6, 180},    --道术上限百分比
        {92, 6, 180},    --道术下限百分比
        {103, 6, 1125},    --背包负重百分比
        {104, 6, 1125},    --装备负重百分比
        {105, 6, 1800},    --腕力百分比
        {18, 20, 900},    --移动速度，基准值
        {19, 30, 900},    --攻击速度，基准值
        {109, 5, 450},    --移动速度百分比
        {110, 5, 450},    --攻击速度百分比
        {111, 5, 450},    --吸当前hp-数值
        {114, 5, 450},    --吸当前mp-数值
        {16, 3, 90},    --命中
        {17, 3, 90},    --闪避
        {49, 2, 90},    --暴击率
        {50, 2, 90},    --幸运诅咒
        {117, 10, 450},    --物理伤害反射-数值
        {119, 10, 450},    --魔法伤害反射-数值
        {121, 10, 450},    --魔法伤害减免-数值
        {123, 10, 450},    --物理伤害减免-数值
    },
}

horse_att_t_to =
{
    --1
    {
    },

    --  属性	    属性值	属性权重
    --  hp上限	    5	    1000
	--2
    {
        {3, 5, 200},    --hp上限
        {5, 10, 200},    --mp上限
        {6, 2, 10},    --物防上限
        {7, 1, 10},    --物防下限
        {8, 2, 10},    --魔防上限
        {9, 1, 10},    --魔防下限
        {10, 2, 10},    --物攻上限
        {11, 1, 10},    --物攻下限
        {12, 2, 10},    --魔攻上限
        {13, 1, 10},    --魔攻下限
        {14, 2, 10},    --道术上限
        {15, 1, 10},    --道术下限
        {21, 2, 250},    --上限背包负重
        {23, 2, 200},    --上限装备负重
        {25, 2, 150},    --上限腕力
        {3, 2, 800},    --hp上限
        {5, 5, 800},    --mp上限
        {6, 2, 40},    --物防上限
        {7, 1, 40},    --物防下限
        {8, 2, 40},    --魔防上限
        {9, 1, 40},    --魔防下限
        {10, 2, 40},    --物攻上限
        {11, 1, 40},    --物攻下限
        {12, 2, 40},    --魔攻上限
        {13, 1, 40},    --魔攻下限
        {14, 2, 40},    --道术上限
        {15, 1, 40},    --道术下限
        {21, 2, 1000},    --上限背包负重
        {23, 1, 800},    --上限装备负重
        {25, 2, 600},    --上限腕力
    },
    --3
    {
        {3, 15, 200},    --hp上限
        {5, 20, 200},    --mp上限
        {6, 4, 20},    --物防上限
        {7, 2, 20},    --物防下限
        {8, 4, 20},    --魔防上限
        {9, 2, 20},    --魔防下限
        {10, 4, 20},    --物攻上限
        {11, 2, 20},    --物攻下限
        {12, 4, 20},    --魔攻上限
        {13, 2, 20},    --魔攻下限
        {14, 4, 20},    --道术上限
        {15, 2, 20},    --道术下限
        {21, 5, 300},    --上限背包负重
        {23, 5, 200},    --上限装备负重
        {25, 5, 100},    --上限腕力
        {44, 5, 150},    --hp回复值
        {45, 5, 150},    --mp回复值
        {106, 2, 200},    --hp回复速度百分比
        {107, 2, 200},    --mp回复速度百分比
        {81, 2, 50},    --hp百分比
        {82, 2, 150},    --mp百分比
        {3, 5, 800},    --hp上限
        {5, 10, 800},    --mp上限
        {6, 4, 80},    --物防上限
        {7, 2, 80},    --物防下限
        {8, 4, 80},    --魔防上限
        {9, 2, 80},    --魔防下限
        {10, 4, 80},    --物攻上限
        {11, 2, 80},    --物攻下限
        {12, 4, 80},    --魔攻上限
        {13, 2, 80},    --魔攻下限
        {14, 4, 80},    --道术上限
        {15, 2, 80},    --道术下限
        {21, 4, 1200},    --上限背包负重
        {23, 2, 800},    --上限装备负重
        {25, 4, 400},    --上限腕力
        {44, 2, 600},    --hp回复值
        {45, 4, 600},    --mp回复值
        {106, 2, 800},    --hp回复速度百分比
        {107, 4, 800},    --mp回复速度百分比
        {81, 2, 200},    --hp百分比
        {82, 4, 600},    --mp百分比
    },
    --4
    {
        {3, 25, 200},    --hp上限
        {5, 40, 200},    --mp上限
        {6, 10, 20},    --物防上限
        {7, 5, 20},    --物防下限
        {8, 10, 20},    --魔防上限
        {9, 5, 20},    --魔防下限
        {10, 10, 20},    --物攻上限
        {11, 5, 20},    --物攻下限
        {12, 10, 20},    --魔攻上限
        {13, 5, 20},    --魔攻下限
        {14, 10, 20},    --道术上限
        {15, 5, 20},    --道术下限
        {21, 10, 500},    --上限背包负重
        {23, 10, 400},    --上限装备负重
        {25, 10, 300},    --上限腕力
        {44, 8, 150},    --hp回复值
        {45, 8, 150},    --mp回复值
        {106, 4, 200},    --hp回复速度百分比
        {107, 4, 200},    --mp回复速度百分比
        {81, 4, 50},    --hp百分比
        {82, 4, 150},    --mp百分比
        {83, 2, 20},    --物防上限百分比
        {84, 4, 20},    --物防下限百分比
        {85, 2, 20},    --魔防上限百分比
        {86, 4, 20},    --魔防下限百分比
        {87, 2, 20},    --物攻上限百分比
        {88, 4, 20},    --物攻下限百分比
        {89, 2, 20},    --魔攻上限百分比
        {90, 4, 20},    --魔攻下限百分比
        {91, 2, 20},    --道术上限百分比
        {92, 4, 20},    --道术下限百分比
        {103, 2, 250},    --背包负重百分比
        {104, 2, 200},    --装备负重百分比
        {105, 2, 150},    --腕力百分比
        {3, 10, 800},    --hp上限
        {5, 20, 800},    --mp上限
        {6, 8, 80},    --物防上限
        {7, 5, 80},    --物防下限
        {8, 8, 80},    --魔防上限
        {9, 5, 80},    --魔防下限
        {10, 8, 80},    --物攻上限
        {11, 5, 80},    --物攻下限
        {12, 8, 80},    --魔攻上限
        {13, 5, 80},    --魔攻下限
        {14, 8, 80},    --道术上限
        {15, 5, 80},    --道术下限
        {21, 10, 2000},    --上限背包负重
        {23, 5, 1600},    --上限装备负重
        {25, 5, 1200},    --上限腕力
        {44, 5, 600},    --hp回复值
        {45, 10, 600},    --mp回复值
        {106, 4, 800},    --hp回复速度百分比
        {107, 10, 800},    --mp回复速度百分比
        {81, 5, 200},    --hp百分比
        {82, 8, 600},    --mp百分比
        {83, 4, 80},    --物防上限百分比
        {84, 4, 80},    --物防下限百分比
        {85, 4, 80},    --魔防上限百分比
        {86, 4, 80},    --魔防下限百分比
        {87, 4, 80},    --物攻上限百分比
        {88, 4, 80},    --物攻下限百分比
        {89, 4, 80},    --魔攻上限百分比
        {90, 4, 80},    --魔攻下限百分比
        {91, 4, 80},    --道术上限百分比
        {92, 4, 80},    --道术下限百分比
        {103, 4, 1000},    --背包负重百分比
        {104, 4, 800},    --装备负重百分比
        {105, 4, 600},    --腕力百分比
    },
    --5
    {
        {3, 50, 250},    --hp上限
        {5, 100, 250},    --mp上限
        {6, 20, 20},    --物防上限
        {7, 10, 20},    --物防下限
        {8, 20, 20},    --魔防上限
        {9, 10, 20},    --魔防下限
        {10, 20, 20},    --物攻上限
        {11, 10, 20},    --物攻下限
        {12, 20, 20},    --魔攻上限
        {13, 10, 20},    --魔攻下限
        {14, 20, 20},    --道术上限
        {15, 10, 20},    --道术下限
        {21, 20, 300},    --上限背包负重
        {23, 20, 250},    --上限装备负重
        {25, 20, 200},    --上限腕力
        {44, 12, 50},    --hp回复值
        {45, 12, 100},    --mp回复值
        {106, 8, 50},    --hp回复速度百分比
        {107, 8, 50},    --mp回复速度百分比
        {81, 8, 50},    --hp百分比
        {82, 8, 150},    --mp百分比
        {83, 3, 20},    --物防上限百分比
        {84, 5, 20},    --物防下限百分比
        {85, 3, 20},    --魔防上限百分比
        {86, 5, 20},    --魔防下限百分比
        {87, 3, 20},    --物攻上限百分比
        {88, 5, 20},    --物攻下限百分比
        {89, 3, 20},    --魔攻上限百分比
        {90, 5, 20},    --魔攻下限百分比
        {91, 3, 20},    --道术上限百分比
        {92, 5, 20},    --道术下限百分比
        {103, 5, 125},    --背包负重百分比
        {104, 5, 125},    --装备负重百分比
        {105, 5, 200},    --腕力百分比
        {18, 5, 100},    --移动速度，基准值
        {19, 5, 100},    --攻击速度，基准值
        {109, 2, 50},    --移动速度百分比
        {110, 2, 50},    --攻击速度百分比
        {111, 5, 50},    --吸当前hp-数值
        {114, 5, 50},    --吸当前mp-数值
        {16, 1, 10},    --命中
        {17, 1, 10},    --闪避
        {49, 1, 10},    --暴击率
        {50, 1, 10},    --幸运诅咒
        {117, 5, 50},    --物理伤害反射-数值
        {119, 5, 50},    --魔法伤害反射-数值
        {121, 5, 50},    --魔法伤害减免-数值
        {123, 5, 50},    --物理伤害减免-数值
        {3, 20, 1000},    --hp上限
        {5, 50, 1000},    --mp上限
        {6, 15, 80},    --物防上限
        {7, 6, 80},    --物防下限
        {8, 15, 80},    --魔防上限
        {9, 6, 80},    --魔防下限
        {10, 15, 80},    --物攻上限
        {11, 6, 80},    --物攻下限
        {12, 15, 80},    --魔攻上限
        {13, 6, 80},    --魔攻下限
        {14, 15, 80},    --道术上限
        {15, 6, 80},    --道术下限
        {21, 20, 1200},    --上限背包负重
        {23, 10, 1000},    --上限装备负重
        {25, 10, 800},    --上限腕力
        {44, 10, 200},    --hp回复值
        {45, 10, 400},    --mp回复值
        {106, 10, 200},    --hp回复速度百分比
        {107, 15, 200},    --mp回复速度百分比
        {81, 10, 200},    --hp百分比
        {82, 15, 600},    --mp百分比
        {83, 6, 80},    --物防上限百分比
        {84, 6, 80},    --物防下限百分比
        {85, 6, 80},    --魔防上限百分比
        {86, 6, 80},    --魔防下限百分比
        {87, 6, 80},    --物攻上限百分比
        {88, 6, 80},    --物攻下限百分比
        {89, 6, 80},    --魔攻上限百分比
        {90, 6, 80},    --魔攻下限百分比
        {91, 6, 80},    --道术上限百分比
        {92, 6, 80},    --道术下限百分比
        {103, 6, 500},    --背包负重百分比
        {104, 6, 500},    --装备负重百分比
        {105, 6, 800},    --腕力百分比
        {18, 20, 400},    --移动速度，基准值
        {19, 30, 400},    --攻击速度，基准值
        {109, 5, 200},    --移动速度百分比
        {110, 5, 200},    --攻击速度百分比
        {111, 5, 200},    --吸当前hp-数值
        {114, 5, 200},    --吸当前mp-数值
        {16, 3, 40},    --命中
        {17, 3, 40},    --闪避
        {49, 2, 40},    --暴击率
        {50, 2, 40},    --幸运诅咒
        {117, 10, 200},    --物理伤害反射-数值
        {119, 10, 200},    --魔法伤害反射-数值
        {121, 10, 200},    --魔法伤害减免-数值
        {123, 10, 200},    --物理伤害减免-数值
    },
}


------------------------------------------------------------------------------
------------------------------ Core ------------------------------------------
-- 给坐骑增加经验
function add_horse_exp(player, item, exp)
    local old_horse_level = get_horse_level(player, item)
    local h_type = get_horse_type(player, item)
    local item_name = lualib:Name(item)
    local old_exp = get_horse_cur_exp(player, item)
    local new_exp = old_exp + exp
    set_horse_cur_exp(player, item, new_exp)
    local level_up_exp = horse_level_up_t[h_type][old_horse_level][1]

    lualib:SysMsg_SendTipsMsg(player, "坐骑["..item_name.."] 获得经验: "..exp)

    process_horse_level_up(player, item)
end

------------------------------------------------------------------------------
------------------------------------------------------------------------------
--经验增加触发
function process_horse_add_exp(player, exp_addtion)
    -- 坐骑位
    local site = 16
    local item = lualib:Item_GetBySite(player, site)
    if item == "" then
        return
    end

    local item_name = lualib:Name(item)

    if lualib:Item_GetDurability(player, item) == 0 then
        lualib:SysMsg_SendWarnMsg(player, item_name.."已经死亡,请先使用[坐骑还魂丹]复活")
        return
    end

    -- 初始化所有变量
    local old_horse_level = get_horse_level(player, item)
    if old_horse_level == 0 then
        set_horse_type(player, item, 1)
        set_horse_level(player, item, 1)
        set_horse_cur_exp(player, item, 0)
        set_horse_max_exp(player, item, horse_level_up_t[1][1][1])
      --  lualib:SysMsg_SendWarnMsg(player, "初始化所有坐骑变量")
    end

    -- 已经升到顶级
	--exp_addtion打怪获得经验
    if old_horse_level >= 50 then
        --lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]已经升到顶级")
        return
    end

    local h_type = get_horse_type(player, item)
    if (h_type <= 0) or (h_type >= 6) then
        lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]品级异常")
        return
    end

    local exp = math.floor(exp_addtion / 100)

    -- 增加坐骑经验
    add_horse_exp(player, item, exp)
end

--坐骑升级触发
function process_horse_level_up(player, item)
    local h_type = get_horse_type(player, item)
    local old_horse_level = get_horse_level(player, item)
    local cur_exp = get_horse_cur_exp(player, item)

    local level_up_exp = horse_level_up_t[h_type][old_horse_level][1]
	
	
	local itemKeyName = lualib:KeyName(item)
    -- 属性成长
	local horse_xiyou =
		{
			"梦魇兽", "独角兽", "雪域天狼", "吼天兽", "裂天魔狮", "霸下玄龟", "神兽", "火翼龙", "火凤凰"
		}
	local horseType = 1
	
	for i = 1, #horse_xiyou do
		if horse_xiyou[i] == itemKeyName then
			horseType = 2
			break
		end
	end
	
	
    -- 如果未达到升级经验
    if cur_exp < level_up_exp then
        return
    end

    local item_name = lualib:Name(item)

    local new_horse_level = old_horse_level + 1
    set_horse_level(player, item, new_horse_level)
    lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]升到"..new_horse_level.."级")

    local new_exp = cur_exp - level_up_exp
    set_horse_cur_exp(player, item, new_exp)

    local new_max_exp = horse_level_up_t[h_type][new_horse_level][1]
    set_horse_max_exp(player, item, new_max_exp)

    local must_update = false

    --根据概率生成属性
	if horseType == 2 then
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] == 0 then
				local p_gen_rate = horse_level_up_t[h_type][new_horse_level][i]
				if lualib:GenRandom(1, 10000) <= p_gen_rate then
					local select_lib = horse_att_t_to[i]
					local n = table.getn(select_lib)

					local select_index = lualib:GenRandom(1, n)
					local select_item = select_lib[select_index]

					local p_rate = select_item[3]
					if lualib:GenRandom(1, 10000) <= p_gen_rate then
						local att_name = select_item[1]
						local att_value = select_item[2]
						lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

						local att_display_name = lualib:ToAttrName(att_name)
						lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]抽到第"..i.."条属性["..att_display_name.."], 初始值为"..att_value)

						must_update = true
					end
				end
			end
		end
	else
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] == 0 then
				local p_gen_rate = horse_level_up_t[h_type][new_horse_level][i]
				if lualib:GenRandom(1, 10000) <= p_gen_rate then
					local select_lib = horse_att_t[i]
					local n = table.getn(select_lib)

					local select_index = lualib:GenRandom(1, n)
					local select_item = select_lib[select_index]

					local p_rate = select_item[3]
					if lualib:GenRandom(1, 10000) <= p_gen_rate then
						local att_name = select_item[1]
						local att_value = select_item[2]
						lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

						local att_display_name = lualib:ToAttrName(att_name)
						lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]抽到第"..i.."条属性["..att_display_name.."], 初始值为"..att_value)

						must_update = true
					end
				end
			end
		end
	end

    -- 属性成长映射表
    -- grow_mappings[X][Y]表示属性X在条目Y时，属性X每多少级上升一点
    local grow_mappings =

--[x]={y1,y2,y3,y4,y5}
--x对应Att表内的属性条目，y是此属性在坐骑属性中的条目次序
    {
        [3] = {100, 6, 4, 2, 1},     --hp上限
        [5] = {100, 6, 4, 2, 1},     --mp上限
        [6] = {100, 6, 5, 4, 3},     --物防上限
        [7] = {100, 6, 5, 4, 3},     --物防下限
        [8] = {100, 6, 5, 4, 3},     --魔防上限
        [9] = {100, 6, 5, 4, 3},     --魔防下限
        [10] = {100, 6, 5, 4, 3},     --物攻上限
        [11] = {100, 6, 5, 4, 3},     --物攻下限
        [12] = {100, 6, 5, 4, 3},     --魔攻上限
        [13] = {100, 6, 5, 4, 3},     --魔攻下限
        [14] = {100, 6, 5, 4, 3},     --道术上限
        [15] = {100, 6, 5, 4, 3},     --道术下限
        [21] = {100, 6, 4, 2, 1},     --上限背包负重
        [23] = {100, 6, 4, 2, 1},     --上限装备负重
        [25] = {100, 6, 4, 2, 1},     --上限腕力
        [44] = {100, 6, 5, 4, 3},     --hp回复值
        [45] = {100, 6, 5, 4, 3},     --mp回复值
        [106] = {100, 6, 5, 4, 3},     --hp回复速度百分比
        [107] = {100, 6, 5, 4, 3},     --mp回复速度百分比
        [81] = {100, 6, 5, 4, 3},     --hp百分比
        [82] = {100, 6, 5, 4, 3},     --mp百分比
        [83] = {100, 6, 5, 4, 3},     --物防上限百分比
        [84] = {100, 6, 5, 4, 3},     --物防下限百分比
        [85] = {100, 6, 5, 4, 3},     --魔防上限百分比
        [86] = {100, 6, 5, 4, 3},     --魔防下限百分比
        [87] = {100, 6, 5, 4, 3},     --物攻上限百分比
        [88] = {100, 6, 5, 4, 3},     --物攻下限百分比
        [89] = {100, 6, 5, 4, 3},     --魔攻上限百分比
        [90] = {100, 6, 5, 4, 3},     --魔攻下限百分比
        [91] = {100, 6, 5, 4, 3},     --道术上限百分比
        [92] = {100, 6, 5, 4, 3},     --道术下限百分比
        [103] = {100, 6, 5, 4, 3},     --背包负重百分比
        [104] = {100, 6, 5, 4, 3},     --装备负重百分比
        [105] = {100, 6, 5, 4, 3},     --腕力百分比
        [18] = {100, 100, 100, 100, 5},     --移动速度，基准值
        [19] = {100, 100, 100, 100, 5},     --攻击速度，基准值
        [109] = {100, 100, 100, 100, 5},     --移动速度百分比
        [110] = {100, 100, 100, 100, 5},     --攻击速度百分比
        [111] = {100, 100, 100, 100, 5},     --吸血
        [114] = {100, 100, 100, 100, 5},     --吸魔
        [16] = {100, 100, 100, 100, 5},     --命中
        [17] = {100, 100, 100, 100, 5},     --闪避
        [49] = {100, 100, 100, 100, 5},     --暴击率
        [50] = {100, 100, 100, 100, 5},     --幸运诅咒
        [117] = {100, 100, 100, 100, 5},     --物理伤害反射-数值
        [119] = {100, 100, 100, 100, 5},     --魔法伤害反射-数值
        [121] = {100, 100, 100, 100, 5},     --魔法伤害减免-数值
        [123] = {100, 100, 100, 100, 5},     --物理伤害减免-数值
    }
	
    -- 属性成长映射表
    -- grow_mappings[X][Y]表示属性X在条目Y时，属性X每多少级上升一点
    local grow_mappingsTo =

--[x]={y1,y2,y3,y4,y5}
--x对应Att表内的属性条目，y是此属性在坐骑属性中的条目次序
    {
        [3]={100, 4, 3, 2, 1},  --hp上限
        [5]={100, 4, 3, 2, 1},  --mp上限
        [6]={100, 4, 4, 3, 3},  --物防上限
        [7]={100, 4, 4, 3, 3},  --物防下限
        [8]={100, 4, 4, 3, 3},  --魔防上限
        [9]={100, 4, 4, 3, 3},  --魔防下限
        [10]={100, 4, 4, 3, 3},  --物攻上限
        [11]={100, 4, 4, 3, 3},  --物攻下限
        [12]={100, 4, 4, 3, 3},  --魔攻上限
        [13]={100, 4, 4, 3, 3},  --魔攻下限
        [14]={100, 4, 4, 3, 3},  --道术上限
        [15]={100, 4, 4, 3, 3},  --道术下限
        [21]={100, 4, 3, 2, 1},  --上限背包负重
        [23]={100, 4, 3, 2, 1},  --上限装备负重
        [25]={100, 4, 3, 2, 1},  --上限腕力
        [44]={100, 4, 4, 3, 3},  --hp回复值
        [45]={100, 4, 4, 3, 3},  --mp回复值
        [106]={100, 4, 4, 3, 3},  --hp回复速度百分比
        [107]={100, 4, 4, 3, 3},  --mp回复速度百分比
        [81]={100, 4, 4, 3, 3},  --hp百分比
        [82]={100, 4, 4, 3, 3},  --mp百分比
        [83]={100, 4, 4, 3, 3},  --物防上限百分比
        [84]={100, 4, 4, 3, 3},  --物防下限百分比
        [85]={100, 4, 4, 3, 3},  --魔防上限百分比
        [86]={100, 4, 4, 3, 3},  --魔防下限百分比
        [87]={100, 4, 4, 3, 3},  --物攻上限百分比
        [88]={100, 4, 4, 3, 3},  --物攻下限百分比
        [89]={100, 4, 4, 3, 3},  --魔攻上限百分比
        [90]={100, 4, 4, 3, 3},  --魔攻下限百分比
        [91]={100, 4, 4, 3, 3},  --道术上限百分比
        [92]={100, 4, 4, 3, 3},  --道术下限百分比
        [103]={100, 4, 4, 3, 3},  --背包负重百分比
        [104]={100, 4, 4, 3, 3},  --装备负重百分比
        [105]={100, 4, 4, 3, 3},  --腕力百分比
        [18]={100, 100, 100, 100, 5},  --移动速度，基准值
        [19]={100, 100, 100, 100, 5},  --攻击速度，基准值
        [109]={100, 100, 100, 100, 5},  --移动速度百分比
        [110]={100, 100, 100, 100, 5},  --攻击速度百分比
        [111]={100, 100, 100, 100, 5},  --吸血
        [114]={100, 100, 100, 100, 5},  --吸魔
        [16]={100, 100, 100, 100, 5},  --命中
        [17]={100, 100, 100, 100, 5},  --闪避
        [49]={100, 100, 100, 100, 5},  --暴击率
        [50]={100, 100, 100, 100, 5},  --幸运诅咒
        [117]={100, 100, 100, 100, 5}, --物理伤害反射-数值
        [119]={100, 100, 100, 100, 5}, --魔法伤害反射-数值
        [121]={100, 100, 100, 100, 5}, --魔法伤害减免-数值
        [123]={100, 100, 100, 100, 5}, --物理伤害减免-数值
    }
	
	
	if horseType == 2 then
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] ~= 0 then
				local att_name = p[0]
				if lualib:Mod(new_horse_level, grow_mappingsTo[att_name][i]) == 0 then
					local att_value = p[1] + 1
					lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

					local att_display_name = lualib:ToAttrName(att_name)
					lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]第"..i.."条属性["..att_display_name.."]进化, 当前值为"..att_value)

					must_update = true
				end
			end
		end
	else
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] ~= 0 then
				local att_name = p[0]
				if lualib:Mod(new_horse_level, grow_mappings[att_name][i]) == 0 then
					local att_value = p[1] + 1
					lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

					local att_display_name = lualib:ToAttrName(att_name)
					lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]第"..i.."条属性["..att_display_name.."]进化, 当前值为"..att_value)

					must_update = true
				end
			end
		end
	end

    -- 通知客户端属性更新
    if must_update then
        lualib:Item_NotifyUpdate(player, item)
    end

    -- 已经升到顶级
    if new_horse_level >= 50 then
        lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]已经升到顶级")
        return
    end

    -- 如果经验剩余则递归调用
    if new_exp > horse_level_up_t[h_type][new_horse_level][1] then
        process_horse_level_up(player, item)
    end
end
