local lua_path = lualib:IO_GetLuaPath()
local package_path = package.path
package.path = string.format("%s;%s?.lua;%s?", package_path, lua_path, lua_path)

local itemsAll = {
			{
				["转1首饰箱"]={"圣武戒指","圣武手镯","圣武项链","圣武头盔","圣武腰带","圣武靴子"},      --转一到转八
				["转2首饰箱"]={"神魔头盔","神魔戒指","神魔项链","神魔靴子","神魔腰带","神魔项链"},
				["转3首饰箱"]={"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				["转4首饰箱"]={"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				["转5首饰箱"]={"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
				["转6首饰箱"]={"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				["转7首饰箱"]={"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				["转8首饰箱"]={"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
			},
			{
				["转1首饰箱"]={"圣魔戒指","圣魔手镯","圣魔项链","圣魔头盔","圣魔腰带","圣魔靴子"},      --转一到转八
				["转2首饰箱"]={"神魔头盔","神魔戒指","神魔项链","神魔靴子","神魔腰带","神魔项链"},
				["转3首饰箱"]={"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				["转4首饰箱"]={"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				["转5首饰箱"]={"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
				["转6首饰箱"]={"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				["转7首饰箱"]={"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				["转8首饰箱"]={"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
			},
			{
				["转1首饰箱"]={"圣灵戒指","圣灵手镯","圣灵项链","圣灵头盔","圣灵腰带","圣灵靴子"},       --转一到转八
				["转2首饰箱"]={"神魔头盔","神魔戒指","神魔项链","神魔靴子","神魔腰带","神魔项链"},
				["转3首饰箱"]={"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				["转4首饰箱"]={"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				["转5首饰箱"]={"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
				["转6首饰箱"]={"神魔项链","神魔项链","神魔项链","神魔项链","神魔项链","神魔项链"},
				["转7首饰箱"]={"神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子","神魔靴子"},
				["转8首饰箱"]={"神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带","神魔腰带"},
			},
			
				}


function GetAward(player,name,reward)
	--lualib:SysPromptMsg(player, ""..tostring(reward))
	local job = lualib:Job(player)
	local items = itemsAll[job][name]
	if items == nil then
		return ""
	end
	if lualib:DelItem(player, name, 1, 2, "转生首饰箱", "系统") then
		lualib:AddItem(player,items[tonumber(reward)],1,false,"转生首饰箱", "系统")
	end
	lualib:ShowFormWithContent(player,"脚本表单","EquipOption.Close()")
	return ""
end