local s = {
				{"1 + 1 = ", 2, {1, 2, 3, 4}},
				{"1 + 2 = ", 3, {1, 2, 3, 4}},
				{"1 + 3 = ", 4, {1, 2, 3, 4}},
				{"1 + 4 = ", 1, {5, 2, 3, 4}},
				{"1 + 5 = ", 3, {1, 2, 6, 4}},
				{"1 + 6 = ", 4, {1, 2, 3, 7}},
				{"1 + 7 = ", 2, {1, 8, 3, 4}},
				{"1 + 8 = ", 2, {1, 9, 3, 4}},
				{"1 + 9 = ", 1, {10, 2, 3, 4}},
				{"2 + 2 = ", 4, {12, 11, 5, 4}},
				{"2 + 3 = ", 1, {5, 23, 32, 4}},
				{"2 + 4 = ", 3, {7, 5, 6, 2}},
				{"2 + 5 = ", 2, {11, 7, 2, 9}},
				{"2 + 6 = ", 3, {22, 12, 8, 4}},
				{"2 + 7 = ", 1, {9, 19, 27, 5}},
				{"2 + 8 = ", 4, {6, 4, 16, 10}},
				{"2 + 9 = ", 3, {18, 7, 11, 4}},
				{"3 + 3 = ", 2, {9, 6, 3, 1}},
				{"3 + 4 = ", 1, {7, 12, 1, 2}},
				{"3 + 5 = ", 3, {15, 12, 8, 2}},
				{"3 + 6 = ", 4, {8, 7, 2, 9}},
				{"3 + 7 = ", 2, {4, 10, 13, 6}},
				{"3 + 8 = ", 3, {5, 12, 11, 10}},
				{"3 + 9 = ", 2, {15, 12, 3, 6}},
				{"4 + 4 = ", 1, {8, 7, 9, 6}},
				{"4 + 5 = ", 4, {10, 20, 1, 9}},
				{"4 + 6 = ", 3, {11, 9, 10, 6}},
				{"4 + 7 = ", 4, {15, 12, 13, 11}},
				{"4 + 8 = ", 2, {11, 12, 13, 9}},
				{"4 + 9 = ", 3, {15, 14, 13, 12}},
				{"5 + 5 = ", 1, {10, 12, 11, 9}},
				{"5 + 6 = ", 3, {12, 13, 11, 10}},
				{"5 + 7 = ", 2, {15, 12, 13, 16}},
				{"5 + 8 = ", 3, {11, 12, 13, 14}},
				{"5 + 9 = ", 1, {14, 12, 13, 11}},
				{"6 + 6 = ", 2, {11, 12, 13, 14}},
				{"6 + 7 = ", 3, {11, 12, 13, 16}},
				{"6 + 8 = ", 4, {15, 12, 13, 14}},
				{"6 + 9 = ", 1, {15, 12, 13, 16}},
				{"7 + 7 = ", 1, {14, 12, 13, 16}},
				{"7 + 8 = ", 1, {15, 12, 13, 16}},
				{"7 + 9 = ", 4, {15, 12, 13, 16}},
				{"8 + 8 = ", 4, {15, 14, 13, 16}},
				{"8 + 9 = ", 3, {16, 15, 17, 18}},
				{"9 + 9 = ", 3, {20, 19, 18, 17}},
				{"十 + 十 = ", 1, {20, 19, 22, 23}},
				{"十 + 十一 = ", 2, {20, 21, 22, 23}},
				{"十 + 十二 = ", 3, {20, 21, 22, 23}},
				{"十 + 十三 = ", 3, {21, 22, 23, 24}},
				{"十 + 十四 = ", 4, {23, 25, 26, 24}},
				{"十 + 十五 = ", 1, {25, 26, 27, 28}},
				{"十 + 十六 = ", 3, {27, 24, 26, 25}},
				{"十 + 十七 = ", 1, {27, 24, 23, 28}},
				{"十 + 十八 = ", 4, {29, 30, 31, 28}},
				{"十 + 十九 = ", 2, {20, 29, 19, 39}},
				{"十一 + 十一 = ", 3, {32, 21, 22, 23}},
				{"十一 + 十二 = ", 4, {20, 21, 22, 23}},
				{"十一 + 十三 = ", 1, {24, 25, 22, 26}},
				{"十一 + 十四 = ", 4, {23, 35, 24, 25}},
				{"十一 + 十五 = ", 2, {29, 26, 38, 17}},
				{"十一 + 十六 = ", 3, {26, 37, 27, 17}},
				{"十一 + 十七 = ", 2, {38, 28, 18, 27}},
				{"十一 + 十八 = ", 2, {39, 29, 20, 31}},
				{"十一 + 十九 = ", 1, {30, 29, 31, 32}},
				{"十二 + 十二 = ", 4, {29, 26, 25, 24}},
				{"十二 + 十三 = ", 1, {25, 35, 45, 24}},
				{"十二 + 十四 = ", 3, {24, 25, 26, 27}},
				{"十二 + 十五 = ", 2, {24, 26, 35, 27}},
				{"十二 + 十六 = ", 3, {19, 18, 28, 27}},
				{"十二 + 十七 = ", 4, {31, 25, 30, 29}},
				{"十二 + 十八 = ", 1, {30, 29, 31, 32}},
				{"十二 + 十九 = ", 2, {29, 31, 32, 33}},
				{"十三 + 十三 = ", 4, {24, 27, 25, 26}},
				{"十三 + 十四 = ", 1, {27, 31, 24, 28}},
				{"十三 + 十五 = ", 3, {20, 19, 28, 17}},
				{"十三 + 十六 = ", 4, {31, 30, 28, 29}},
				{"十三 + 十七 = ", 2, {40, 30, 20, 31}},
				{"十三 + 十八 = ", 2, {30, 31, 33, 29}},
				{"十三 + 十九 = ", 1, {32, 33, 31, 30}},
				{"十四 + 十四 = ", 4, {30, 29, 27, 28}},
				{"十四 + 十五 = ", 3, {28, 19, 29, 30}},
				{"十四 + 十六 = ", 2, {29, 30, 31, 32}},
				{"十四 + 十七 = ", 3, {29, 30, 31, 32}},
				{"十四 + 十八 = ", 1, {32, 31, 30, 29}},
				{"十四 + 十九 = ", 4, {30, 35, 32, 33}},
				{"十五 + 十五 = ", 4, {20, 50, 40, 30}},
				{"十五 + 十六 = ", 2, {30, 31, 28, 29}},
				{"十五 + 十七 = ", 1, {32, 33, 34, 35}},
				{"十五 + 十八 = ", 2, {32, 33, 34, 35}},
				{"十五 + 十九 = ", 3, {32, 33, 34, 35}},
				{"十六 + 十六 = ", 4, {33, 30, 31, 32}},
				{"十六 + 十七 = ", 3, {53, 43, 33, 23}},
				{"十六 + 十八 = ", 2, {24, 34, 35, 25}},
				{"十六 + 十九 = ", 4, {31, 45, 25, 35}},
				{"十七 + 十七 = ", 1, {34, 33, 32, 31}},
				{"十七 + 十八 = ", 3, {33, 36, 35, 34}},
				{"十七 + 十九 = ", 4, {29, 26, 39, 36}},
				{"十八 + 十八 = ", 2, {26, 36, 37, 27}},
				{"十八 + 十九 = ", 1, {37, 46, 28, 35}},
				{"十九 + 十九 = ", 3, {48, 33, 38, 42}},
			}

function plup(player)
	local times = lualib:GetAllTime()
	local plupTime = lualib:GetInt(player, "plupTime")
	
	if times - plupTime < 1000 then
		return ""
	end
	
	lualib:SetInt(player, "plupTime", times)
	
	lualib:SysMsg_SendTriggerMsg(player, "系统将在10秒后发送防外挂检测！")
	lualib:AddTimerEx(player, 997, 10000, 1, "plupEx", "")
	return ""
end


local boss_map_list = {
						["废弃矿洞4"]=1,
						["废弃矿洞5"]=1,
						["废弃矿洞6"]=1,
						["将军冢3"]=1,
						["将军冢boss"]=1,
						["将军冢密室"]=1,
						["妖山暗穴5"]=1,
						["妖山暗穴8"]=1,
						["妖山暗穴boss"]=1,
						["邪庙6-1"]=1,
						["邪庙6-2"]=1,
						["邪庙6-3"]=1,
						["邪庙6-4"]=1,
						["邪庙6-5"]=1,
						["邪庙6-6"]=1,
						["邪庙6-7"]=1,
						["邪庙6-8"]=1,
						["邪庙6-9"]=1,
						["邪庙6-10"]=1,
						["邪庙6-11"]=1,
						["邪庙6-12"]=1,
						["邪庙6-13"]=1,
						["邪庙6-14"]=1,
						["邪庙6-15"]=1,
						["邪庙6-16"]=1,
						["邪庙7-1"]=1,
						["邪庙7-2"]=1,
						["邪庙7-3"]=1,
						["邪庙boss"]=1,
						["天荒阵5"]=1,
						["天荒阵6"]=1,
						["天荒阵7-1"]=1,
						["天荒阵7-2"]=1,
						["天荒阵7-3"]=1,
						["天荒阵7-4"]=1,
						["天荒阵7-5"]=1,
						["天荒阵7-6"]=1,
						["天荒阵7-7"]=1,
						["天荒阵7-8"]=1,
						["天荒阵7-9"]=1,
						["天荒阵boss"]=1,
						["绝路城3"]=1,
						["绝路城boss"]=1,
						["天魔石窟3"]=1,
						["天魔石窟4"]=1,
						["天魔石窟boss"]=1,
						["海底2"]=1,
						["海底3"]=1,
						["海底3野外"]=1,
						["海底4"]=1,
						["海底4野外"]=1,
						["海底5"]=1,
						["海底1船舱1"]=1,
						["海底1船舱2"]=1,
						["海底1船舱3"]=1,
						["海底1船舱4"]=1,
						["海底1船舱5"]=1,
						["海底1船舱6"]=1,
						["海底1船舱7"]=1,
						["海底2船舱1"]=1,
						["海底2船舱2"]=1,
						["海底2船舱3"]=1,
						["海底2船舱4"]=1,
						["海底2船舱5"]=1,
						["海底2船舱6"]=1,
						["海底3船舱1"]=1,
						["海底4船舱1"]=1,
						["海底4船舱2"]=1,
						["镇魔禁地1"]=1,
						["镇魔禁地2"]=1,
						["镇魔禁地3"]=1,
						["镇魔禁地4"]=1,
						["镇魔禁地5"]=1,
						["镇魔禁地6"]=1,
						["镇魔禁地7"]=1,
						["镇魔禁地8"]=1,
						["镇魔禁地9"]=1,
						["镇魔禁地10"]=1,
						["镇魔禁地11"]=1,
						["镇魔禁地12"]=1,
						["镇魔大殿"]=1,
						["镇魔秘道1"]=1,
						["镇魔秘道2"]=1,
						["赤炎部落入口"]=1,
						["赤炎部落1"]=1,
						["赤炎部落2"]=1,
						["赤炎部落3"]=1,
						["赤炎禁地"]=1,
						["神歌城皇宫"]=1,
						["神歌城"]=1,
						["神歌城密道"]=1,
						["尸王大殿"]=1,
						["天荒古阵"]=1,
						["第三重天秘洞"]=1,
						["天下第一战场"]=1,
						["漂流岛"]=1,
						["初级试炼场"]=1,
						["中级试炼场"]=1,
						["高级试炼场"]=1,
						["克星挑战场1"]=1,
						["克星挑战场2"]=1,
						["克星挑战场3"]=1,
						["锁魔宫"]=1,
						["引灵寺"]=1,
						["亡灵禁地"]=1,
						["灵山"]=1,
						["玉完天幻境"]=1,
						["封魔阵"]=1,
						["古墓"]=1,
						["夺宝大厅"]=1,
						["地下城"]=1,
						["武斗场"]=1,
						["灵韵阁"]=1,
						["封魔台"]=1,
						["镇魔殿"]=1,
						["修炼场"]=1,
						["藏经楼"]=1,
						["异兽栏"]=1,
						["珍宝洞"]=1,
						["百草堂"]=1,
						["木人巷"]=1,
						["木人巷2"]=1,
						["木人巷3"]=1,
						["灵元秘境1"]=1,
						["灵元秘境2"]=1,
						["灵元秘境3"]=1,
						["烈焰深渊1"]=1,
						["烈焰深渊2"]=1,
						["烈焰深渊3"]=1,
						["千幻阵"]=1,
						["休息室"]=1,
						["擂台"]=1,
						["秘海封印"]=1,
						["超级试炼场"]=1,
						["精英竞技场-群雄逐鹿"]=1,
						["精英竞技场-16进8"]=1,
						["精英竞技场-8进4"]=1,
						["精英竞技场-4进2"]=1,
						["精英竞技场-季军赛"]=1,
						["精英竞技场-冠亚军赛"]=1,
						["精英竞技场-休息间"]=1,
						["精英竞技场-组队赛"]=1,
						["挑战场1"]=1,
						["挑战场2"]=1,
						["挑战场3"]=1,
						["富商的藏金屋"]=1,
						["战斗副本"]=1,
						["守护副本"]=1,
						["任务副本1"]=1,
						["大逃杀"]=1,
						["渡劫"]=1,
}






function plupEx(player)
	
	local map = lualib:Name(lualib:MapGuid(player))
	local X = lualib:X(player)
	local Y = lualib:Y(player)
	
	local t1 = map == "巫山城" and X > 200 and X < 260 and Y > 200 and Y > 260
	local t2 = map == "东临城" and X > 295 and X < 355 and Y > 270 and Y > 330
	local t3 = map == "龙城城" and X > 180 and X < 300 and Y > 240 and Y > 360
	local t4 = map == "辟岭村"
	
	if t1 == true or t2 == true or t3 == true or t4 == true then
		return ""
	end
	
	if boss_map_list[map] == 1 then
		return ""
	end
	
	local msg = "防外挂检测，请1分钟内回答下面的问题！\n \n"
	
	local rand = math.random(1, #s)
	
	msg = msg..s[rand][1].."\n \n"
	
	for i = 1, #s[rand][3] do
		msg = msg.."<@huida#"..rand.."#"..i.." *01*"..s[rand][3][i]..">"
		msg = msg.."       "
	end
	lualib:AddTimerEx(player, 999, 60000, 1, "Kick", "")
	lualib:NPCTalk(player, msg)
	return ""
end


function huida(player, rand, i)
	local name =lualib:Name(player)
	local plup_in_num = lualib:GetInt(player, "plup_in_num")
	if tonumber(i) == s[tonumber(rand)][2] then
		lualib:Player_SubExp(player, 1000, "防外挂", "")
		lualib:DisableTimer(player, 999)
		lualib:SetInt(player, "plup_in_num", 0)
		return ""
	elseif plup_in_num > 0 then
		lualib:SysMsg_SendTriggerMsg(player, "你在防外挂检测中连续量次失败，将被踢下线！")
		lualib:AddTimerEx(player, 998, 2500, 1, "Kick", "")
		return ""
	else
		lualib:SetInt(player, "plup_in_num", plup_in_num + 1)
		lualib:SysMsg_SendTriggerMsg(player, "回答错误，请重新回答！")
		plupEx(player)
	end
end

	
function Kick(player)
	local plup_in_num = lualib:GetInt(player, "plup_in_num")
	local name =lualib:Name(player)
	local getint = lualib:GetInt(player, "plup-in")
	if plup_in_num > 1 then
		lualib:SetInt(player, "plup-in", getint + 1)
		lualib:Player_Kick(player)
		lualib:SendMail("系统", name, "你在防外挂检测中失败，被踢下线！")
	else
		lualib:SetInt(player, "plup_in_num", plup_in_num + 1)
		lualib:SysMsg_SendTriggerMsg(player, "请重新回答，否则将被踢下线！")
		plupEx(player)
	end
	return ""
end