function main(hero, item)
	local map = lualib:MapGuid(hero)	--因为无法通过英雄取得玩家的GUID  暂时只能向地图发送消息。需要一个通过英雄GUID 取得 英雄所属玩家的GUID的接口。便可以只向玩家发送消息。
	
	local item_skill_table =
							{
								[1] = 	----战士英雄可学技能
										{
											["变猪术"]  = {"变猪术", 1},
											["落马术"]  = {"落马术", 1},
											["英雄基本剑术"] = {"英雄基本剑术1级", 7},
											["英雄攻杀剑术"]   = {"英雄攻杀剑术1级", 19},
											["英雄刺杀剑术"] = {"英雄刺杀剑术1级", 25},
											["英雄半月弯刀"] = {"英雄半月弯刀1级", 28},
											["英雄野蛮冲撞"] = {"英雄野蛮冲撞1级", 30},
											["英雄烈火剑法"] = {"英雄烈火剑法1级", 35},
											["英雄狮子吼"]	 = {"英雄狮子吼1级", 38},
											["英雄开天斩"]	 = {"英雄开天斩1级", 40},					
										},
								[2] = 	----法师英雄可学技能
										{
											["变猪术"]  = {"变猪术", 1},
										    ["落马术"]  = {"落马术", 1},
										    ["英雄火球术"]  = {"英雄火球术1级", 7},
										    ["英雄抗拒火环"]= {"英雄抗拒火环1级", 12},
										    ["英雄诱惑之光"]= {"英雄诱惑之光1级", 13},
										    ["英雄地狱火"]  = {"英雄地狱火1级", 16},
										    ["英雄雷电术"]  = {"英雄雷电术1级", 17},
										    ["英雄寒冰掌"]  = {"英雄冰箭术1级", 19},
										    ["英雄瞬息移动"]= {"英雄瞬息移动1级", 19},
										    ["英雄大火球"]  = {"英雄大火球术1级", 19},
										    ["英雄爆裂火焰"]  = {"英雄爆裂火焰1级", 22},
										    ["英雄火墙"]= {"英雄火墙1级", 24},
										    ["英雄疾光电影"]= {"英雄疾光电影1级", 26},
										    ["英雄地狱雷光"]= {"英雄地狱雷光1级", 30},
										    ["英雄魔法盾"]    = {"英雄魔法盾1级", 31},
										    ["英雄圣言术"]	= {"英雄圣言术1级", 32},
										    ["英雄冰咆哮"]= {"英雄冰咆哮1级", 35},
										    ["英雄灭天火"]= {"英雄灭天火1级", 38},
										    ["英雄陨星灭世"]= {"英雄陨星灭世1级", 40},
										},
								[3] = 	----道士英雄可学技能
										{
											["变猪术"]  = {"变猪术", 1},
										    ["落马术"]  = {"落马术", 1},
										    ["英雄治愈术"]  = {"英雄治愈术1级", 7},
										    ["英雄施毒术"]  = {"英雄施毒术1级", 14},
										    ["英雄灵魂火符"]= {"英雄灵魂火符1级", 18},
										    ["英雄召唤骷髅"]= {"英雄召唤骷髅1级", 19},
										    ["英雄隐身术"]  = {"英雄隐身术1级", 20},
										    ["英雄集体隐身"]  = {"英雄集体隐身术1级", 21},
										    ["英雄幽灵盾"]={"英雄幽灵盾1级", 22},
										    ["英雄神圣战甲"]={"英雄神圣战甲术1级", 25},
										    ["英雄群疗术"]  = {"英雄群体治愈术1级", 33},
										    ["英雄精神战法"]= {"英雄精神力战法1级", 9},
										    ["英雄困魔咒"]  = {"英雄困魔咒1级", 28},
										    ["英雄召唤神兽"]= {"英雄召唤神兽1级", 35},
										    ["英雄群体施毒术"]= {"英雄群施毒术1级", 37},
										    ["英雄驱毒术"]= {"英雄驱毒术1级", 39},
										    ["英雄无极真气"]= {"英雄无极真气1级", 39},
										    ["英雄召唤月灵"]= {"英雄召唤月灵1级", 40},
											["英雄气功波"]= {"英雄气功波1级", 40},
										},
							}

    local item_key = lualib:KeyName(item)
	local hero_jb = lualib:Job(hero)	--当前英雄职业
	local hero_lv = lualib:Level(hero) --当前英雄等级
	
    if item_skill_table[hero_jb][item_key] == nil then
        lualib:SysWarnMsg(map, "技能与当前英雄职业不匹配！")
        return false
    end
	
	local lv_s = item_skill_table[hero_jb][item_key][2]  --该英雄学习技能需要的等级	
    if hero_lv < lv_s then
        lualib:SysWarnMsg(map, "当前英雄等级不符！")
        return false
    end	

	local skill_k = item_skill_table[hero_jb][item_key][1]    --该技能书指向的技能keyname
	
	if lualib:HasSkill(hero, skill_k, true) == true then
        lualib:SysWarnMsg(map, "当前英雄已经学会该技能！无需重复学习！")
        return false	
	end
	
	if lualib:Item_Destroy(hero, item, "删物品：使用技能书", "技能书") == true then
		lualib:AddSkill(hero, skill_k)
		lualib:SysMsg_SendPromptMsg(hero, "技能学习成功！")
	
	else
		lualib:SysWarnMsg(map, "扣除道具失败！技能不能学习！")
	end

    return true
end
