--[[
自定义变量列表
h_cur_exp:                  坐骑当前exp
变量类型:                   int

h_type:                     坐骑品级
变量类型:                   int

h_level:                    坐骑等级
变量类型:                   int

--]]

--当前exp
function get_horse_cur_exp(player, item)
    local h_cur_exp = lualib:Item_GetCustomVarInt(player, item, "h_cur_exp")
    return h_cur_exp
end

--设置当前exp
function set_horse_cur_exp(player, item, h_cur_exp)
    lualib:Item_SetCustomVarInt(player, item, "h_cur_exp", h_cur_exp)
    lualib:Item_NotifyCustomParam(player, item, "h_cur_exp")
end

--设置exp上限
function get_horse_max_exp(player, item)
    local h_max_exp = lualib:Item_GetCustomVarInt(player, item, "h_max_exp")
    return h_max_exp
end

--设置exp上限
function set_horse_max_exp(player, item, h_max_exp)
    lualib:Item_SetCustomVarInt(player, item, "h_max_exp", h_max_exp)
    lualib:Item_NotifyCustomParam(player, item, "h_max_exp")
end

--坐骑品级
function get_horse_type(player, item)
    local h_type = lualib:Item_GetCustomVarInt(player, item, "h_type")
    return h_type
end

--设置坐骑品级
function set_horse_type(player, item, h_type)
    lualib:Item_SetCustomVarInt(player, item, "h_type", h_type)
    lualib:Item_NotifyCustomParam(player, item, "h_type")
end

--坐骑等级
function get_horse_level(player, item)
    local h_level = lualib:Item_GetCustomVarInt(player, item, "h_level")
    return h_level
end

--设置坐骑等级
function set_horse_level(player, item, h_level)
    lualib:Item_SetCustomVarInt(player, item, "h_level", h_level)
    lualib:Item_NotifyCustomParam(player, item, "h_level")
end

--[[
升级表
品阶索引	    等级	升级经验	    属性2概率	属性3概率	属性4概率	属性5概率
1	            1	    10	            0	        0	        0	        0
1	            2	    10	            0	        0	        0	        0
2	            2	    20	            0	        0	        0	        0
3	            3	    30	            0	        0	        0	        0
4	            4	    40	            0	        0	        0	        0
5	            5	    60	            0	        0	        0	        0
白绿蓝紫金
--]]
horse_level_up_t =
{
    {
        -- 升级经验	    属性2概率	属性3概率	属性4概率	属性5概率
		--白
		{100,       0,0,0,0,},		--1级
		{746,       0,0,0,0,},		--2级
		{2419,      0,0,0,0,},		--3级
		{5571,      0,0,0,0,},		--4级
		{10641,     0,0,0,0,},		--5级
		{18056,     0,0,0,0,},		--6级
		{28234,     0,0,0,0,},		--7级
		{41587,     0,0,0,0,},		--8级
		{58519,     0,0,0,0,},		--9级
		{79432,     0,0,0,0,},		--10级
		{104722,    0,0,0,0,},		--11级
		{134780,    0,0,0,0,},		--12级
		{169994,    0,0,0,0,},		--13级
		{210751,    0,0,0,0,},		--14级
		{257433,    0,0,0,0,},		--15级
		{310418,    0,0,0,0,},		--16级
		{370085,    0,0,0,0,},		--17级
		{436807,    0,0,0,0,},		--18级
		{510958,    0,0,0,0,},		--19级
		{592907,    0,0,0,0,},		--20级
		{683023,    0,0,0,0,},		--21级
		{781674,    0,0,0,0,},		--22级
		{889223,    0,0,0,0,},		--23级
		{1006033,   0,0,0,0,},		--24级
		{1132468,   0,0,0,0,},		--25级
		{1268886,   0,0,0,0,},		--26级
		{1415646,   0,0,0,0,},		--27级
		{1573107,   0,0,0,0,},		--28级
		{1741623,   0,0,0,0,},		--29级
		{1921549,   0,0,0,0,},		--30级
		{2113240,   0,0,0,0,},		--31级
		{2317047,   0,0,0,0,},		--32级
		{2533322,   0,0,0,0,},		--33级
		{2762414,   0,0,0,0,},		--34级
		{3004673,   0,0,0,0,},		--35级
		{3260447,   0,0,0,0,},		--36级
		{3530083,   0,0,0,0,},		--37级
		{3813927,   0,0,0,0,},		--38级
		{4112324,   0,0,0,0,},		--39级
		{4425618,   0,0,0,0,},		--40级
		{4754153,   0,0,0,0,},		--41级
		{5098271,   0,0,0,0,},		--42级
		{5458314,   0,0,0,0,},		--43级
		{5834622,   0,0,0,0,},		--44级
		{6227536,   0,0,0,0,},		--45级
		{6637395,   0,0,0,0,},		--46级
		{7064538,   0,0,0,0,},		--47级
		{7509302,   0,0,0,0,},		--48级
		{7972024,   0,0,0,0,},		--49级
		{0,         0,0,0,0,},	    --50级
    },
    --绿
    {
        {100, 1, 0, 0, 0},      --1级
        {746, 1, 0, 0, 0},      --2级
        {2419, 1, 0, 0, 0},      --3级
        {5571, 1, 0, 0, 0},      --4级
        {10641, 1, 0, 0, 0},      --5级
        {18056, 1, 0, 0, 0},      --6级
        {28234, 1, 0, 0, 0},      --7级
        {41587, 1, 0, 0, 0},      --8级
        {58519, 1, 0, 0, 0},      --9级
        {79432, 3, 0, 0, 0},      --10级
        {104722, 5, 0, 0, 0},      --11级
        {134780, 7, 0, 0, 0},      --12级
        {169994, 11, 0, 0, 0},      --13级
        {210751, 17, 0, 0, 0},      --14级
        {257433, 24, 0, 0, 0},      --15级
        {310418, 33, 0, 0, 0},      --16级
        {370085, 45, 0, 0, 0},      --17级
        {436807, 60, 0, 0, 0},      --18级
        {510958, 79, 0, 0, 0},      --19级
        {592907, 102, 0, 0, 0},      --20级
        {683023, 130, 0, 0, 0},      --21级
        {781674, 164, 0, 0, 0},      --22级
        {889223, 205, 0, 0, 0},      --23级
        {1006033, 254, 0, 0, 0},      --24级
        {1132468, 312, 0, 0, 0},      --25级
        {1268886, 380, 0, 0, 0},      --26级
        {1415646, 459, 0, 0, 0},      --27级
        {1573107, 550, 0, 0, 0},      --28级
        {1741623, 656, 0, 0, 0},      --29级
        {1921549, 777, 0, 0, 0},      --30级
        {2113240, 916, 0, 0, 0},      --31级
        {2317047, 1073, 0, 0, 0},      --32级
        {2533322, 1252, 0, 0, 0},      --33级
        {2762414, 1453, 0, 0, 0},      --34级
        {3004673, 1680, 0, 0, 0},      --35级
        {3260447, 1934, 0, 0, 0},      --36级
        {3530083, 2219, 0, 0, 0},      --37级
        {3813927, 2535, 0, 0, 0},      --38级
        {4112324, 2887, 0, 0, 0},      --39级
        {4425618, 3276, 0, 0, 0},      --40级
        {4754153, 3707, 0, 0, 0},      --41级
        {5098271, 4182, 0, 0, 0},      --42级
        {5458314, 4704, 0, 0, 0},      --43级
        {5834622, 5277, 0, 0, 0},      --44级
        {6227536, 5904, 0, 0, 0},      --45级
        {6637395, 6590, 0, 0, 0},      --46级
        {7064538, 7339, 0, 0, 0},      --47级
        {7509302, 8153, 0, 0, 0},      --48级
        {7972024, 9039, 0, 0, 0},      --49级
        {0, 10000, 0, 0, 0},      --50级
    },
    --蓝
    {
        {100, 1, 1, 0, 0},      --1级
        {746, 1, 1, 0, 0},      --2级
        {2419, 1, 1, 0, 0},      --3级
        {5571, 1, 1, 0, 0},      --4级
        {10641, 1, 1, 0, 0},      --5级
        {18056, 3, 1, 0, 0},      --6级
        {28234, 6, 1, 0, 0},      --7级
        {41587, 13, 1, 0, 0},      --8级
        {58519, 24, 1, 0, 0},      --9级
        {79432, 41, 3, 0, 0},      --10级
        {104722, 66, 5, 0, 0},      --11级
        {134780, 102, 7, 0, 0},      --12级
        {169994, 152, 11, 0, 0},      --13级
        {210751, 221, 17, 0, 0},      --14级
        {257433, 312, 24, 0, 0},      --15级
        {310418, 431, 33, 0, 0},      --16级
        {370085, 584, 45, 0, 0},      --17级
        {436807, 777, 60, 0, 0},      --18级
        {510958, 1018, 79, 0, 0},      --19级
        {592907, 1316, 102, 0, 0},      --20级
        {683023, 1680, 130, 0, 0},      --21级
        {781674, 2120, 164, 0, 0},      --22级
        {889223, 2648, 205, 0, 0},      --23级
        {1006033, 3276, 254, 0, 0},      --24级
        {1132468, 4018, 312, 0, 0},      --25级
        {1268886, 4889, 380, 0, 0},      --26级
        {1415646, 5904, 459, 0, 0},      --27级
        {1573107, 7082, 550, 0, 0},      --28级
        {1741623, 8440, 656, 0, 0},      --29级
        {1921549, 10000, 777, 0, 0},      --30级
        {2113240, 10000, 916, 0, 0},      --31级
        {2317047, 10000, 1073, 0, 0},      --32级
        {2533322, 10000, 1252, 0, 0},      --33级
        {2762414, 10000, 1453, 0, 0},      --34级
        {3004673, 10000, 1680, 0, 0},      --35级
        {3260447, 10000, 1934, 0, 0},      --36级
        {3530083, 10000, 2219, 0, 0},      --37级
        {3813927, 10000, 2535, 0, 0},      --38级
        {4112324, 10000, 2887, 0, 0},      --39级
        {4425618, 10000, 3276, 0, 0},      --40级
        {4754153, 10000, 3707, 0, 0},      --41级
        {5098271, 10000, 4182, 0, 0},      --42级
        {5458314, 10000, 4704, 0, 0},      --43级
        {5834622, 10000, 5277, 0, 0},      --44级
        {6227536, 10000, 5904, 0, 0},      --45级
        {6637395, 10000, 6590, 0, 0},      --46级
        {7064538, 10000, 7339, 0, 0},      --47级
        {7509302, 10000, 8153, 0, 0},      --48级
        {7972024, 10000, 9039, 0, 0},      --49级
        {0, 10000, 10000, 0, 0},      --50级
    },
    --紫
    {
        {100, 1, 1, 1, 0},      --1级
        {746, 1, 1, 1, 0},      --2级
        {2419, 1, 1, 1, 0},      --3级
        {5571, 1, 1, 1, 0},      --4级
        {10641, 3, 1, 1, 0},      --5级
        {18056, 7, 1, 1, 0},      --6级
        {28234, 17, 3, 1, 0},      --7级
        {41587, 33, 6, 1, 0},      --8级
        {58519, 60, 11, 1, 0},      --9级
        {79432, 102, 19, 3, 0},      --10级
        {104722, 164, 30, 5, 0},      --11级
        {134780, 254, 47, 7, 0},      --12级
        {169994, 380, 70, 11, 0},      --13级
        {210751, 550, 102, 17, 0},      --14级
        {257433, 777, 144, 24, 0},      --15级
        {310418, 1073, 199, 33, 0},      --16级
        {370085, 1453, 270, 45, 0},      --17级
        {436807, 1934, 359, 60, 0},      --18级
        {510958, 2535, 471, 79, 0},      --19级
        {592907, 3276, 609, 102, 0},      --20级
        {683023, 4182, 777, 130, 0},      --21级
        {781674, 5277, 981, 164, 0},      --22级
        {889223, 6590, 1225, 205, 0},      --23级
        {1006033, 8153, 1516, 254, 0},      --24级
        {1132468, 10000, 1859, 312, 0},      --25级
        {1268886, 10000, 2262, 380, 0},      --26级
        {1415646, 10000, 2731, 459, 0},      --27级
        {1573107, 10000, 3276, 550, 0},      --28级
        {1741623, 10000, 3905, 656, 0},      --29级
        {1921549, 10000, 4626, 777, 0},      --30级
        {2113240, 10000, 5450, 916, 0},      --31级
        {2317047, 10000, 6388, 1073, 0},      --32级
        {2533322, 10000, 7451, 1252, 0},      --33级
        {2762414, 10000, 8650, 1453, 0},      --34级
        {3004673, 10000, 10000, 1680, 0},      --35级
        {3260447, 10000, 10000, 1934, 0},      --36级
        {3530083, 10000, 10000, 2219, 0},      --37级
        {3813927, 10000, 10000, 2535, 0},      --38级
        {4112324, 10000, 10000, 2887, 0},      --39级
        {4425618, 10000, 10000, 3276, 0},      --40级
        {4754153, 10000, 10000, 3707, 0},      --41级
        {5098271, 10000, 10000, 4182, 0},      --42级
        {5458314, 10000, 10000, 4704, 0},      --43级
        {5834622, 10000, 10000, 5277, 0},      --44级
        {6227536, 10000, 10000, 5904, 0},      --45级
        {6637395, 10000, 10000, 6590, 0},      --46级
        {7064538, 10000, 10000, 7339, 0},      --47级
        {7509302, 10000, 10000, 8153, 0},      --48级
        {7972024, 10000, 10000, 9039, 0},      --49级
        {0, 10000, 10000, 10000, 0},      --50级
    },
    --金
    {
        {100, 1, 1, 1, 1},      --1级
        {746, 1, 1, 1, 1},      --2级
        {2419, 1, 1, 1, 1},      --3级
        {5571, 3, 1, 1, 1},      --4级
        {10641, 9, 1, 1, 1},      --5级
        {18056, 24, 3, 1, 1},      --6级
        {28234, 52, 6, 1, 1},      --7级
        {41587, 102, 13, 3, 1},      --8级
        {58519, 184, 24, 5, 1},      --9级
        {79432, 312, 41, 9, 3},      --10级
        {104722, 503, 66, 15, 5},      --11级
        {134780, 777, 102, 24, 7},      --12级
        {169994, 1160, 152, 36, 11},      --13级
        {210751, 1680, 221, 52, 17},      --14级
        {257433, 2373, 312, 74, 24},      --15级
        {310418, 3276, 431, 102, 33},      --16级
        {370085, 4437, 584, 138, 45},      --17级
        {436807, 5904, 777, 184, 60},      --18级
        {510958, 7737, 1018, 241, 79},      --19级
        {592907, 10000, 1316, 312, 102},      --20级
        {683023, 10000, 1680, 398, 130},      --21级
        {781674, 10000, 2120, 503, 164},      --22级
        {889223, 10000, 2648, 628, 205},      --23级
        {1006033, 10000, 3276, 777, 254},      --24级
        {1132468, 10000, 4018, 953, 312},      --25级
        {1268886, 10000, 4889, 1160, 380},      --26级
        {1415646, 10000, 5904, 1401, 459},      --27级
        {1573107, 10000, 7082, 1680, 550},      --28级
        {1741623, 10000, 8440, 2003, 656},      --29级
        {1921549, 10000, 10000, 2373, 777},      --30级
        {2113240, 10000, 10000, 2795, 916},      --31级
        {2317047, 10000, 10000, 3276, 1073},      --32级
        {2533322, 10000, 10000, 3821, 1252},      --33级
        {2762414, 10000, 10000, 4437, 1453},      --34级
        {3004673, 10000, 10000, 5129, 1680},      --35级
        {3260447, 10000, 10000, 5904, 1934},      --36级
        {3530083, 10000, 10000, 6771, 2219},      --37级
        {3813927, 10000, 10000, 7737, 2535},      --38级
        {4112324, 10000, 10000, 8810, 2887},      --39级
        {4425618, 10000, 10000, 10000, 3276},      --40级
        {4754153, 10000, 10000, 10000, 3707},      --41级
        {5098271, 10000, 10000, 10000, 4182},      --42级
        {5458314, 10000, 10000, 10000, 4704},      --43级
        {5834622, 10000, 10000, 10000, 5277},      --44级
        {6227536, 10000, 10000, 10000, 5904},      --45级
        {6637395, 10000, 10000, 10000, 6590},      --46级
        {7064538, 10000, 10000, 10000, 7339},      --47级
        {7509302, 10000, 10000, 10000, 8153},      --48级
        {7972024, 10000, 10000, 10000, 9039},      --49级
        {0, 10000, 10000, 10000, 10000},      --50级
    },
}

--[[
属性成长表
属性索引	属性	    属性值	属性权重
2	        hp上限	    5	    1000
2	        mp上限	    10	    1000
3	        物防上限	2	    100
4	        物防下限	1	    100
5	        魔防上限	2	    100
5	        魔防下限	1	    100
--]]
horse_att_t =
{
    --1
    {
    },

    --  属性	    属性值	属性权重
    --  hp上限	    5	    1000
	--2
    {
        {3, 5, 200},      --hp上限
        {5, 10, 200},      --mp上限
        {6, 2, 10},      --物防上限
        {7, 1, 10},      --物防下限
        {8, 2, 10},      --魔防上限
        {9, 1, 10},      --魔防下限
        {10, 2, 10},      --物攻上限
        {11, 1, 10},      --物攻下限
        {12, 2, 10},      --魔攻上限
        {13, 1, 10},      --魔攻下限
        {14, 2, 10},      --道术上限
        {15, 1, 10},      --道术下限
        {21, 2, 250},      --上限背包负重
        {23, 2, 200},      --上限装备负重
        {25, 2, 150},      --上限腕力
        {3, 2, 3800},      --hp上限
        {5, 5, 3800},      --mp上限
        {6, 1, 190},      --物防上限
        {7, 1, 190},      --物防下限
        {8, 1, 190},      --魔防上限
        {10, 1, 190},      --物攻上限
        {12, 1, 190},      --魔攻上限
        {14, 1, 190},      --道术上限
        {21, 2, 4750},      --上限背包负重
        {23, 1, 3800},      --上限装备负重
        {25, 2, 2850},      --上限腕力
    },
    --3
    {
        {3, 15, 200},      --hp上限
        {5, 20, 200},      --mp上限
        {6, 3, 20},      --物防上限
        {7, 2, 20},      --物防下限
        {8, 3, 20},      --魔防上限
        {9, 2, 20},      --魔防下限
        {10, 3, 20},      --物攻上限
        {11, 2, 20},      --物攻下限
        {12, 3, 20},      --魔攻上限
        {13, 2, 20},      --魔攻下限
        {14, 3, 20},      --道术上限
        {15, 2, 20},      --道术下限
        {21, 5, 300},      --上限背包负重
        {23, 5, 200},      --上限装备负重
        {25, 5, 100},      --上限腕力
        {44, 2, 150},      --hp回复值
        {45, 3, 150},      --mp回复值
        {106, 2, 200},      --hp回复速度百分比
        {107, 3, 200},      --mp回复速度百分比
        {81, 2, 50},      --hp百分比
        {82, 3, 150},      --mp百分比
        {3, 5, 3800},      --hp上限
        {5, 10, 3800},      --mp上限
        {6, 2, 380},      --物防上限
        {7, 1, 380},      --物防下限
        {8, 2, 380},      --魔防上限
        {9, 1, 380},      --魔防下限
        {10, 2, 380},      --物攻上限
        {11, 1, 380},      --物攻下限
        {12, 2, 380},      --魔攻上限
        {13, 1, 380},      --魔攻下限
        {14, 2, 380},      --道术上限
        {15, 1, 380},      --道术下限
        {21, 4, 5700},      --上限背包负重
        {23, 2, 3800},      --上限装备负重
        {25, 4, 1900},      --上限腕力
        {44, 1, 2850},      --hp回复值
        {45, 2, 2850},      --mp回复值
        {106, 1, 3800},      --hp回复速度百分比
        {107, 2, 3800},      --mp回复速度百分比
        {81, 1, 950},      --hp百分比
        {82, 2, 2850},      --mp百分比
    },
    --4
    {
        {3, 25, 200},      --hp上限
        {5, 40, 200},      --mp上限
        {6, 5, 20},      --物防上限
        {7, 3, 20},      --物防下限
        {8, 5, 20},      --魔防上限
        {9, 3, 20},      --魔防下限
        {10, 5, 20},      --物攻上限
        {11, 3, 20},      --物攻下限
        {12, 5, 20},      --魔攻上限
        {13, 3, 20},      --魔攻下限
        {14, 5, 20},      --道术上限
        {15, 3, 20},      --道术下限
        {21, 10, 500},      --上限背包负重
        {23, 10, 400},      --上限装备负重
        {25, 10, 300},      --上限腕力
        {44, 3, 150},      --hp回复值
        {45, 4, 150},      --mp回复值
        {106, 3, 200},      --hp回复速度百分比
        {107, 4, 200},      --mp回复速度百分比
        {81, 3, 50},      --hp百分比
        {82, 4, 150},      --mp百分比
        {83, 2, 20},      --物防上限百分比
        {84, 3, 20},      --物防下限百分比
        {85, 2, 20},      --魔防上限百分比
        {86, 3, 20},      --魔防下限百分比
        {87, 2, 20},      --物攻上限百分比
        {88, 3, 20},      --物攻下限百分比
        {89, 2, 20},      --魔攻上限百分比
        {90, 3, 20},      --魔攻下限百分比
        {91, 2, 20},      --道术上限百分比
        {92, 3, 20},      --道术下限百分比
        {103, 2, 250},      --背包负重百分比
        {104, 2, 200},      --装备负重百分比
        {105, 2, 150},      --腕力百分比
        {3, 10, 3800},      --hp上限
        {5, 20, 3800},      --mp上限
        {6, 4, 380},      --物防上限
        {7, 2, 380},      --物防下限
        {8, 4, 380},      --魔防上限
        {9, 2, 380},      --魔防下限
        {10, 4, 380},      --物攻上限
        {11, 2, 380},      --物攻下限
        {12, 4, 380},      --魔攻上限
        {13, 2, 380},      --魔攻下限
        {14, 4, 380},      --道术上限
        {15, 2, 380},      --道术下限
        {21, 10, 9500},      --上限背包负重
        {23, 5, 7600},      --上限装备负重
        {25, 5, 5700},      --上限腕力
        {44, 2, 2850},      --hp回复值
        {45, 3, 2850},      --mp回复值
        {106, 2, 3800},      --hp回复速度百分比
        {107, 3, 3800},      --mp回复速度百分比
        {81, 2, 950},      --hp百分比
        {82, 3, 2850},      --mp百分比
        {83, 1, 380},      --物防上限百分比
        {84, 2, 380},      --物防下限百分比
        {85, 1, 380},      --魔防上限百分比
        {86, 2, 380},      --魔防下限百分比
        {87, 1, 380},      --物攻上限百分比
        {88, 2, 380},      --物攻下限百分比
        {89, 1, 380},      --魔攻上限百分比
        {90, 2, 380},      --魔攻下限百分比
        {91, 1, 380},      --道术上限百分比
        {92, 2, 380},      --道术下限百分比
        {103, 4, 4750},      --背包负重百分比
        {104, 4, 3800},      --装备负重百分比
        {105, 4, 2850},      --腕力百分比
    },
    --5
    {
        {3, 30, 250},      --hp上限
        {5, 50, 250},      --mp上限
        {6, 8, 20},      --物防上限
        {7, 5, 20},      --物防下限
        {8, 8, 20},      --魔防上限
        {9, 5, 20},      --魔防下限
        {10, 8, 20},      --物攻上限
        {11, 5, 20},      --物攻下限
        {12, 8, 20},      --魔攻上限
        {13, 5, 20},      --魔攻下限
        {14, 8, 20},      --道术上限
        {15, 5, 20},      --道术下限
        {21, 20, 300},      --上限背包负重
        {23, 20, 250},      --上限装备负重
        {25, 20, 200},      --上限腕力
        {44, 12, 50},      --hp回复值
        {45, 12, 100},      --mp回复值
        {106, 8, 50},      --hp回复速度百分比
        {107, 8, 50},      --mp回复速度百分比
        {81, 8, 50},      --hp百分比
        {82, 8, 150},      --mp百分比
        {83, 3, 20},      --物防上限百分比
        {84, 5, 20},      --物防下限百分比
        {85, 3, 20},      --魔防上限百分比
        {86, 5, 20},      --魔防下限百分比
        {87, 3, 20},      --物攻上限百分比
        {88, 5, 20},      --物攻下限百分比
        {89, 3, 20},      --魔攻上限百分比
        {90, 5, 20},      --魔攻下限百分比
        {91, 3, 20},      --道术上限百分比
        {92, 5, 20},      --道术下限百分比
        {103, 5, 125},      --背包负重百分比
        {104, 5, 125},      --装备负重百分比
        {105, 5, 200},      --腕力百分比
        --{18, 5, 100},      --移动速度，基准值
        --{19, 5, 100},      --攻击速度，基准值
        {109, 2, 50},      --移动速度百分比
        {110, 2, 50},      --攻击速度百分比
        {16, 1, 10},      --命中
        {17, 1, 10},      --闪避
        {49, 1, 10},      --暴击率
        {50, 1, 10},      --幸运诅咒
        {117, 5, 50},      --物理伤害反射数值
        {119, 5, 50},      --魔法伤害反射数值
        {121, 5, 50},      --魔法伤害减免数值
        {123, 5, 50},      --物理伤害减免数值
        {3, 15, 4750},      --hp上限
        {5, 25, 4750},      --mp上限
        {6, 5, 380},      --物防上限
        {7, 3, 380},      --物防下限
        {8, 5, 380},      --魔防上限
        {9, 3, 380},      --魔防下限
        {10, 5, 380},      --物攻上限
        {11, 3, 380},      --物攻下限
        {12, 5, 380},      --魔攻上限
        {13, 3, 380},      --魔攻下限
        {14, 5, 380},      --道术上限
        {15, 3, 380},      --道术下限
        {21, 20, 5700},      --上限背包负重
        {23, 10, 4750},      --上限装备负重
        {25, 10, 3800},      --上限腕力
        {44, 10, 950},      --hp回复值
        {45, 10, 1900},      --mp回复值
        {106, 10, 950},      --hp回复速度百分比
        {107, 15, 950},      --mp回复速度百分比
        {81, 10, 950},      --hp百分比
        {82, 15, 2850},      --mp百分比
        {83, 6, 380},      --物防上限百分比
        {84, 6, 380},      --物防下限百分比
        {85, 6, 380},      --魔防上限百分比
        {86, 6, 380},      --魔防下限百分比
        {87, 6, 380},      --物攻上限百分比
        {88, 6, 380},      --物攻下限百分比
        {89, 6, 380},      --魔攻上限百分比
        {90, 6, 380},      --魔攻下限百分比
        {91, 6, 380},      --道术上限百分比
        {92, 6, 380},      --道术下限百分比
        {103, 6, 2375},      --背包负重百分比
        {104, 6, 2375},      --装备负重百分比
        {105, 6, 3800},      --腕力百分比
        --{18, 20, 1900},      --移动速度，基准值
        --{19, 30, 1900},      --攻击速度，基准值
        {109, 5, 950},      --移动速度百分比
        {110, 5, 950},      --攻击速度百分比
        {16, 3, 190},      --命中
        {17, 3, 190},      --闪避
        {49, 2, 190},      --暴击率
        {50, 2, 190},      --幸运诅咒
        {117, 10, 950},      --物理伤害反射数值
        {119, 10, 950},      --魔法伤害反射数值
        {121, 10, 950},      --魔法伤害减免数值
        {123, 10, 950},      --物理伤害减免数值
    },
}

horse_att_t_to =
{
    --1
    {
    },

    --  属性	    属性值	属性权重
    --  hp上限	    5	    1000
	--2
    {
        {3, 5, 200},      --hp上限
        {5, 10, 200},      --mp上限
        {6, 2, 10},      --物防上限
        {7, 1, 10},      --物防下限
        {8, 2, 10},      --魔防上限
        {9, 1, 10},      --魔防下限
        {10, 2, 10},      --物攻上限
        {11, 1, 10},      --物攻下限
        {12, 2, 10},      --魔攻上限
        {13, 1, 10},      --魔攻下限
        {14, 2, 10},      --道术上限
        {15, 1, 10},      --道术下限
        {21, 2, 250},      --上限背包负重
        {23, 2, 200},      --上限装备负重
        {25, 2, 150},      --上限腕力
        {3, 2, 1800},      --hp上限
        {5, 5, 1800},      --mp上限
        {6, 1, 90},      --物防上限
        {7, 1, 90},      --物防下限
        {8, 1, 90},      --魔防上限
        {10, 1, 90},      --物攻上限
        {12, 1, 90},      --魔攻上限
        {14, 1, 90},      --道术上限
        {21, 2, 2250},      --上限背包负重
        {23, 1, 1800},      --上限装备负重
        {25, 2, 1350},      --上限腕力
    },
    --3
    {
        {3, 15, 200},      --hp上限
        {5, 20, 200},      --mp上限
        {6, 3, 20},      --物防上限
        {7, 2, 20},      --物防下限
        {8, 3, 20},      --魔防上限
        {9, 2, 20},      --魔防下限
        {10, 3, 20},      --物攻上限
        {11, 2, 20},      --物攻下限
        {12, 3, 20},      --魔攻上限
        {13, 2, 20},      --魔攻下限
        {14, 3, 20},      --道术上限
        {15, 2, 20},      --道术下限
        {21, 5, 300},      --上限背包负重
        {23, 5, 200},      --上限装备负重
        {25, 5, 100},      --上限腕力
        {44, 2, 150},      --hp回复值
        {45, 3, 150},      --mp回复值
        {106, 2, 200},      --hp回复速度百分比
        {107, 3, 200},      --mp回复速度百分比
        {81, 2, 50},      --hp百分比
        {82, 3, 150},      --mp百分比
        {3, 5, 1800},      --hp上限
        {5, 10, 1800},      --mp上限
        {6, 2, 180},      --物防上限
        {7, 1, 180},      --物防下限
        {8, 2, 180},      --魔防上限
        {9, 1, 180},      --魔防下限
        {10, 2, 180},      --物攻上限
        {11, 1, 180},      --物攻下限
        {12, 2, 180},      --魔攻上限
        {13, 1, 180},      --魔攻下限
        {14, 2, 180},      --道术上限
        {15, 1, 180},      --道术下限
        {21, 4, 2700},      --上限背包负重
        {23, 2, 1800},      --上限装备负重
        {25, 4, 900},      --上限腕力
        {44, 1, 1350},      --hp回复值
        {45, 2, 1350},      --mp回复值
        {106, 1, 1800},      --hp回复速度百分比
        {107, 2, 1800},      --mp回复速度百分比
        {81, 1, 450},      --hp百分比
        {82, 2, 1350},      --mp百分比

    },
    --4
    {
        {3, 25, 200},      --hp上限
        {5, 40, 200},      --mp上限
        {6, 5, 20},      --物防上限
        {7, 3, 20},      --物防下限
        {8, 5, 20},      --魔防上限
        {9, 3, 20},      --魔防下限
        {10, 5, 20},      --物攻上限
        {11, 3, 20},      --物攻下限
        {12, 5, 20},      --魔攻上限
        {13, 3, 20},      --魔攻下限
        {14, 5, 20},      --道术上限
        {15, 3, 20},      --道术下限
        {21, 10, 500},      --上限背包负重
        {23, 10, 400},      --上限装备负重
        {25, 10, 300},      --上限腕力
        {44, 3, 150},      --hp回复值
        {45, 4, 150},      --mp回复值
        {106, 3, 200},      --hp回复速度百分比
        {107, 4, 200},      --mp回复速度百分比
        {81, 3, 50},      --hp百分比
        {82, 4, 150},      --mp百分比
        {83, 2, 20},      --物防上限百分比
        {84, 3, 20},      --物防下限百分比
        {85, 2, 20},      --魔防上限百分比
        {86, 3, 20},      --魔防下限百分比
        {87, 2, 20},      --物攻上限百分比
        {88, 3, 20},      --物攻下限百分比
        {89, 2, 20},      --魔攻上限百分比
        {90, 3, 20},      --魔攻下限百分比
        {91, 2, 20},      --道术上限百分比
        {92, 3, 20},      --道术下限百分比
        {103, 2, 250},      --背包负重百分比
        {104, 2, 200},      --装备负重百分比
        {105, 2, 150},      --腕力百分比
        {3, 10, 1800},      --hp上限
        {5, 20, 1800},      --mp上限
        {6, 4, 180},      --物防上限
        {7, 2, 180},      --物防下限
        {8, 4, 180},      --魔防上限
        {9, 2, 180},      --魔防下限
        {10, 4, 180},      --物攻上限
        {11, 2, 180},      --物攻下限
        {12, 4, 180},      --魔攻上限
        {13, 2, 180},      --魔攻下限
        {14, 4, 180},      --道术上限
        {15, 2, 180},      --道术下限
        {21, 10, 4500},      --上限背包负重
        {23, 5, 3600},      --上限装备负重
        {25, 5, 2700},      --上限腕力
        {44, 2, 1350},      --hp回复值
        {45, 3, 1350},      --mp回复值
        {106, 2, 1800},      --hp回复速度百分比
        {107, 3, 1800},      --mp回复速度百分比
        {81, 2, 450},      --hp百分比
        {82, 3, 1350},      --mp百分比
        {83, 1, 180},      --物防上限百分比
        {84, 2, 180},      --物防下限百分比
        {85, 1, 180},      --魔防上限百分比
        {86, 2, 180},      --魔防下限百分比
        {87, 1, 180},      --物攻上限百分比
        {88, 2, 180},      --物攻下限百分比
        {89, 1, 180},      --魔攻上限百分比
        {90, 2, 180},      --魔攻下限百分比
        {91, 1, 180},      --道术上限百分比
        {92, 2, 180},      --道术下限百分比
        {103, 4, 2250},      --背包负重百分比
        {104, 4, 1800},      --装备负重百分比
        {105, 4, 1350},      --腕力百分比

    },
    --5
    {
        {3, 30, 250},      --hp上限
        {5, 50, 250},      --mp上限
        {6, 8, 20},      --物防上限
        {7, 5, 20},      --物防下限
        {8, 8, 20},      --魔防上限
        {9, 5, 20},      --魔防下限
        {10, 8, 20},      --物攻上限
        {11, 5, 20},      --物攻下限
        {12, 8, 20},      --魔攻上限
        {13, 5, 20},      --魔攻下限
        {14, 8, 20},      --道术上限
        {15, 5, 20},      --道术下限
        {21, 20, 300},      --上限背包负重
        {23, 20, 250},      --上限装备负重
        {25, 20, 200},      --上限腕力
        {44, 12, 50},      --hp回复值
        {45, 12, 100},      --mp回复值
        {106, 8, 50},      --hp回复速度百分比
        {107, 8, 50},      --mp回复速度百分比
        {81, 8, 50},      --hp百分比
        {82, 8, 150},      --mp百分比
        {83, 3, 20},      --物防上限百分比
        {84, 5, 20},      --物防下限百分比
        {85, 3, 20},      --魔防上限百分比
        {86, 5, 20},      --魔防下限百分比
        {87, 3, 20},      --物攻上限百分比
        {88, 5, 20},      --物攻下限百分比
        {89, 3, 20},      --魔攻上限百分比
        {90, 5, 20},      --魔攻下限百分比
        {91, 3, 20},      --道术上限百分比
        {92, 5, 20},      --道术下限百分比
        {103, 5, 125},      --背包负重百分比
        {104, 5, 125},      --装备负重百分比
        {105, 5, 200},      --腕力百分比
        --{18, 5, 100},      --移动速度，基准值
        --{19, 5, 100},      --攻击速度，基准值
        {109, 2, 50},      --移动速度百分比
        {110, 2, 50},      --攻击速度百分比
        {16, 1, 50},      --吸当前hp数值
        {17, 1, 50},      --吸当前mp数值
        {49, 1, 10},      --命中
        {50, 1, 10},      --闪避
        {117, 5, 10},      --暴击率
        {119, 5, 10},      --魔法伤害反射-数值
        {121, 5, 50},      --物理伤害反射数值
        {123, 5, 50},      --魔法伤害反射数值
        {3, 15, 50},      --魔法伤害减免数值
        {5, 25, 50},      --物理伤害减免数值
        {6, 5, 2250},      --hp上限
        {7, 3, 2250},      --mp上限
        {8, 5, 180},      --物防上限
        {9, 3, 180},      --物防下限
        {10, 5, 180},      --魔防上限
        {11, 3, 180},      --魔防下限
        {12, 5, 180},      --物攻上限
        {13, 3, 180},      --物攻下限
        {14, 5, 180},      --魔攻上限
        {15, 3, 180},      --魔攻下限
        {21, 20, 180},      --道术上限
        {23, 10, 180},      --道术下限
        {25, 10, 2700},      --上限背包负重
        {44, 10, 2250},      --上限装备负重
        {45, 10, 1800},      --上限腕力
        {106, 10, 450},      --hp回复值
        {107, 15, 900},      --mp回复值
        {81, 10, 450},      --hp回复速度百分比
        {82, 15, 450},      --mp回复速度百分比
        {83, 6, 450},      --hp百分比
        {84, 6, 1350},      --mp百分比
        {85, 6, 180},      --物防上限百分比
        {86, 6, 180},      --物防下限百分比
        {87, 6, 180},      --魔防上限百分比
        {88, 6, 180},      --魔防下限百分比
        {89, 6, 180},      --物攻上限百分比
        {90, 6, 180},      --物攻下限百分比
        {91, 6, 180},      --魔攻上限百分比
        {92, 6, 180},      --魔攻下限百分比
        {103, 6, 180},      --道术上限百分比
        {104, 6, 180},      --道术下限百分比
        {105, 6, 1125},      --背包负重百分比
        {18, 20, 1125},      --装备负重百分比
        {19, 30, 1800},      --腕力百分比
        --{109, 5, 900},      --移动速度，基准值
        --{110, 5, 900},      --攻击速度，基准值
        {16, 3, 450},      --移动速度百分比
        {17, 3, 450},      --攻击速度百分比
        {49, 2, 450},      --吸当前hp数值
        {50, 2, 450},      --吸当前mp数值
        {117, 10, 90},      --命中
        {119, 2, 90},      --闪避
        {121, 2, 90},      --暴击率
        {123, 10, 90},      --物理伤害减免-数值
    },
}


------------------------------------------------------------------------------
------------------------------ Core ------------------------------------------
-- 给坐骑增加经验
function add_horse_exp(player, item, exp)
    local old_horse_level = get_horse_level(player, item)
    local h_type = get_horse_type(player, item)
    local item_name = lualib:Name(item)
    local old_exp = get_horse_cur_exp(player, item)
    local new_exp = old_exp + exp
    set_horse_cur_exp(player, item, new_exp)
    local level_up_exp = horse_level_up_t[h_type][old_horse_level][1]

    lualib:SysMsg_SendTipsMsg(player, "坐骑["..item_name.."] 获得经验: "..exp)

    process_horse_level_up(player, item)
end

------------------------------------------------------------------------------
------------------------------------------------------------------------------
--经验增加触发
function process_horse_add_exp(player, exp_addtion)
    -- 坐骑位
    local site = 16
    local item = lualib:Item_GetBySite(player, site)
    if item == "" then
        return
    end

    local item_name = lualib:Name(item)

    if lualib:Item_GetDurability(player, item) == 0 then
        lualib:SysMsg_SendWarnMsg(player, item_name.."已经死亡,请先使用[坐骑还魂丹]复活")
        return
    end

    -- 初始化所有变量
    local old_horse_level = get_horse_level(player, item)
    if old_horse_level == 0 then
        set_horse_type(player, item, 1)
        set_horse_level(player, item, 1)
        set_horse_cur_exp(player, item, 0)
        set_horse_max_exp(player, item, horse_level_up_t[1][1][1])
      --  lualib:SysMsg_SendWarnMsg(player, "初始化所有坐骑变量")
    end

    -- 已经升到顶级
	--exp_addtion打怪获得经验
    if old_horse_level >= 50 then
        --lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]已经升到顶级")
		lualib:OnGloryTrigger(player, 1011, "",0,"","")
        return
    end

    local h_type = get_horse_type(player, item)
    if (h_type <= 0) or (h_type >= 6) then
        lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]品级异常")
        return
    end

    local exp = math.floor(exp_addtion / 5)

    -- 增加坐骑经验
    add_horse_exp(player, item, exp)
end

--坐骑升级触发
function process_horse_level_up(player, item)
    local h_type = get_horse_type(player, item)
    local old_horse_level = get_horse_level(player, item)
    local cur_exp = get_horse_cur_exp(player, item)

    local level_up_exp = horse_level_up_t[h_type][old_horse_level][1]
	
	
	local itemKeyName = lualib:KeyName(item)
    -- 属性成长
	local horse_xiyou =
		{
			"梦魇兽", "独角兽", "雪域天狼", "吼天兽", "裂天魔狮", "霸下玄龟", "神兽", "不死鸟", "龙鹰"
		}
	local horseType = 1
	
	for i = 1, #horse_xiyou do
		if horse_xiyou[i] == itemKeyName then
			horseType = 2
			break
		end
	end
	
	
    -- 如果未达到升级经验
    if cur_exp < level_up_exp then
        return
    end

    local item_name = lualib:Name(item)

    local new_horse_level = old_horse_level + 1
    set_horse_level(player, item, new_horse_level)
    lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]升到"..new_horse_level.."级")

    local new_exp = cur_exp - level_up_exp
    set_horse_cur_exp(player, item, new_exp)

    local new_max_exp = horse_level_up_t[h_type][new_horse_level][1]
    set_horse_max_exp(player, item, new_max_exp)

    local must_update = false

    --根据概率生成属性
	if horseType == 2 then
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] == 0 then
				local p_gen_rate = horse_level_up_t[h_type][new_horse_level][i]
				if lualib:GenRandom(1, 10000) <= p_gen_rate then
					local select_lib = horse_att_t_to[i]
					local n = table.getn(select_lib)

					local select_index = lualib:GenRandom(1, n)
					local select_item = select_lib[select_index]

					local p_rate = select_item[3]
					if lualib:GenRandom(1, 10000) <= p_gen_rate then
						local att_name = select_item[1]
						local att_value = select_item[2]
						lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

						local att_display_name = lualib:ToAttrName(att_name)
						lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]抽到第"..i.."条属性["..att_display_name.."], 初始值为"..att_value)

						must_update = true
					end
				end
			end
		end
	else
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] == 0 then
				local p_gen_rate = horse_level_up_t[h_type][new_horse_level][i]
				if lualib:GenRandom(1, 10000) <= p_gen_rate then
					local select_lib = horse_att_t[i]
					local n = table.getn(select_lib)

					local select_index = lualib:GenRandom(1, n)
					local select_item = select_lib[select_index]

					local p_rate = select_item[3]
					if lualib:GenRandom(1, 10000) <= p_gen_rate then
						local att_name = select_item[1]
						local att_value = select_item[2]
						lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

						local att_display_name = lualib:ToAttrName(att_name)
						lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]抽到第"..i.."条属性["..att_display_name.."], 初始值为"..att_value)

						must_update = true
					end
				end
			end
		end
	end

    -- 属性成长映射表
    -- grow_mappings[X][Y]表示属性X在条目Y时，属性X每多少级上升一点
    local grow_mappings =

--[x]={y1,y2,y3,y4,y5}
--x对应Att表内的属性条目，y是此属性在坐骑属性中的条目次序
    {
        [3]={100, 10, 7, 5, 2},      --hp上限
        [5]={100, 10, 7, 5, 2},      --mp上限
        [6]={100, 10, 8, 7, 4},      --物防上限
        [7]={100, 10, 8, 7, 4},      --物防下限
        [8]={100, 10, 8, 7, 4},      --魔防上限
        [9]={100, 10, 8, 7, 4},      --魔防下限
        [10]={100, 10, 8, 7, 4},      --物攻上限
        [11]={100, 10, 8, 7, 4},      --物攻下限
        [12]={100, 10, 8, 7, 4},      --魔攻上限
        [13]={100, 10, 8, 7, 4},      --魔攻下限
        [14]={100, 10, 8, 7, 4},      --道术上限
        [15]={100, 10, 8, 7, 4},      --道术下限
        [21]={100, 10, 7, 5, 2},      --上限背包负重
        [23]={100, 10, 7, 5, 2},      --上限装备负重
        [25]={100, 10, 7, 5, 2},      --上限腕力
        [44]={100, 10, 8, 7, 4},      --hp回复值
        [45]={100, 10, 8, 7, 4},      --mp回复值
        [106]={100, 10, 8, 7, 4},      --hp回复速度百分比
        [107]={100, 10, 8, 7, 4},      --mp回复速度百分比
        [81]={100, 10, 8, 7, 4},      --hp百分比
        [82]={100, 10, 8, 7, 4},      --mp百分比
        [83]={100, 10, 8, 7, 4},      --物防上限百分比
        [84]={100, 10, 8, 7, 4},      --物防下限百分比
        [85]={100, 10, 8, 7, 4},      --魔防上限百分比
        [86]={100, 10, 8, 7, 4},      --魔防下限百分比
        [87]={100, 10, 8, 7, 4},      --物攻上限百分比
        [88]={100, 10, 8, 7, 4},      --物攻下限百分比
        [89]={100, 10, 8, 7, 4},      --魔攻上限百分比
        [90]={100, 10, 8, 7, 4},      --魔攻下限百分比
        [91]={100, 10, 8, 7, 4},      --道术上限百分比
        [92]={100, 10, 8, 7, 4},      --道术下限百分比
        [103]={100, 10, 8, 7, 4},      --背包负重百分比
        [104]={100, 10, 8, 7, 4},      --装备负重百分比
        [105]={100, 10, 8, 7, 4},      --腕力百分比
        [18]={100, 100, 100, 100, 100},      --移动速度，基准值
        [19]={100, 100, 100, 100, 100},      --攻击速度，基准值
        [109]={100, 100, 100, 100, 100},      --移动速度百分比
        [110]={100, 100, 100, 100, 100},      --攻击速度百分比
        [111]={100, 100, 100, 100, 5},      --吸血
        [114]={100, 100, 100, 100, 5},      --吸魔
        [16]={100, 100, 100, 100, 100},      --命中
        [17]={100, 100, 100, 100, 100},      --闪避
        [49]={100, 100, 100, 100, 5},      --暴击率
        [50]={100, 100, 100, 100, 100},      --幸运诅咒
        [117]={100, 100, 100, 100, 5},      --物理伤害反射-数值
        [119]={100, 100, 100, 100, 5},      --魔法伤害反射-数值
        [121]={100, 100, 100, 100, 5},      --魔法伤害减免-数值
        [123]={100, 100, 100, 100, 5},      --物理伤害减免-数值
    }
	
    -- 属性成长映射表
    -- grow_mappings[X][Y]表示属性X在条目Y时，属性X每多少级上升一点
    local grow_mappingsTo =

--[x]={y1,y2,y3,y4,y5}
--x对应Att表内的属性条目，y是此属性在坐骑属性中的条目次序
    {
        [3]={100, 6, 4, 3, 2},      --hp上限
        [5]={100, 6, 4, 3, 2},      --mp上限
        [6]={100, 6, 6, 4, 3},      --物防上限
        [7]={100, 6, 6, 4, 3},      --物防下限
        [8]={100, 6, 6, 4, 3},      --魔防上限
        [9]={100, 6, 6, 4, 3},      --魔防下限
        [10]={100, 6, 6, 4, 3},      --物攻上限
        [11]={100, 6, 6, 4, 3},      --物攻下限
        [12]={100, 6, 6, 4, 3},      --魔攻上限
        [13]={100, 6, 6, 4, 3},      --魔攻下限
        [14]={100, 6, 6, 4, 3},      --道术上限
        [15]={100, 6, 6, 4, 3},      --道术下限
        [21]={100, 6, 4, 3, 2},      --上限背包负重
        [23]={100, 6, 4, 3, 2},      --上限装备负重
        [25]={100, 6, 3, 3, 2},      --上限腕力
        [44]={100, 6, 6, 4, 3},      --hp回复值
        [45]={100, 6, 6, 4, 3},      --mp回复值
        [106]={100, 6, 6, 4, 3},      --hp回复速度百分比
        [107]={100, 6, 6, 4, 3},      --mp回复速度百分比
        [81]={100, 6, 6, 4, 3},      --hp百分比
        [82]={100, 6, 6, 4, 3},      --mp百分比
        [83]={100, 6, 6, 4, 3},      --物防上限百分比
        [84]={100, 6, 6, 4, 3},      --物防下限百分比
        [85]={100, 6, 6, 4, 3},      --魔防上限百分比
        [86]={100, 6, 6, 4, 3},      --魔防下限百分比
        [87]={100, 6, 6, 4, 3},      --物攻上限百分比
        [88]={100, 6, 6, 4, 3},      --物攻下限百分比
        [89]={100, 6, 6, 4, 3},      --魔攻上限百分比
        [90]={100, 6, 6, 4, 3},      --魔攻下限百分比
        [91]={100, 6, 6, 4, 3},      --道术上限百分比
        [92]={100, 6, 6, 4, 3},      --道术下限百分比
        [103]={100, 6, 6, 4, 3},      --背包负重百分比
        [104]={100, 6, 6, 4, 3},      --装备负重百分比
        [105]={100, 6, 6, 4, 3},      --腕力百分比
        [18]={100, 100, 100, 100, 100},      --移动速度，基准值
        [19]={100, 100, 100, 100, 100},      --攻击速度，基准值
        [109]={100, 100, 100, 100, 100},      --移动速度百分比
        [110]={100, 100, 100, 100, 100},      --攻击速度百分比
        [111]={100, 100, 100, 100, 5},      --吸血
        [114]={100, 100, 100, 100, 5},      --吸魔
        [16]={100, 100, 100, 100, 100},      --命中
        [17]={100, 100, 100, 100, 100},      --闪避
        [49]={100, 100, 100, 100, 5},      --暴击率
        [50]={100, 100, 100, 100, 100},      --幸运诅咒
        [117]={100, 100, 100, 100, 5},      --物理伤害反射-数值
        [119]={100, 100, 100, 100, 5},      --魔法伤害反射-数值
        [121]={100, 100, 100, 100, 5},      --魔法伤害减免-数值
        [123]={100, 100, 100, 100, 5},      --物理伤害减免-数值
    }
	
	
	if horseType == 2 then
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] ~= 0 then
				local att_name = p[0]
				if lualib:Mod(new_horse_level, grow_mappingsTo[att_name][i]) == 0 then
					local att_value = p[1] + 1
					lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

					local att_display_name = lualib:ToAttrName(att_name)
					lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]第"..i.."条属性["..att_display_name.."]进化, 当前值为"..att_value)

					must_update = true
				end
			end
		end
	else
		for i=2,5 do
			local ext_index = i - 1
			local p = lualib:Equip_GetExtProp(player, item, ext_index)
			if p[0] ~= 0 then
				local att_name = p[0]
				if lualib:Mod(new_horse_level, grow_mappings[att_name][i]) == 0 then
					local att_value = p[1] + 1
					lualib:Equip_SetExtProp(player, item, ext_index, att_name, att_value)

					local att_display_name = lualib:ToAttrName(att_name)
					lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]第"..i.."条属性["..att_display_name.."]进化, 当前值为"..att_value)

					must_update = true
				end
			end
		end
	end

    -- 通知客户端属性更新
    if must_update then
        lualib:Item_NotifyUpdate(player, item)
    end

    -- 已经升到顶级
    if new_horse_level >= 50 then
        lualib:SysMsg_SendWarnMsg(player, "坐骑["..item_name.."]已经升到顶级")
        return
    end

    -- 如果经验剩余则递归调用
    if new_exp > horse_level_up_t[h_type][new_horse_level][1] then
        process_horse_level_up(player, item)
    end
end
