--【装备初始化数据】
-- 转生装备  【keyname】 = {经验，血符，公会贡献，转生}
local rein_item = 
{ 
	----------  1 武器 ----------------------
	["圣武战刃"] = {{40000000, 0},150000,1},
	["圣魔法杖"] = {{40000000, 0},150000,1},
	["圣灵道剑"] = {{40000000, 0},150000,1},
	["威武战刃"] = {{50000000, 0},432000,2},
	["幻神法杖"] = {{50000000, 0},432000,2},
	["无量道剑"] = {{50000000, 0},432000,2},
	["洪武行天战刃"] = {{0, 0},891000,3},
	["天地玄奇法杖"] = {{0, 0},891000,3},
	["玄天妙法道扇"] = {{0, 0},891000,3},
	["雄武震天战刃"] = {{0, 0},1458000,5},
	["天异玄奥法杖"] = {{0, 0},1458000,5},
	["混天广法道剑"] = {{0, 0},1458000,5},
	["尊武凌天战刃"] = {{0, 0},2592000,7},
	["天魁玄灵法杖"] = {{0, 0},2592000,7},
	["鸿天明法道剑"] = {{0, 0},2592000,7},
	["神威亢天战刃"] = {{0, 0},3888000,9},
	["天暴玄宗法杖"] = {{0, 0},3888000,9},
	["昊天玄尊道剑"] = {{0, 0},3888000,9},
	["至尊傲天战刃"] = {{0, 0},6480000,11},
	["天狂玄傲法杖"] = {{0, 0},6480000,11},
	["傲天元法道剑"] = {{0, 0},6480000,11},
	
	----------- 2 头盔 --------------------
	["圣武头盔"] = {{30000000,0},20000,1},	
	["圣魔头盔"] = {{30000000,0},20000,1},
	["圣灵头盔"] = {{30000000,0},20000,1},	
	["威武头盔"] = {{45000000,0},50000,2},
	["幻神头盔"] = {{45000000,0},50000,2},
	["无量头盔"] = {{45000000,0},50000,2},
	["洪武行天头盔"] = {{0,0},162000,4},
	["天地玄奇头盔"] = {{0,0},162000,4},
	["玄天妙法头盔"] = {{0,0},162000,4},
	["雄武震天头盔"] = {{0,0},324000,6},
	["天异玄奥头盔"] = {{0,0},324000,6},
	["混天广法头盔"] = {{0,0},324000,6},
	["尊武凌天头盔"] = {{0,0},648000,8},
	["天魁玄灵头盔"] = {{0,0},648000,8},
	["鸿天明法头盔"] = {{0,0},648000,8},
	["神威亢天头盔"] = {{0,0},1296000,10},
	["天暴玄宗头盔"] = {{0,0},1296000,10},
	["昊天玄尊头盔"] = {{0,0},1296000,10},
	["至尊傲天头盔"] = {{0,0},2592000,12},
	["天狂玄傲头盔"] = {{0,0},2592000,12},
	["傲天元法头盔"] = {{0,0},2592000,12},
	
	----------- 3 护腕 -------------------
	["圣武手镯"] = {{30000000,0},20000,1},
	["圣魔手镯"] = {{30000000,0},20000,1},
	["圣灵手镯"] = {{30000000,0},20000,1},
	["威武手镯"] = {{45000000,0},50000,2},
	["幻神手镯"] = {{45000000,0},50000,2},
	["无量手镯"] = {{45000000,0},50000,2},
	["洪武行天手镯"] = {{0,0},162000,4},
	["天地玄奇手镯"] = {{0,0},162000,4},
	["玄天妙法手镯"] = {{0,0},162000,4},
	["雄武震天手镯"] = {{0,0},324000,6},
	["天异玄奥手镯"] = {{0,0},324000,6},
	["混天广法手镯"] = {{0,0},324000,6},
	["尊武凌天手镯"] = {{0,0},648000,8},
	["天魁玄灵手镯"] = {{0,0},648000,8},
	["鸿天明法手镯"] = {{0,0},648000,8},
	["神威亢天手镯"] = {{0,0},1296000,10},
	["天暴玄宗手镯"] = {{0,0},1296000,10},
	["昊天玄尊手镯"] = {{0,0},1296000,10},
	["至尊傲天手镯"] = {{0,0},2592000,12},
	["天狂玄傲手镯"] = {{0,0},2592000,12},
	["傲天元法手镯"] = {{0,0},2592000,12},
	
	------------ 4 衣服 --------------------
	["圣武战甲"] = {{35000000,0},75000,1},
	["圣武战袍"] = {{35000000,0},75000,1},
	["圣魔法袍"] = {{35000000,0},75000,1},
	["圣魔羽衣"] = {{35000000,0},75000,1},
	["圣灵道袍"] = {{35000000,0},75000,1},
	["圣灵道衣"] = {{35000000,0},75000,1},
	["威武战甲"] = {{47500000,0},216000,2},
	["威武战袍"] = {{47500000,0},216000,2},
	["幻神法袍"] = {{47500000,0},216000,2},
	["幻神羽衣"] = {{47500000,0},216000,2},
	["无量道袍"] = {{47500000,0},216000,2},
	["无量道衣"] = {{47500000,0},216000,2},
	["洪武行天战甲"] = {{0,0},495000,3},
	["洪武行天战袍"] = {{0,0},495000,3},
	["天地玄奇法袍"] = {{0,0},495000,3},
	["天地玄奇羽衣"] = {{0,0},495000,3},
	["玄天妙法道袍"] = {{0,0},495000,3},
	["玄天妙法道衣"] = {{0,0},495000,3},
	["雄武震天战甲"] = {{0,0},810000,5},
	["雄武震天战袍"] = {{0,0},810000,5},
	["天异玄奥法袍"] = {{0,0},810000,5},
	["天异玄奥羽衣"] = {{0,0},810000,5},
	["混天广法道袍"] = {{0,0},810000,5},
	["混天广法道衣"] = {{0,0},810000,5},
	["尊武凌天战甲"] = {{0,0},1620000,7},
	["尊武凌天战袍"] = {{0,0},1620000,7},
	["天魁玄灵法袍"] = {{0,0},1620000,7},
	["天魁玄灵羽衣"] = {{0,0},1620000,7},
	["鸿天明法道袍"] = {{0,0},1620000,7},
	["鸿天明法道衣"] = {{0,0},1620000,7},
	["神威亢天战甲"] = {{0,0},2430000,9},
	["神威亢天战袍"] = {{0,0},2430000,9},
	["天暴玄宗法袍"] = {{0,0},2430000,9},
	["天暴玄宗羽衣"] = {{0,0},2430000,9},
	["昊天玄尊道袍"] = {{0,0},2430000,9},
	["昊天玄尊道衣"] = {{0,0},2430000,9},
	["至尊傲天战甲"] = {{0,0},4630000,11},
	["至尊傲天战袍"] = {{0,0},4630000,11},
	["天狂玄傲法袍"] = {{0,0},4630000,11},
	["天狂玄傲羽衣"] = {{0,0},4630000,11},
	["傲天元法道袍"] = {{0,0},4630000,11},
	["傲天元法道衣"] = {{0,0},4630000,11},
	
	---------------- 5 符咒 -------------- 
	
	----------- 6 鞋子 -------------------- 
	["圣武靴子"] = {{30000000,0},20000,1},
	["圣魔靴子"] = {{30000000,0},20000,1},
	["圣灵靴子"] = {{30000000,0},20000,1},
	["威武靴子"] = {{45000000,0},50000,2},
	["幻神靴子"] = {{45000000,0},50000,2},
	["无量靴子"] = {{45000000,0},50000,2},
	["洪武行天靴子"] = {{0,0},162000,4},
	["天地玄奇靴子"] = {{0,0},162000,4},
	["玄天妙法靴子"] = {{0,0},162000,4},
	["雄武震天靴子"] = {{0,0},324000,6},
	["天异玄奥靴子"] = {{0,0},324000,6},
	["混天广法靴子"] = {{0,0},324000,6},
	["尊武凌天靴子"] = {{0,0},648000,8},
	["天魁玄灵靴子"] = {{0,0},648000,8},
	["鸿天明法靴子"] = {{0,0},648000,8},
	["神威亢天靴子"] = {{0,0},1296000,10},
	["天暴玄宗靴子"] = {{0,0},1296000,10},
	["昊天玄尊靴子"] = {{0,0},1296000,10},
	["至尊傲天靴子"] = {{0,0},2592000,12},
	["天狂玄傲靴子"] = {{0,0},2592000,12},
	["傲天元法靴子"] = {{0,0},2592000,12},

	----------- 7  腰带 ------------------ 
	["圣武腰带"] = {{30000000,0},20000,1},
	["圣魔腰带"] = {{30000000,0},20000,1},
	["圣灵腰带"] = {{30000000,0},20000,1},
	["威武腰带"] = {{45000000,0},50000,2},
	["幻神腰带"] = {{45000000,0},50000,2},
	["无量腰带"] = {{45000000,0},50000,2},
	["洪武行天腰带"] = {{0,0},162000,4},
	["天地玄奇腰带"] = {{0,0},162000,4},
	["玄天妙法腰带"] = {{0,0},162000,4},
	["雄武震天腰带"] = {{0,0},324000,6},
	["天异玄奥腰带"] = {{0,0},324000,6},
	["混天广法腰带"] = {{0,0},324000,6},
	["尊武凌天腰带"] = {{0,0},648000,8},
	["天魁玄灵腰带"] = {{0,0},648000,8},
	["鸿天明法腰带"] = {{0,0},648000,8},
	["神威亢天腰带"] = {{0,0},1296000,10},
	["天暴玄宗腰带"] = {{0,0},1296000,10},
	["昊天玄尊腰带"] = {{0,0},1296000,10},
	["至尊傲天腰带"] = {{0,0},2592000,12},
	["天狂玄傲腰带"] = {{0,0},2592000,12},
	["傲天元法腰带"] = {{0,0},2592000,12},
	
	----------- 8 项链 -------------------
	["圣武项链"] = {{30000000,0},20000,1},
	["圣魔项链"] = {{30000000,0},20000,1},
	["圣灵项链"] = {{30000000,0},20000,1},
	["威武项链"] = {{45000000,0},50000,2},
	["幻神项链"] = {{45000000,0},50000,2},
	["无量项链"] = {{45000000,0},50000,2},
	["洪武行天项链"] = {{0,0},162000,4},
	["天地玄奇项链"] = {{0,0},162000,4},
	["玄天妙法项链"] = {{0,0},162000,4},
	["雄武震天项链"] = {{0,0},324000,6},
	["天异玄奥项链"] = {{0,0},324000,6},
	["混天广法项链"] = {{0,0},324000,6},
	["尊武凌天项链"] = {{0,0},648000,8},
	["天魁玄灵项链"] = {{0,0},648000,8},
	["鸿天明法项链"] = {{0,0},648000,8},
	["神威亢天项链"] = {{0,0},1296000,10},
	["天暴玄宗项链"] = {{0,0},1296000,10},
	["昊天玄尊项链"] = {{0,0},1296000,10},
	["至尊傲天项链"] = {{0,0},2592000,12},
	["天狂玄傲项链"] = {{0,0},2592000,12},
	["傲天元法项链"] = {{0,0},2592000,12},
	
	------------- 9戒指------------------
	["圣武戒指"] = {{30000000,0},20000,1},
	["圣魔戒指"] = {{30000000,0},20000,1},
	["圣灵戒指"] = {{30000000,0},20000,1},
	["威武戒指"] = {{45000000,0},50000,2},
	["幻神戒指"] = {{45000000,0},50000,2},
	["无量戒指"] = {{45000000,0},50000,2},
	["洪武行天戒指"] = {{0,0},162000,4},
	["天地玄奇戒指"] = {{0,0},162000,4},
	["玄天妙法戒指"] = {{0,0},162000,4},
	["雄武震天戒指"] = {{0,0},324000,6},
	["天异玄奥戒指"] = {{0,0},324000,6},
	["混天广法戒指"] = {{0,0},324000,6},
	["尊武凌天戒指"] = {{0,0},648000,8},
	["天魁玄灵戒指"] = {{0,0},648000,8},
	["鸿天明法戒指"] = {{0,0},648000,8},
	["神威亢天戒指"] = {{0,0},1296000,10},
	["天暴玄宗戒指"] = {{0,0},1296000,10},
	["昊天玄尊戒指"] = {{0,0},1296000,10},
	["至尊傲天戒指"] = {{0,0},2592000,12},
	["天狂玄傲戒指"] = {{0,0},2592000,12},
	["傲天元法戒指"] = {{0,0},2592000,12},
	------------- 18 手套------------------
	["霸业吊坠"] = {{0,0},0,0},
	
	
}

-- 其他装备 【装备子类型】= {经验，血符，公会贡献，转生}
local qt_item = 
{
	 [1] = {
				[1] = {{1000,0},0,0},
				[5] = {{5000,0},0,0},
				[10] = {{10000,0},0,0},
				[18] = {{10000,0},0,0},
				[20] = {{10000,0},0,0},
				[35] = {{30000,0},0,0},
				[36] = {{30000,0},0,0},
				[40] = {{60000,0},0,0},
				[42] = {{60000,0},0,0},
				[45] = {{60000,0},0,0},
				[55] = {{100000,75},0,0},
				[64] = {{1800000,100},2000,0},
				[75] = {{5500000,300},8000,0},
				[82] = {{18000000,900},50000,0},
				[100] = {{0,0},0,0},
	 },
	[4] = {
				[1] = {{1000,0},0,0},
				[2] = {{5000,0},0,0},
				[17] = {{10000,0},0,0},
				[32] = {{30000,0},0,0},
				[42] = {{60000,0},0,0},
				[52] = {{100000,75},0,0},
				[62] = {{170000,100},800,0},
				[72] = {{5000000,300},4000,0},
				[80] = {{16000000,900},25000,0},
				[100] = {{0,0},0,0},
	 },
	[2] = {
			    [3] = {{5000,0},0,0},
			    [18] = {{10000,0},0,0},
		        [33] = {{30000,0},0,0},
			    [43] = {{60000,0},0,0},
			    [53] = {{100000,0},0,0},
				[63] = {{1500000,0},500,0},
				[73] = {{4500000,0},1500,0},
			    [82] = {{15000000,0},6000,0},
	},
	[3] = {
			    [4] = {{5000,0},0,0},
			    [19] = {{10000,0},0,0},
			    [34] = {{30000,0},0,0},
			    [44] = {{60000,0},0,0},
			    [54] = {{100000,0},0,0},
			    [64] = {{1500000,0},500,0},
			    [74] = {{4500000,0},1500,0},
			    [81] = {{15000000,0},6000,0},
	},
	[6] = {
				[2] = {{5000,0},0,0},
			    [17] = {{10000,0},0,0},
			    [32] = {{30000,0},0,0},
			    [42] = {{60000,0},0,0},
			    [52] = {{100000,0},0,0},
			    [62] = {{1500000,0},500,0},
			    [72] = {{4500000,0},1500,0},
			    [80] = {{15000000,0},6000,0},
	},
	[7] = {
			    [32] = {{30000,0},0,0},
			    [42] = {{60000,0},0,0},
			    [52] = {{100000,0},0,0},
			    [62] = {{1500000,0},500,0},
			    [72] = {{4500000,0},1500,0},
			    [80] = {{15000000,0},6000,0},
	},
	[8] = {
				[5] = {{5000,0},0,0},
			    [20] = {{10000,0},0,0},
			    [35] = {{30000,0},0,0},
			    [45] = {{60000,0},0,0},
			    [55] = {{100000,0},0,0},
			    [65] = {{1500000,0},500,0},
			    [75] = {{4500000,0},1500,0},
			    [82] = {{15000000,0},6000,0},
	},
	[9] = {
				[6] = {{5000,0},0,0},
			    [21] = {{10000,0},0,0},
			    [36] = {{30000,0},0,0},
			    [46] = {{60000,0},0,0},
			    [56] = {{100000,0},0,0},
			    [66] = {{1500000,0},500,0},
			    [76] = {{4500000,0},1500,0},
			    [81] = {{15000000,0},6000,0},
	},
}

--魂珠暴击伤害初始化
local hunzhu_burstharm = 
{
	["太初魂珠"] = 180,
	["两仪魂珠"] = 360,
	["三才魂珠"] = 653,
	["四象魂珠"] = 947,
	["五行魂珠"] = 1376,
	["六合魂珠"] = 1806,
	["七星魂珠"] = 2357,
	["八卦魂珠"] = 2909,
	["九宫魂珠"] = 3576,
	["十方魂珠"] = 4243,
	["圣·太初魂珠"] = 5001,
	["圣·两仪魂珠"] = 5760,
	["圣·三才魂珠"] = 6632,
	["圣·四象魂珠"] = 7504,
	["圣·五行魂珠"] = 8528,
	["圣·六合魂珠"] = 9552,
	["圣·七星魂珠"] = 11970,
	["圣·八卦魂珠"] = 14849,
	["圣·九宫魂珠"] = 18290,
	["圣·十方魂珠"] = 22408,
	["圣·至尊魂珠"] = 28047,
	["霸业吊坠"] = 750,
	}

function on_create_item(item)
	if lualib:GUIDType(item) ~= 4 then
		return --item 非装备
	end	
	local item_type = lualib:Item_GetType("", item)
	local subtype = lualib:Item_GetSubType("", item)
	local itemlevel = lualib:Item_GetLevel(item)
	if item_type == 0 or subtype == 0 or itemlevel == 0 then
		return "获取装备数据失败"
	end
	--魂珠暴击伤害初始化
	--[[
	if item_type == 1  and (subtype == 13 or subtype == 18) then
		local item_keyname = lualib:KeyName(item)     --取得道具的keyname
		if item_keyname ~= "" and hunzhu_burstharm[item_keyname] then 
			lualib:SetInt(item,"burstharm",hunzhu_burstharm[item_keyname])
		end
	end
	--]]
	local item_keyname = lualib:KeyName(item)     --取得道具的keyname
	if item_keyname ~= "" and hunzhu_burstharm[item_keyname] then 
		lualib:SetInt(item,"burstharm",hunzhu_burstharm[item_keyname])
	end
	--装备供宝石镶嵌的孔的初始化，1为未解封，2为已解封，没孔默认不设标记
	if item_type == 1  and subtype ~= 5 and subtype ~= 12 then
		if subtype == 10 or subtype == 11 or subtype == 15 or subtype == 13 then
			for i = 1 , 2 do 
				lualib:SetStr(item, "EquipHole" .. i, "2")
			end
			for i = 3 , 4 do 
				lualib:SetStr(item, "EquipHole" .. i, "1")
			end
		else
			if itemlevel >= 60 then
				for i = 1 , 2 do 
					lualib:SetStr(item, "EquipHole" .. i, "2")
				end
				if itemlevel >= 80 then
					for i = 3 , 4 do 
						lualib:SetStr(item, "EquipHole" .. i, "1")
					end
				end
			end
		end
	end
	
	--装备初始化数据  可强化次数，可注灵次数，经验，血符，公会贡献，转生
	local qh_num = 0
	local zl_num = 0
	if item_type == 1  and subtype ~= 5 and subtype ~= 12 then
		if subtype == 10 or subtype == 11 or subtype == 15 or subtype == 13 then
			qh_num = 12 
		else	
			if itemlevel >= 80 then 
				qh_num = 12 
			end	
			if itemlevel < 80 and itemlevel >= 60 then 
				qh_num = 10 
			end	
			if itemlevel < 60 and itemlevel >= 30 then 
				qh_num = 8 
			end
		end	
		if qh_num ~= 0 then 
			lualib:SetInt(item,"xing_n",qh_num)
			lualib:SetInt(item,"xing_num",qh_num)
		end
		if subtype == 15 or subtype == 11 or subtype == 10 or subtype == 13 then
			zl_num = 12	
		else
			if itemlevel >= 80 then
				zl_num = 12	
			end
			if itemlevel < 80 and itemlevel >= 60 then
				zl_num = 10 	
			end		
		end
		if zl_num ~= 0 then    --可注灵次数初始化
			lualib:SetInt(item,"zhul_num",zl_num) 
			--lualib:SetInt(item,"EquipHol2", 2)
		end	
		local keyname = lualib:KeyName(item)      
		local huishou_jy = 0
		local huishou_xf = 0
		local item_contri = 0
		local item_rein = 0 
		if rein_item[keyname] == nil and qt_item[subtype] == nil then return "" end 
		if rein_item[keyname] == nil and qt_item[subtype][itemlevel] == nil then return "" end 
		if rein_item[keyname] then
			huishou_jy = rein_item[keyname][1][1]
			huishou_xf = rein_item[keyname][1][2]
			item_contri = rein_item[keyname][2]
			item_rein = rein_item[keyname][3]
			lualib:SetInt(item,"huishou_jy",huishou_jy)
			lualib:SetInt(item,"huishou_xf",huishou_xf)
			if not lualib:Item_IsBind("", item) then
				lualib:SetInt(item,"item_contri",item_contri)
			end
			lualib:SetInt(item,"item_rein",item_rein)
			return ""
		else 
			if qt_item[subtype] then
				if qt_item[subtype][itemlevel] then
					huishou_jy = qt_item[subtype][itemlevel][1][1]
					huishou_xf = qt_item[subtype][itemlevel][1][2]
					item_contri = qt_item[subtype][itemlevel][2]
					item_rein = qt_item[subtype][itemlevel][3]
					lualib:SetInt(item,"huishou_jy",huishou_jy)
					lualib:SetInt(item,"huishou_xf",huishou_xf)
					if not lualib:Item_IsBind("", item) then
						lualib:SetInt(item,"item_contri",item_contri)
					end
					lualib:SetInt(item,"item_rein",item_rein)
					return ""
				end
			end
		end
	end
	
end