--[[
type = 1:
data:父窗口 X坐标 Y坐标 宽度 高度 美女图片 是否点穿 箭头方向(0无1↑2↓3←4→) 延时关闭(秒) 内容
type = 2:
data:MagicID X坐标 Y坐标 播放速度 播放时间

条件:     名称               值                类型
        接取任务            任务id             状态
        接取任务事件        任务id             事件
        完成任务            任务id             状态
        完成任务事件        任务id             事件
        激活任务            任务id             状态
        激活任务事件        任务id             事件
        放弃任务事件        任务id             事件
        追踪点击事件        点击文字           事件
        打开引导            引导名称           状态
        打开引导事件        引导名称           事件
        关闭引导事件        引导名称           事件
        打开NPC事件         NPC索引名          事件
        打开面板事件        lay文件名          事件
        点击NPC文字事件     链接文字           事件
        点击控件事件        控件字符串标识     事件
		学习技能事件        无                 事件
]]
--ENBEG--
local LLW = 64
local LLH = 32

--新手引导开关
GuideSwitch = true

Guide = 
{
	["新手上线"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -255, 35, 140, 40, 1904100071, true, 4, 0, "点击#COLORCOLOR_GREENG#[邻家妹妹]#COLOREND#，自动寻找 NPC",
			},
			delay = 100,
			flag = 1,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 1},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "引导提交任务"},
			},
			{
				{"追踪点击事件", "邻家妹妹"},
			},
			{
				{"完成任务事件", 1},
			},
			{
				{"放弃任务事件", 1},
			},
			{
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--完成条件
			{
				{"完成任务", 1},
			},
		},
	},
	["引导提交任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			pre_script = "GuideFunc.rectify_open(\"NpcTalk\", 200, 180);",
			delay = 100,
			flag = 2,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 1},
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 1},
			},
			{
				{"打开引导事件", "引导提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 1},
			},
		},
	},
	["引导提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			pre_script = "GuideFunc.rectify_open(\"TaskOperationDlg\", 320, 20);",
			delay = 100,
			flag = 3,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 1},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 1},
			},
		},
		{--完成条件
			{
				{"完成任务", 1},
			},
		},
	},
	["任务1-2点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 227 * LLW + 40, 320 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 4,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 1},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "邻家妹妹"},
			},
			{
				{"接取任务事件", 2},
			},
		},
		{--完成条件
			{
				{"接取任务", 2},
			},
		},
	},
	["任务2接受任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 5,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 1},
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 2},
			},
			{
				{"打开引导事件", "引导提交任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 2},
			},
		},
	},
	["引导接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 6,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 1},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 2},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 2},
			},
		},
	},
	["引导超链接传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "   包裹中有#COLORCOLOR_SKYBLUE#[逍遥游]#COLOREND#\n点击#COLORCOLOR_GOLD#[传送]#COLOREND#快速传送到怪物身边",
			},
			delay = 100,
			flag = 7,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 2},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 2},
			},
			{
				{"追踪点击事件", "新手村"},
			},
			{
				{"放弃任务事件", 2},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 2},
			},
			{
				{"完成任务事件", 2},
			},
		},
	},
	["引导超链接传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "      任务完成\n点击#COLORCOLOR_GREENG#[传送]#COLOREND#回到NPC身边",
			},
			delay = 100,
			flag = 8,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 2},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 2},
			},
			{
				{"追踪点击事件", "邻家妹妹"},
			},
			{
				{"放弃任务事件", 2},
			},
			{
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 2},
			},
		},
	},
	["任务2提交任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 9,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 2},
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 2},
			},
			{
				{"打开引导事件", "任务2提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 2},
			},
		},
	},
	["任务2提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 10,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 2},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 2},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 2},
			},
		},
	},
	["任务2-3点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 227 * LLW + 40, 320 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 11,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 2},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "邻家妹妹"},
			},
			{
				{"接取任务事件", 3},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 3},
			},
		},
	},
	["任务3接受任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 12,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 2},
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 3},
			},
			{
				{"打开引导事件", "任务3接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 3},
			},
		},
	},
	["任务3接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 13,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 2},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 3},
			},
			{
				{"打开引导事件", "任务3传送"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 3},
			},
		},
	},
	["任务3传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 14,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 3},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 3},
			},
			{
				{"追踪点击事件", "新手村药材商左"},
			},
			{
				{"放弃任务事件", 3},
			},
			{
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 3},
			},
		},
	},
	["任务3提交任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 15,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 3},
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 3},
			},
			{
				{"打开引导事件", "任务3提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 3},
			},
		},
	},
	["任务3提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 16,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 3},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 3},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 3},
			},
		},
	},
	["任务3-4点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 207 * LLW + 40, 309 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 17,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 3},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村药材商左"},
			},
			{
				{"接取任务事件", 4},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 4},
			},
		},
	},
	["任务4接受任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 18,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 3},
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 4},
			},
			{
				{"打开引导事件", "任务4接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 4},
			},
		},
	},
	["任务4接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 19,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 3},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 4},
			},
			{
				{"打开引导事件", "引导玩家点击NPC"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 4},
			},
		},
	},
	["引导玩家点击NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 207 * LLW + 40, 309 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 20,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 4},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村药材商左"},
			},
			{
				{"激活任务事件", 4},
			},
			{
				{"放弃任务事件", 4},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 4},
			},
			{
				{"完成任务事件", 4},
			},
		},
	},
	["引导玩家点[购买]"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 140, 155, 100, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[购买]#COLOREND#",
			},
			pre_script = "GuideFunc.rectify_open(\"NpcTalk\", 200, 180);",
			delay = 100,
			flag = 21,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 4},
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 4},
			},
			{
				{"打开引导事件", "任务4关闭药店窗口"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 4},
			},
			{
				{"完成任务事件", 4},
			},
		},
	},
	["任务4关闭药店窗口"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", 192, 95, 136, 60, 1904100071, true, 1, 0, "药店可买各种#COLORCOLOR_SKYBLUE#[补给品]#COLOREND#\n帮助自己在攻击怪物时能够生存下来\n点击这里#COLORCOLOR_SKYBLUE#[关闭]#COLOREND#药店",
			},
			pre_script = "GuideFunc.rectify_open(\"NpcShop\", 320, 150);",
			delay = 100,
			flag = 22,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 4},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 4},
			},
			{
				{"关闭引导事件", "任务4传送"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 4},
			},
			{
				{"打开引导事件", "任务4关闭药店窗口"},
			},
		},
	},
	["任务4传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 23,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 4},
				{"关闭引导事件", "任务4关闭药店窗口"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 4},
			},
			{
				{"追踪点击事件", "新手村药材商左"},
			},
			{
				{"放弃任务事件", 4},
			},
			{
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 4},
			},
		},
	},
	["任务4提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 300, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 24,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 4},
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 4},
			},
			{
				{"打开引导事件", "任务4提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 4},
			},
		},
	},
	["任务4提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 25,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 4},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 4},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 4},
			},
		},
	},
	["任务4-5点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 207 * LLW + 40, 309 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 26,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 4},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村药材商左"},
			},
			{
				{"接取任务事件", 5},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 5},
			},
		},
	},
	["任务5接受任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 27,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 4},
				{"打开NPC事件", "新手村药材商左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 5},
			},
			{
				{"打开引导事件", "任务5接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 5},
			},
		},
	},
	["任务5接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 28,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 4},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 5},
			},
			{
				{"打开引导事件", "任务5传送"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 5},
			},
		},
	},
	["任务5传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -225, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 29,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 5},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 5},
			},
			{
				{"追踪点击事件", "新手村铁匠左"},
			},
			{
				{"放弃任务事件", 5},
			},
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 5},
			},
		},
	},
	["任务5提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 300, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 30,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 5},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 5},
			},
			{
				{"打开引导事件", "任务5提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 5},
			},
		},
	},
	["任务5提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 31,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 5},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 5},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 5},
			},
		},
	},
	["任务5-6点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 199 * LLW + 40, 326 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 32,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 5},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
			{
				{"接取任务事件", 6},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 6},
			},
		},
	},
	["任务6接受任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 33,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 5},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 6},
			},
			{
				{"打开引导事件", "任务6接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 6},
			},
		},
	},
	["任务6接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 34,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 5},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 6},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 6},
			},
		},
	},
	["任务6传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 35,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 6},
			},
		},
		{--关闭条件
			{
				{"追踪点击事件", "新手村"},
			},
			{
				{"激活任务事件", 6},
			},
			{
				{"放弃任务事件", 6},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 6},
			},
			{
				{"完成任务事件", 6},
			},
		},
	},
	["任务6传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -225, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 36,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 6},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 6},
			},
			{
				{"追踪点击事件", "新手村铁匠左"},
			},
			{
				{"放弃任务事件", 6},
			},
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 6},
			},
		},
	},
	["任务6提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 37,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 6},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 6},
			},
			{
				{"打开引导事件", "任务6提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 6},
			},
		},
	},
	["任务6提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 38,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 6},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 6},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 6},
			},
		},
	},
	["任务6-7点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 199 * LLW + 40, 326 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 39,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 6},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
			{
				{"接取任务事件", 7},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 7},
			},
		},
	},
		["任务7接受任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 40,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 6},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 7},
			},
			{
				{"打开引导事件", "任务7接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 7},
			},
		},
	},
	["任务7接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 41,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 6},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 7},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 7},
			},
		},
	},
	["任务7点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 199 * LLW + 40, 326 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 42,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 7},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
			{
				{"激活任务事件", 7},
			},
			{
				{"放弃任务事件", 7},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 7},
			},
		},
	},
	["任务7点购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 140, 160, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[购买]#COLOREND#",
			},
			delay = 100,
			flag = 43,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 7},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[购买]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 7},
			},
		},
	},
	["任务7点武器"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", -235, 66, 100, 60, 1904100071, true, 4, 0, "\n    点击选中\n   #COLORCOLOR_SKYBLUE#长刀[任务]#COLOREND#",
			},
			delay = 100,
			flag = 44,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 7},
				{"打开面板事件", "NpcShop"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 7},
			},
			{
				{"点击控件事件", "NpcShop,Image0"},
			},
			{
				{"点击控件事件", "NpcShop,Item0"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 7},
			},
		},
	},
	["任务7点绑定金币购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", 9, 475, 100, 60, 1904100071, true, 1, 0, "\n 该物品可以使用\n #COLORCOLOR_GOLD#[绑定金币购买]#COLOREND#",
			},
			delay = 100,
			flag = 45,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 7},
				{"关闭引导事件", "任务7点武器"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 7},
			},
			{
				{"打开引导事件", "任务7确定购买"},
			},
			{
				{"点击控件事件", "NpcShop,BindGoldBuy"},
			},
			{
				{"打开面板事件", "GameMallBulkBuy"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 7},
			},
		},
	},
	["任务7确定购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShopBulkBuy", -26, 302, 100, 60, 1904100071, true, 1, 0, "\n\n  #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[购买]#COLOREND#",
			},
			delay = 100,
			flag = 46,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 7},
				{"关闭引导事件", "任务7点绑定金币购买"},
			},
			{
				{"接取任务", 7},
				{"点击控件事件", "NpcShop,BindGoldBuy"},
			},
			{
				{"接取任务", 7},
				{"打开面板事件", "GameMallBulkBuy"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 7},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 7},
			},
		},
	},
	["任务7关闭武器店"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", 192, 95, 136, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[关闭]#COLOREND#武器店",
			},
			delay = 100,
			flag = 47,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 7},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务7传送"},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "任务7关闭武器店"},
			},
			{
				{"完成任务事件", 7},
			},
		},
	},
	["任务7传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 48,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 7},
				{"关闭引导事件", "任务7关闭武器店"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 7},
			},
			{
				{"追踪点击事件", "新手村铁匠左"},
			},
			{
				{"放弃任务事件", 7},
			},
			{
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 7},
			},
		},
	},
	["任务7提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 49,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 7},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 7},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 7},
			},
		},
	},
	["任务7-8点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 199 * LLW + 40, 326 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 50,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 7},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
			{
				{"接取任务事件", 8},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 8},
			},
		},
	},
	["任务8接受任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 51,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 7},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 8},
			},
			{
				{"打开引导事件", "任务8接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 8},
			},
		},
	},
	["任务8接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 52,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 7},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 8},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 8},
			},
		},
	},
	["任务8传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -280, 63, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 53,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 8},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 8},
			},
			{
				{"追踪点击事件", "新手村"},
			},
			{
				{"放弃任务事件", 8},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 8},
			},
		},
	},
	["任务8传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -225, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 54,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 8},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 8},
			},
			{
				{"追踪点击事件", "新手村铁匠左"},
			},
			{
				{"放弃任务事件", 8},
			},
			{
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 8},
			},
		},
	},
	["任务8提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 55,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 8},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 8},
			},
			{
				{"打开引导事件", "任务8提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 8},
			},
		},
	},
	["任务8提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 56,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 8},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 8},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 8},
			},
		},
	},
	--[[["任务8完成打开包裹"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,GameMainBar,Pakage", -85, -130, 136, 60, 1904100071, true, 2, 0, "\n打开#COLORCOLOR_GOLD#[包裹]#COLOREND#\n学习[技能]",
			},
			delay = 100,
			flag = 57,
			init = "",
		},
		{--触发条件
			{
				{"完成任务事件", 8},
			},
		},
		{--关闭条件
			{
				{"打开面板事件", "Package"},
			},
			{
				{"打开引导事件", "任务8完成学习技能"},
			},
			{
				{"接取任务", 10},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "任务8完成打开包裹"},
			},
			{
				{"打开引导事件", "任务8完成学习技能"},
			},
			{
				{"接取任务", 10},
			},
		},
	},
	["任务8完成学习技能"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -100, 90, 136, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#右键点击#COLORCOLOR_GOLD#[学习技能]#COLOREND#",
			},
			delay = 100,
			flag = 58,
			init = "GuideFunc.PkgRectifyPosForSkill",
		},
		{--触发条件
			{
				{"完成任务", 8},
				--{"打开面板事件", "Package"},
				{"关闭引导事件", "任务8完成打开包裹"},
			},
		},
		{--关闭条件
		},
		{--完成条件
			{
				{"打开引导事件", "任务8完成学习技能"},
			},
			{
				{"打开引导事件", "任务8查看技能"},
			},
		},
	},]]
	["任务8查看技能"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface", -280, -15, 136, 60, 1904100071, true, 4, 0, "\n\n #OFFSET<X:0,Y:-8>#点击打开#COLORCOLOR_GOLD#[技能栏]#COLOREND#",
			},
			delay = 100,
			flag = 59,
			init = "GuideFunc.MainBarRectifyPosForSkill",
		},
		{--触发条件
			{
				{"学习技能事件"},
			},
		},
		{--关闭条件
			{
				{"打开面板事件", "RoleSkill"},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "任务8查看技能"},
			},
		},
	},
	["引导玩家设置技能快捷"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"RoleSkill,HotKey0", 93, -23, 136, 60, 1904100071, true, 3, 0, "\n\n #OFFSET<X:0,Y:-8>#点击设置技能#COLORCOLOR_GOLD#[快捷键]#COLOREND#",
			},
			delay = 100,
			flag = 60,
			init = "",
		},
		{--触发条件
			{
				{"打开引导", "任务8查看技能"},
				{"打开面板事件", "RoleSkill"},
			},
		},
		{--关闭条件
			{
				{"点击控件事件", "RoleSkill,HotKey0"},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "引导玩家设置技能快捷"},
			},
		},
	},
	["引导玩家设置技能快捷2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"RoleSkill,SkillHotKey,Key0", -100, 87, 136, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#设置技能快捷键为#COLORCOLOR_GOLD#[F1]#COLOREND#",
			},
			delay = 100,
			flag = 61,
			init = "",
		},
		{--触发条件
			{
				{"打开引导", "引导玩家设置技能快捷"},
				{"打开面板事件", "SkillHotKey"},
			},
		},
		{--关闭条件
			{
				{"点击控件事件", "SkillHotKey,Key0"},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "引导玩家设置技能快捷2"},
			},
		},
	},
	["引导玩家设置技能快捷3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,SkillBar,Skill0", -101, 88, 136, 60, 1904100071, true, 1, 15, "\n #COLORCOLOR_SKYBLUE#也可将技能拖入这里设置快捷键#COLOREND#",
			},
			delay = 100,
			flag = 62,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "引导玩家设置技能快捷2"},
			},
		},
		{--关闭条件
		},
		{--完成条件
			{
				{"打开引导事件", "引导玩家设置技能快捷3"},
			},
		},
	},
	["任务9提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 63,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 9},
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 9},
			},
			{
				{"打开引导事件", "任务9提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 9},
			},
		},
	},
	["任务9提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 64,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 9},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 9},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 9},
			},
		},
	},
	["任务9-10点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 217 * LLW + 40, 280 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 65,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 9},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村仓库管理员左"},
			},
			{
				{"接取任务事件", 10},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 10},
			},
		},
	},
	["任务10接受任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 66,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 9},
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 10},
			},
			{
				{"打开引导事件", "任务10接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 10},
			},
		},
	},
	["任务10接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 67,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 9},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 10},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 10},
			},
		},
	},
	["任务10点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 217 * LLW + 40, 280 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 68,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 10},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村仓库管理员左"},
			},
			{
				{"激活任务事件", 10},
			},
			{
				{"放弃任务事件", 10},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 10},
			},
		},
	},
	["任务10点打开仓库"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 153, 135, 100, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[打开仓库]#COLOREND#",
			},
			delay = 100,
			flag = 69,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 10},
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[打开仓库]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 10},
			},
		},
	},
	["任务10点关闭仓库"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"WareHouse", 283, -127, 100, 60, 1904100071, true, 2, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[关闭仓库]#COLOREND#",
			},
			pre_script = "UI:Lua_OpenGameFormDlg(\"包裹\", 450, 300); GuideFunc.rectify_open(\"WareHouse\", 50, 300);",
			delay = 100,
			flag = 70,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 10},
			},
		},
		{--关闭条件
		},
		{--完成条件
			{
				{"打开引导事件", "任务10点关闭仓库"},
			},
		},
	},
	["任务10传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -185, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			pre_script = "UI:Lua_CloseGameFormDlg(\"包裹\")",
			delay = 100,
			flag = 71,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 10},
				{"关闭引导事件", "任务10点关闭仓库"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 10},
			},
			{
				{"追踪点击事件", "新手村仓库管理员左"},
			},
			{
				{"放弃任务事件", 10},
			},
			{
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 10},
			},
		},
	},
	["任务10提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 72,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 10},
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 10},
			},
			{
				{"打开引导事件", "任务10提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 10},
			},
		},
	},
	["任务10提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 73,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 10},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 10},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 10},
			},
		},
	},
	["任务10-11点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 217 * LLW + 40, 280 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 74,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 10},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村仓库管理员左"},
			},
			{
				{"接取任务事件", 11},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 11},
			},
		},
	},
	["任务11接受任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 75,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 10},
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 11},
			},
			{
				{"打开引导事件", "任务11接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 11},
			},
		},
	},
	["任务11接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 76,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 10},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 11},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 11},
			},
		},
	},
	["任务11传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -225, 35, 140, 40, 1904100071, false, 4, 0, "\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GREENG#[传送]#COLOREND#可以帮助自己节约游戏时间",
			},
			delay = 100,
			flag = 77,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 11},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 11},
			},
			{
				{"追踪点击事件", "新手村车夫"},
			},
			{
				{"放弃任务事件", 11},
			},
			{
				{"打开NPC事件", "新手村车夫"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 11},
			},
		},
	},
	["任务11提交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 78,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 11},
				{"打开NPC事件", "邻家妹妹"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 11},
			},
			{
				{"打开引导事件", "新手村车夫"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 11},
			},
		},
	},
	["任务11提交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#提交任务#COLOREND#",
			},
			delay = 100,
			flag = 79,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 11},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 11},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 11},
			},
		},
	},
	["任务11-12点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 73 * LLW + 40, 83 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 80,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 11},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "新手村车夫"},
			},
			{
				{"接取任务事件", 12},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 12},
			},
		},
	},
	["任务12接受任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 81,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 11},
				{"打开NPC事件", "新手村车夫"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 12},
			},
			{
				{"打开引导事件", "任务12接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 12},
			},
		},
	},
	["任务12接受任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#接受任务#COLOREND#",
			},
			delay = 100,
			flag = 82,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 11},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 12},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 12},
			},
		},
	},
	["任务12传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -282, 51, 140, 40, 1904100071, false, 4, 0, "\n\n #OFFSET<X:0,Y:-13>#路途较远，#COLORCOLOR_GREENG#[传送]#COLOREND#过去",
			},
			delay = 100,
			flag = 83,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 12},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 12},
			},
			{
				{"追踪点击事件", "巫山城老兵"},
			},
			{
				{"放弃任务事件", 12},
			},
			{
				{"打开NPC事件", "巫山城老兵"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 12},
			},
		},
	},
	["任务12交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 84,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 12},
				{"打开NPC事件", "巫山城老兵"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 12},
			},
			{
				{"打开引导事件", "任务12交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 12},
			},
		},
	},
	["任务12交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 85,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 12},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 12},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 12},
			},
		},
	},
	["任务12-13点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 237 * LLW + 40, 304 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 86,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 12},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "巫山城老兵"},
			},
			{
				{"接取任务事件", 13},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 13},
			},
		},
	},
	["任务13接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 87,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 12},
				{"打开NPC事件", "巫山城老兵"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 13},
			},
			{
				{"打开引导事件", "任务13接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 13},
			},
		},
	},
	["任务13接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 88,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 12},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 13},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 13},
			},
		},
	},
	["任务13传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 89,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 13},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 13},
			},
			{
				{"追踪点击事件", "神之翼"},
			},
			{
				{"放弃任务事件", 13},
			},
			{
				{"打开NPC事件", "神之翼"},
			},
		},
		{--完成条件
			{
				{"完成任务", 13},
			},
		},
	},
	["任务13交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 90,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 13},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 13},
			},
			{
				{"打开引导事件", "任务13交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 13},
			},
		},
	},
	["任务13交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 91,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 13},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 13},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 13},
			},
		},
	},
	["任务13-14点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 304 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 92,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 13},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "神之翼"},
			},
			{
				{"接取任务事件", 14},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 14},
			},
		},
	},
	["任务14接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 93,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 13},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 14},
			},
			{
				{"打开引导事件", "任务14接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 14},
			},
		},
	},
	["任务14接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 94,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 13},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 14},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 14},
			},
		},
	},
	["任务14传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -190, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 95,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 14},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 14},
			},
			{
				{"追踪点击事件", "巫山城"},
			},
			{
				{"放弃任务事件", 14},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 14},
			},
		},
	},
	["任务14传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 96,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 14},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 14},
			},
			{
				{"追踪点击事件", "神之翼"},
			},
			{
				{"放弃任务事件", 14},
			},
			{
				{"打开NPC事件", "神之翼"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 14},
			},
		},
	},
	["任务14交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 97,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 14},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 14},
			},
			{
				{"打开引导事件", "任务14交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 14},
			},
		},
	},
	["任务14交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 98,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 14},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 14},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 14},
			},
		},
	},
	["任务15接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 99,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 14},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 15},
			},
			{
				{"打开引导事件", "任务15接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 15},
			},
		},
	},
	["任务15接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 100,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 14},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 15},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 15},
			},
		},
	},
	["任务15点击NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 304 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 101,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 15},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "神之翼"},
			},
			{
				{"激活任务事件", 15},
			},
			{
				{"放弃任务事件", 15},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 15},
			},
		},
	},
	["任务15点击翅膀升阶"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 177, 233, 100, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[翅膀升阶]#COLOREND#",
			},
			delay = 100,
			flag = 102,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 15},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[翅膀升阶]"},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "任务15点击翅膀升阶"},
			},
		},
	},
	["任务15关闭翅膀升阶面板"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"翅膀升级", 476, 88, 100, 60, 1904100071, true, 1, 0, " \n拥有#COLORCOLOR_SKYBLUE#[神羽]#COLOREND#，可以让翅膀升阶\n关闭翅膀升阶面板",
			},
			delay = 100,
			flag = 103,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "任务15点确认升阶"},
			},
		},
		{--关闭条件
		},
		{--完成条件
			{
				{"打开引导事件", "任务15关闭翅膀升阶面板"},
			},
		},
	},
	["任务15点NPC交任务"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 304 * LLH - 50, 0, 0,
			},
			pre_script = "UI:Lua_CloseGameFormDlg(\"包裹\")",
			delay = 100,
			flag = 104,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 15},
				{"关闭引导事件", "任务15关闭翅膀升阶面板"},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "神之翼"},
			},
			{
				{"完成任务事件", 15},
			},
			{
				{"放弃任务事件", 15},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 15},
			},
		},
	},
	["任务15交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 105,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 15},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 15},
			},
			{
				{"打开引导事件", "任务15交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 15},
			},
		},
	},
	["任务15交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 106,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 15},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 15},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 15},
			},
		},
	},
	["任务16接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 107,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 15},
				{"打开NPC事件", "神之翼"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 16},
			},
			{
				{"打开引导事件", "神之翼"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 16},
			},
		},
	},
	["任务16接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 108,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 15},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 16},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 16},
			},
		},
	},
	["任务16传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -190, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 109,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 16},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 16},
			},
			{
				{"追踪点击事件", "师徒管理员"},
			},
			{
				{"放弃任务事件", 16},
			},
			{
				{"打开NPC事件", "师徒管理员"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 16},
			},
		},
	},
	["任务16交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 110,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 16},
				{"打开NPC事件", "师徒管理员"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 16},
			},
			{
				{"打开引导事件", "任务16交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 16},
			},
		},
	},
	["任务16交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 111,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 16},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 16},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 16},
			},
		},
	},
	["任务17接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 112,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 16},
				{"打开NPC事件", "师徒管理员"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 17},
			},
			{
				{"打开引导事件", "师徒管理员"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 17},
			},
		},
	},
	["任务17接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 113,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 16},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 17},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 17},
			},
		},
	},
	["任务17点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 244 * LLW + 40, 317 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 114,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 17},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "师徒管理员"},
			},
			{
				{"激活任务事件", 17},
			},
			{
				{"放弃任务事件", 17},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 17},
			},
		},
	},
	["任务17点了解拜师"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 268, 196, 100, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[了解拜师]#COLOREND#",
			},
			delay = 100,
			flag = 115,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 17},
				{"打开NPC事件", "师徒管理员"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "「了解拜师」"},
			},
			{
				{"激活任务事件", 17},
			},
			{
				{"打开引导事件", "任务17交任务1"},
			},
			{
				{"打开引导事件", "任务17交任务2"},
			},
			{
				{"打开引导事件", "任务17交任务3"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 17},
			},
			{
				{"点击NPC文字事件", "「了解拜师」"},
			},
		},
	},
	["任务17交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 116,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 17},
				{"打开NPC事件", "师徒管理员"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 17},
			},
			{
				{"打开引导事件", "任务17交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 17},
			},
		},
	},
	["任务17交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 117,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 17},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 17},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 17},
			},
		},
	},
	["任务18接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 118,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 17},
				{"打开NPC事件", "师徒管理员"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 18},
			},
			{
				{"打开引导事件", "任务18接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 18},
			},
		},
	},
	["任务18接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 119,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 17},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 18},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 18},
			},
		},
	},
	["任务18传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 120,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 18},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 18},
			},
			{
				{"追踪点击事件", "毒蛇谷杂货商"},
			},
			{
				{"放弃任务事件", 18},
			},
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 18},
			},
		},
	},
	["任务18交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 121,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 18},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 18},
			},
			{
				{"打开引导事件", "任务18交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 18},
			},
		},
	},
	["任务18交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 122,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 18},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 18},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 18},
			},
		},
	},
	["任务19接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 123,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 18},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 19},
			},
			{
				{"打开引导事件", "任务19接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 19},
			},
		},
	},
	["任务19接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 124,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 18},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 19},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 19},
			},
		},
	},
	["任务19点击NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 160 * LLW + 40, 229 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 125,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 19},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
			{
				{"激活任务事件", 19},
			},
			{
				{"放弃任务事件", 19},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 19},
			},
		},
	},
	["任务19[购买]"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 136, 129, 100, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[购买]#COLOREND#",
			},
			delay = 100,
			flag = 126,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 19},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[购买]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 19},
			},
		},
	},
	["任务19点随机传送卷轴"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", -235, 244, 100, 60, 1904100071, true, 4, 0, "\n     点击\n#COLORCOLOR_SKYBLUE#[随机传送卷轴]#COLOREND#",
			},
			delay = 100,
			flag = 127,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 19},
				{"打开面板事件", "NpcShop"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 19},
			},
			{
				{"点击控件事件", "NpcShop,Image6"},
			},
			{
				{"点击控件事件", "NpcShop,Item6"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 19},
			},
		},
	},
	["任务19点金币购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", 125, 475, 100, 60, 1904100071, true, 1, 0, "\n 该物品可以使用\n   #COLORCOLOR_GOLD#[金币购买]#COLOREND#",
			},
			delay = 100,
			flag = 128,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "任务19点随机传送卷轴"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 19},
			},
			{
				{"打开引导事件", "任务19点确定购买"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 19},
			},
		},
	},
	["任务19点确定购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShopBulkBuy", -26, 302, 100, 60, 1904100071, true, 1, 0, "\n\n  #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[购买]#COLOREND#",
			},
			delay = 100,
			flag = 129,
			init = "",
		},
		{--触发条件
			{
				{"打开引导", "任务19点金币购买"},
				{"点击控件事件", "NpcShop,GoldBuy"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 19},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 19},
			},
		},
	},
	["任务19传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 130,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "任务19关闭杂货店窗口"},
				{"激活任务", 19},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 19},
			},
			{
				{"追踪点击事件", "毒蛇谷杂货商"},
			},
			{
				{"放弃任务事件", 19},
			},
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 19},
			},
		},
	},
	["任务19交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 131,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 19},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 19},
			},
			{
				{"打开引导事件", "任务19交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 19},
			},
		},
	},
	["任务19交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 132,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 19},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 19},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 19},
			},
		},
	},
	["任务20接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 133,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 19},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 20},
			},
			{
				{"打开引导事件", "任务20接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 20},
			},
		},
	},
	["任务20接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 134,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 19},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 20},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 20},
			},
		},
	},
	["任务20传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -195, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 135,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 20},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 20},
			},
			{
				{"追踪点击事件", "毒蛇谷"},
			},
			{
				{"放弃任务事件", 20},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 20},
			},
		},
	},
	["任务20传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 136,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 20},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 20},
			},
			{
				{"追踪点击事件", "毒蛇谷杂货商"},
			},
			{
				{"放弃任务事件", 20},
			},
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 20},
			},
		},
	},
	["任务20交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 137,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 20},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 20},
			},
			{
				{"打开引导事件", "任务20交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 20},
			},
		},
	},
	["任务20交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 138,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 20},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 20},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 20},
			},
		},
	},
	["任务21接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 139,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 20},
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 21},
			},
			{
				{"打开引导事件", "任务21接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 21},
			},
		},
	},
	["任务21接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 140,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 20},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 21},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 21},
			},
		},
	},
	["任务21传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 141,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 21},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 21},
			},
			{
				{"追踪点击事件", "装备大师"},
			},
			{
				{"放弃任务事件", 21},
			},
			{
				{"打开NPC事件", "装备大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 21},
			},
		},
	},
	["任务21交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 142,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 21},
				{"打开NPC事件", "装备大师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 21},
			},
			{
				{"打开引导事件", "任务21交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 21},
			},
		},
	},
	["任务21交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 143,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 21},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 21},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 21},
			},
		},
	},
	["任务22接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 144,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 21},
				{"打开NPC事件", "装备大师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 22},
			},
			{
				{"打开引导事件", "任务22接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 22},
			},
		},
	},
	["任务22接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 145,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 21},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 22},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 22},
			},
		},
	},
	["任务22点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 232 * LLW + 40, 290 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 146,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 22},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备大师"},
			},
			{
				{"激活任务事件", 22},
			},
			{
				{"放弃任务事件", 22},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 22},
			},
		},
	},
	["引导玩家点装备精炼"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 230, 147, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[装备精炼]#COLOREND#",
			},
			delay = 100,
			flag = 147,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 22},
				{"打开NPC事件", "装备大师"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "装备精炼"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 22},
			},
		},
	},
	["引导玩家进行精炼"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -100, 90, 136, 60, 1904100071, true, 1, 0, "\n    右键点击\n  放入#COLORCOLOR_SKYBLUE#[新手护腕]#COLOREND#",
			},
			delay = 100,
			flag = 148,
			pre_script = "UI:Lua_OpenGameFormDlg(\"包裹\", 560, 300); GuideFunc.rectify_open(\"装备精炼2\", 0, 300);",
			param = "新手护腕6",
			init = "GuideFunc.Refine1",
		},
		{--触发条件
			{
				{"接取任务", 22},
				{"点击NPC文字事件", "装备精炼"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 22},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 22},
			},
		},
	},
	["引导玩家进行精炼2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -100, 90, 136, 60, 1904100071, true, 1, 0, "\n    右键点击\n  放入#COLORCOLOR_SKYBLUE#[灵元珠]#COLOREND#",
			},
			delay = 100,
			flag = 149,
			param = "灵元珠",
			init = "GuideFunc.PkgRectifyPos",
		},
		{--触发条件
		},
		{--关闭条件
			{
				{"激活任务事件", 22},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 22},
			},
		},
	},
	["引导玩家进行精炼3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"装备精炼2", 189, 248, 136, 60, 1904100071, true, 3, 0, "\n\n#OFFSET<X:0,Y:-8>#选择需要精炼的#COLORCOLOR_SKYBLUE#[属性]#COLOREND#",
			},
			delay = 100,
			flag = 150,
			init = "",
		},
		{--触发条件
		},
		{--关闭条件
			{
				{"激活任务事件", 22},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 22},
			},
		},
	},
	["引导玩家进行精炼4"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"装备精炼2", 101, 398, 136, 60, 1904100071, true, 1, 0, "\n\n    #OFFSET<X:0,Y:-8>#点击进行#COLORCOLOR_SKYBLUE#[精炼]#COLOREND#",
			},
			delay = 100,
			flag = 151,
			init = "",
		},
		{--触发条件
		},
		{--关闭条件
			{
				{"激活任务事件", 22},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 22},
			},
		},
	},
	["引导玩家关闭面板4"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"装备精炼2", 438, -121, 100, 60, 1904100071, true, 2, 0, "#OFFSET<X:0,Y:8>##COLORCOLOR_SKYBLUE#[精炼等级]#COLOREND#越高 装备属性也越高\n 关闭精炼面板",
			},
			delay = 100,
			flag = 152,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 22},
			},
		},
		{--关闭条件
		},
		{--完成条件
			{
				{"打开引导事件", "引导玩家关闭面板4"},
			},
		},
	},
	["任务22传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			pre_script = "UI:Lua_CloseGameFormDlg(\"包裹\")",
			delay = 100,
			flag = 153,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 22},
				{"关闭引导事件", "引导玩家关闭面板4"},
			},
			{
				{"激活任务", 22},
				{"关闭引导事件", "任务22关闭包裹"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 22},
			},
			{
				{"追踪点击事件", "装备大师"},
			},
			{
				{"放弃任务事件", 22},
			},
			{
				{"打开NPC事件", "装备大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 22},
			},
		},
	},
	["任务22交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 154,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 22},
				{"打开NPC事件", "装备大师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 22},
			},
			{
				{"打开引导事件", "任务22交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 22},
			},
		},
	},
	["任务22交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 155,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 22},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 22},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 22},
			},
		},
	},
	["任务23接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 156,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 22},
				{"打开NPC事件", "装备大师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 23},
			},
			{
				{"打开引导事件", "任务23接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 23},
			},
		},
	},
	["任务23接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 157,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 22},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 23},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 23},
			},
		},
	},
	["任务23传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 158,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 23},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 23},
			},
			{
				{"追踪点击事件", "巫山城书商"},
			},
			{
				{"放弃任务事件", 23},
			},
			{
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 23},
			},
		},
	},
	["任务23交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 159,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 23},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 23},
			},
			{
				{"打开引导事件", "任务23交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 23},
			},
		},
	},
	["任务23交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 160,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 23},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 23},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 23},
			},
		},
	},
	["任务24接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 161,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 23},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 24},
			},
			{
				{"打开引导事件", "任务24接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 24},
			},
		},
	},
	["任务24接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 162,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 23},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 24},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 24},
			},
		},
	},
	["任务24传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 163,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 24},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 24},
			},
			{
				{"追踪点击事件", "废弃矿洞1"},
			},
			{
				{"放弃任务事件", 24},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 24},
			},
		},
	},
	["任务24传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 164,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 24},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 24},
			},
			{
				{"追踪点击事件", "巫山城书商"},
			},
			{
				{"放弃任务事件", 24},
			},
			{
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 24},
			},
		},
	},
	["任务24交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 165,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 24},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 24},
			},
			{
				{"打开引导事件", "任务24交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 24},
			},
		},
	},
	["任务24交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 166,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 24},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 24},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 24},
			},
		},
	},
	["任务25接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 167,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 24},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 25},
			},
			{
				{"打开引导事件", "任务25接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 25},
			},
		},
	},
	["任务25接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 168,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 24},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 25},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 25},
			},
		},
	},
	["任务25传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 169,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 25},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 25},
			},
			{
				{"追踪点击事件", "巫山城驯兽师"},
			},
			{
				{"放弃任务事件", 25},
			},
			{
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 25},
			},
		},
	},
	["任务25交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 170,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 25},
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 25},
			},
			{
				{"打开引导事件", "任务25交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 25},
			},
		},
	},
	["任务25交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 171,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 25},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 25},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 25},
			},
		},
	},
	["任务26接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 172,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 25},
				{"打开NPC事件", "驯兽师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 26},
			},
			{
				{"打开引导事件", "任务26接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 26},
			},
		},
	},
	["任务26接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 173,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 25},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 26},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 26},
			},
		},
	},
	["任务26传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -230, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 174,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 26},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 26},
			},
			{
				{"追踪点击事件", "巫山城"},
			},
			{
				{"放弃任务事件", 26},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 26},
			},
		},
	},
	["任务26传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 175,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 26},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 26},
			},
			{
				{"追踪点击事件", "巫山城驯兽师"},
			},
			{
				{"放弃任务事件", 26},
			},
			{
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 26},
			},
		},
	},
	["任务26交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 176,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 26},
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 26},
			},
			{
				{"打开引导事件", "任务26交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 26},
			},
		},
	},
	["任务26交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 177,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 26},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 26},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 26},
			},
		},
	},
	["任务27接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 178,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 26},
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 27},
			},
			{
				{"打开引导事件", "任务27接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 27},
			},
		},
	},
	["任务27接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 179,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 26},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 27},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 27},
			},
		},
	},
	["任务27点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 237 * LLW + 40, 316 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 180,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 27},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "巫山城驯兽师"},
			},
			{
				{"激活任务事件", 27},
			},
			{
				{"放弃任务事件", 27},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 27},
			},
		},
	},
	["任务27点坐骑升阶"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 171, 147, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[坐骑升阶]#COLOREND#",
			},
			delay = 100,
			flag = 181,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 27},
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[坐骑升阶]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 27},
			},
		},
	},
	["任务27传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -210, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 182,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 27},
				{"关闭引导事件", "任务27关闭坐骑升阶窗口"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 27},
			},
			{
				{"追踪点击事件", "巫山城驯兽师"},
			},
			{
				{"放弃任务事件", 27},
			},
			{
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 27},
			},
		},
	},
	["任务27交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 183,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 27},
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 27},
			},
			{
				{"打开引导事件", "任务27交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 27},
			},
		},
	},
	["任务27交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 184,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 27},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 27},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 27},
			},
		},
	},
	["任务28接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 185,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 27},
				{"打开NPC事件", "巫山城驯兽师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 28},
			},
			{
				{"打开引导事件", "任务28接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 28},
			},
		},
	},
	["任务28接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 186,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 27},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 28},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 28},
			},
		},
	},
	["任务28传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -230, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 187,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 28},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 28},
			},
			{
				{"追踪点击事件", "巫山城书商"},
			},
			{
				{"放弃任务事件", 28},
			},
			{
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 28},
			},
		},
	},
	["任务28交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 188,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 28},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 28},
			},
			{
				{"打开引导事件", "任务28交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 28},
			},
		},
	},
	["任务28交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 189,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 28},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 28},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 28},
			},
		},
	},
	["任务29接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 190,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 28},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 29},
			},
			{
				{"打开引导事件", "任务29接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 29},
			},
		},
	},
	["任务29接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 191,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 28},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 29},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 29},
			},
		},
	},
	["任务29传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 192,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 29},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 29},
			},
			{
				{"追踪点击事件", "废弃矿洞2"},
			},
			{
				{"放弃任务事件", 29},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 29},
			},
		},
	},
	["任务29传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -220, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 193,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 29},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 29},
			},
			{
				{"追踪点击事件", "巫山城书商"},
			},
			{
				{"放弃任务事件", 29},
			},
			{
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 29},
			},
		},
	},
	["任务29交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 194,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 29},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 29},
			},
			{
				{"打开引导事件", "任务29交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 29},
			},
		},
	},
	["任务29交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 195,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 29},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 29},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 29},
			},
		},
	},
	["任务30接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 196,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 29},
				{"打开NPC事件", "巫山城书商"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 30},
			},
			{
				{"打开引导事件", "任务30接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 30},
			},
		},
	},
	["任务30接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 197,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 29},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 30},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 30},
			},
		},
	},
	["任务30传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 198,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 30},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 30},
			},
			{
				{"追踪点击事件", "天机老人"},
			},
			{
				{"放弃任务事件", 30},
			},
			{
				{"打开NPC事件", "天机老人"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 30},
			},
		},
	},
	["任务30交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 199,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 30},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 30},
			},
			{
				{"打开引导事件", "任务30交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 30},
			},
		},
	},
	["任务30交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 200,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 30},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 30},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 30},
			},
		},
	},
	["任务31接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 201,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 30},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 31},
			},
			{
				{"打开引导事件", "任务31接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 31},
			},
		},
	},
	["任务31接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 202,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 30},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 31},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 31},
			},
		},
	},
	["任务31传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -185, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 203,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 31},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 31},
			},
			{
				{"追踪点击事件", "南门军需官"},
			},
			{
				{"放弃任务事件", 31},
			},
			{
				{"打开NPC事件", "南门军需官"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 31},
			},
		},
	},
	["任务31交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 204,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 31},
				{"打开NPC事件", "南门军需官"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 31},
			},
			{
				{"打开引导事件", "任务31交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 31},
			},
		},
	},
	["任务31交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 205,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 31},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 31},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 31},
			},
		},
	},
	["任务32接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 206,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 31},
				{"打开NPC事件", "南门军需官"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 32},
			},
			{
				{"打开引导事件", "任务32接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 32},
			},
		},
	},
	["任务32接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 207,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 31},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 32},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 32},
			},
		},
	},
	["任务32点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 177 * LLW + 40, 257 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 208,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 32},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "南门军需官"},
			},
			{
				{"激活任务事件", 32},
			},
			{
				{"放弃任务事件", 32},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 32},
			},
		},
	},
	["任务32点保护美女"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", -15, 175, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[保护美女]#COLOREND#",
			},
			delay = 100,
			flag = 209,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 32},
				{"打开NPC事件", "南门军需官"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[保护美女]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 32},
			},
			{
				{"点击NPC文字事件", "[保护美女]"},
			},
		},
	},
	["任务32点完成保护美女1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 73, 161, 100, 60, 1904100071, true, 1, 0, "\n     点击\n#COLORCOLOR_GOLD#[完成保护美女]#COLOREND#",
			},
			delay = 100,
			flag = 210,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 32},
				{"接取任务", 3001},
				{"关闭引导事件", "任务32自动跑路"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "「完成保护美女」"},
			},
		},
		{--完成条件
			{
				{"点击NPC文字事件", "「完成保护美女」"},
			},
		},
	},	
	["任务32完成保护美女2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", -30, 161, 100, 60, 1904100071, true, 1, 0, "\n\n  #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[领取]#COLOREND#",
			},
			delay = 100,
			flag = 211,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 32},
				{"接取任务", 3001},
				{"点击NPC文字事件", "「完成保护美女」"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", " 「领取」"},
			},
			{
				{"激活任务事件", 32},
			},
		},
		{--完成条件
			{
				{"点击NPC文字事件", " 「领取」"},
			},
			{
				{"激活任务事件", 32},
			},
		},
	},
	["任务32交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 212,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 32},
				{"打开NPC事件", "北门军需官"},
			},
			{
				{"激活任务", 32},
				{"关闭引导事件", "任务32完成保护美女2"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 32},
			},
			{
				{"打开引导事件", "任务32交任务2"},
			},
			{
				{"打开引导事件", "任务32完成保护美女1"},
			},
			{
				{"打开引导事件", "任务32完成保护美女2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 32},
			},
		},
	},
	["任务32交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 213,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 32},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 32},
			},
			{
				{"打开引导事件", "任务32完成保护美女1"},
			},
			{
				{"打开引导事件", "任务32完成保护美女2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 32},
			},
		},
	},
	["任务33接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 214,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 32},
				{"打开NPC事件", "北门军需官"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 33},
			},
			{
				{"打开引导事件", "任务33接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 33},
			},
		},
	},
	["任务33接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 215,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 32},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 33},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 33},
			},
		},
	},
	["任务33传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 216,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 33},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 33},
			},
			{
				{"追踪点击事件", "天机老人"},
			},
			{
				{"放弃任务事件", 33},
			},
			{
				{"打开NPC事件", "天机老人"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 33},
			},
		},
	},
	["任务33交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 217,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 33},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 33},
			},
			{
				{"打开引导事件", "任务33交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 33},
			},
		},
	},
	["任务33交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 218,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 33},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 33},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 33},
			},
		},
	},
	["任务34接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 219,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 33},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 34},
			},
			{
				{"打开引导事件", "任务34接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 34},
			},
		},
	},
	["任务34接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 220,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 33},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 34},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 34},
			},
		},
	},
	["任务34点击领取经验悬赏"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 170, 145, 100, 60, 1904100071, true, 1, 0, "\n   点击领取\n  #COLORCOLOR_GOLD#[经验悬赏]#COLOREND#",
			},
			delay = 100,
			flag = 221,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "领取[经验悬赏]"},
			},
			{
				{"打开引导事件", "任务34经验悬赏点任务"},
			},
		},
		{--完成条件
			{
				{"点击NPC文字事件", "领取[经验悬赏]"},
			},
			{
				{"打开引导事件", "任务34经验悬赏点任务"},
			},
		},
	},
	["任务34交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 222,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 34},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 34},
			},
			{
				{"打开引导事件", "任务34交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 34},
			},
		},
	},
	["任务34交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 223,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 34},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 34},
			},
		},
	},
	["任务35接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 224,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 34},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 35},
			},
			{
				{"打开引导事件", "任务35接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 35},
			},
		},
	},
	["任务35接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 225,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 34},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 35},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 35},
			},
		},
	},
	["任务35传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 226,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 35},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 35},
			},
			{
				{"追踪点击事件", "荣耀装备兑换官"},
			},
			{
				{"放弃任务事件", 35},
			},
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 35},
			},
		},
	},
	["任务35交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 227,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 35},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 35},
			},
			{
				{"打开引导事件", "任务35交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 35},
			},
		},
	},
	["任务35交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 228,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 35},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 35},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 35},
			},
		},
	},
	["任务36接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 229,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 35},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 36},
			},
			{
				{"打开引导事件", "任务36接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 36},
			},
		},
	},
	["任务36接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 230,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 35},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 36},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 36},
			},
		},
	},
	["任务36点击购买荣耀道具"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 380, 185, 100, 60, 1904100071, true, 1, 0, "\n     点击\n#COLORCOLOR_GOLD#[购买荣耀道具]#COLOREND#",
			},
			delay = 100,
			flag = 231,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 36},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[购买荣耀道具]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 36},
			},
		},
	},
	["任务36点击逍遥游道具"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"荣耀道具兑换", -235, 80, 100, 60, 1904100071, true, 4, 0, "\n    点击\n  #COLORCOLOR_SKYBLUE#[逍遥游]#COLOREND#",
			},
			pre_script = "GuideFunc.rectify_open(\"荣耀道具兑换\", 300, 160);",
			delay = 100,
			flag = 232,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 36},
				{"打开面板事件", "荣耀道具兑换"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 36},
			},
			{
				{"点击控件事件", "荣耀道具兑换,Image1"},
			},
			{
				{"点击控件事件", "荣耀道具兑换,Item1"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 36},
			},
		},
	},
	["任务36点击购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"荣耀道具兑换", 32, 440, 100, 60, 1904100071, true, 1, 0, "\n这里的道具只能用\n  #COLORCOLOR_SKYBLUE#[荣耀值]#COLOREND#购买",
			},
			delay = 100,
			flag = 233,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 36},
				{"关闭引导事件", "任务36点击逍遥游道具"},
			},
		},
		{--关闭条件
			{
				{"打开面板事件", "MessageBox"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 36},
			},
		},
	},
	["任务36点击购买2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"MessageBox", 182, 200, 100, 60, 1904100071, true, 1, 0, "\n\n  确认#COLORCOLOR_SKYBLUE#[购买]#COLOREND#",
			},
			delay = 100,
			flag = 234,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 36},
				{"关闭引导事件", "任务36点击购买"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 36},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 36},
			},
		},
	},
	["任务36传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 235,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "任务36关闭荣耀道具购买"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 36},
			},
			{
				{"追踪点击事件", "荣耀装备兑换官"},
			},
			{
				{"放弃任务事件", 36},
			},
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 36},
			},
		},
	},
	["任务36交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 236,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 36},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 36},
			},
			{
				{"打开引导事件", "任务36交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 36},
			},
		},
	},
	["任务36交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 237,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 36},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 36},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 36},
			},
		},
	},
	["任务37接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 238,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 36},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 37},
			},
			{
				{"打开引导事件", "任务37接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 37},
			},
		},
	},
	["任务37接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 239,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 37},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 37},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 37},
			},
		},
	},
	["任务37传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 240,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 37},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 37},
			},
			{
				{"追踪点击事件", "废弃矿洞5"},
			},
			{
				{"放弃任务事件", 37},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 37},
			},
		},
	},
	["任务37传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 241,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 37},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 37},
			},
			{
				{"追踪点击事件", "荣耀装备兑换官"},
			},
			{
				{"放弃任务事件", 37},
			},
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 37},
			},
		},
	},
	["任务37交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 242,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 37},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 37},
			},
			{
				{"打开引导事件", "任务37交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 37},
			},
		},
	},
	["任务37交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 243,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 37},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 37},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 37},
			},
		},
	},
	["任务38接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 244,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 37},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 38},
			},
			{
				{"打开引导事件", "任务38接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 38},
			},
		},
	},
	["任务38接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 245,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 37},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 38},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 38},
			},
		},
	},
	["任务38点击装备回收"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 195, 150, 100, 60, 1904100071, true, 1, 0, "\n   点击\n#COLORCOLOR_GOLD#[装备回收]#COLOREND#",
			},
			delay = 100,
			flag = 246,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 38},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[装备回收]"},
			},
			{
				{"任务激活事件", 38},
			},
			{
				{"打开引导事件", "任务38交任务1"},
			},
		},
		{--完成条件
			{
				{"任务激活事件", 38},
			},
			{
				{"打开引导事件", "任务38点击装备回收"},
			},
		},
	},
	["任务38点击放入任务回收装备"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -100, 90, 136, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#右键点击放入#COLORCOLOR_GOLD#[任务回收装备]#COLOREND#",
			},
			delay = 100,
			flag = 247,
			pre_script = "UI:Lua_OpenGameFormDlg(\"包裹\", 455, 280); GuideFunc.rectify_open(\"装备回收\", 50, 280);",
			param = "任务回收装备",
			init = "GuideFunc.PkgRectifyPos",
		},
		{--触发条件
			{
				{"接取任务", 38},
				{"点击NPC文字事件", "[装备回收]"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 38},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 38},
			}
		},
	},
	["任务38确认装备回收"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"装备回收", 105, 310, 100, 60, 1904100071, true, 1, 0, "\n   点击\n#COLORCOLOR_GOLD#[回收装备]#COLOREND#",
			},
			delay = 100,
			flag = 248,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 38},
				{"关闭引导事件", "任务38点击放入任务回收装备"},
			},
		},
		{--关闭条件
			{
				{"打开面板事件", "MessageBox"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 38},
			},
		},
	},
	["任务38确认回收"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"MessageBox", 182, 200, 100, 60, 1904100071, true, 1, 0, "\n\n  确认#COLORCOLOR_SKYBLUE#[回收]#COLOREND#",
			},
			delay = 100,
			flag = 249,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 38},
				{"关闭引导事件", "任务38确认装备回收"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 38},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 38},
			},
		},
	},
	["任务38传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			pre_script = "UI:Lua_CloseGameFormDlg(\"包裹\")",
			delay = 100,
			flag = 250,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 38},
				{"关闭引导事件", "任务38关闭装备回收"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 38},
			},
			{
				{"追踪点击事件", "荣耀装备兑换官"},
			},
			{
				{"放弃任务事件", 38},
			},
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 38},
			},
		},
	},
	["任务38交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 251,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 38},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 3},
			},
			{
				{"打开引导事件", "任务38交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 38},
			},
		},
	},
	["任务38交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 252,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 38},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 38},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 38},
			},
		},
	},
	["任务39接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 253,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 38},
				{"打开NPC事件", "荣耀装备兑换官"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 39},
			},
			{
				{"打开引导事件", "任务39接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 39},
			},
		},
	},
	["任务39接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 254,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 38},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 39},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 39},
			},
		},
	},
	["任务39传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -230, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 255,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 39},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 39},
			},
			{
				{"追踪点击事件", "杀神"},
			},
			{
				{"放弃任务事件", 39},
			},
			{
				{"打开NPC事件", "杀神"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 39},
			},
		},
	},
	["任务39交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 256,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 39},
				{"打开NPC事件", "杀神"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 39},
			},
			{
				{"打开引导事件", "任务39交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 39},
			},
		},
	},
	["任务39交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 257,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 39},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 39},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 39},
			},
		},
	},
	["任务40接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 258,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 39},
				{"打开NPC事件", "杀神"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 40},
			},
			{
				{"打开引导事件", "任务40接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 40},
			},
		},
	},
	["任务40接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 259,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 39},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 40},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 40},
			},
		},
	},
	["任务40点击查看杀神"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", -14, 210, 100, 60, 1904100071, true, 1, 0, "\n   点击\n#COLORCOLOR_GOLD#[查看杀神]#COLOREND#",
			},
			delay = 100,
			flag = 260,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 40},
				{"打开NPC事件", "杀神"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[查看杀神]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 40},
			},
		},
	},
	["任务40膜拜"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"膜拜杀神", -35, 475, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#[膜拜]#COLOREND#一次",
			},
			pre_script = "GuideFunc.rectify_open(\"膜拜杀神\", 200, 150);",
			delay = 100,
			flag = 261,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 40},
				{"关闭引导事件", "任务40点击查看杀神"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 40},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 40},
			},
		},
	},
	["任务40传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -230, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 262,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 40},
				{"关闭引导事件", "任务40关闭杀神面板"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 40},
			},
			{
				{"追踪点击事件", "杀神"},
			},
			{
				{"放弃任务事件", 40},
			},
			{
				{"打开NPC事件", "杀神"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 40},
			},
		},
	},
	["任务40交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 263,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 40},
				{"打开NPC事件", "杀神"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 40},
			},
			{
				{"打开引导事件", "任务40交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 40},
			},
		},
	},
	["任务40交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 264,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 40},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 40},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 40},
			},
		},
	},
	["任务41接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 265,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 40},
				{"打开NPC事件", "杀神"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 41},
			},
			{
				{"打开引导事件", "任务41接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 41},
			},
		},
	},
	["任务41接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 266,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 40},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 41},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 41},
			},
		},
	},
	["任务41传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -180, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 267,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 41},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 41},
			},
			{
				{"追踪点击事件", "每日签到员"},
			},
			{
				{"放弃任务事件", 41},
			},
			{
				{"打开NPC事件", "每日签到员"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 41},
			},
		},
	},
	["任务41交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 268,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 41},
				{"打开NPC事件", "每日签到员"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 41},
			},
			{
				{"打开引导事件", "任务41交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 41},
			},
		},
	},
	["任务41交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 269,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 41},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 41},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 41},
			},
		},
	},
	["任务42接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 270,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 41},
				{"打开NPC事件", "每日签到员"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 42},
			},
			{
				{"打开引导事件", "任务42接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 42},
			},
		},
	},
	["任务42接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 271,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 41},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 42},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 42},
			},
		},
	},
	["任务42点击签到"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 162, 199, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[签到]#COLOREND#",
			},
			delay = 100,
			flag = 272,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 42},
				{"打开NPC事件", "每日签到员"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "签到"},
			},
			{
				{"激活任务事件", 42},
			},
			{
				{"打开引导事件", "任务42点击领奖"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 42},
			},
			{
				{"打开引导事件", "任务42点击签到"},
			},
		},
	},
	["任务42点击领奖"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 135, 215, 100, 60, 1904100071, true, 1, 0, "\n  签到成功\n可以#COLORCOLOR_GOLD#[领奖]#COLOREND#了",
			},
			delay = 100,
			flag = 273,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 42},
				{"关闭引导事件", "任务42点击签到"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[领奖]"},
			},
			{
				{"激活任务事件", 42},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "任务42点击领奖"},
			},
			{
				{"完成任务事件", 42},
			},
			{
				{"激活任务事件", 42},
			},
		},
	},
	["任务42交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 274,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 42},
				{"打开NPC事件", "每日签到员"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 42},
			},
			{
				{"打开引导事件", "任务42交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 42},
			},
		},
	},
	["任务42交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 275,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 42},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 42},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 42},
			},
		},
	},
	["任务43接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 276,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 42},
				{"打开NPC事件", "每日签到员"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 43},
			},
			{
				{"打开引导事件", "任务43接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 43},
			},
		},
	},
	["任务43接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 277,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 42},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 43},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 43},
			},
		},
	},
	["任务43传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 278,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 43},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 43},
			},
			{
				{"追踪点击事件", "天机老人"},
			},
			{
				{"放弃任务事件", 43},
			},
			{
				{"打开NPC事件", "天机老人"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 43},
			},
		},
	},
	["任务43交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 279,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 43},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 43},
			},
			{
				{"打开引导事件", "任务43交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 43},
			},
		},
	},
	["任务43交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 280,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 43},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 43},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 43},
			},
		},
	},
	["任务44接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 281,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 43},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 44},
			},
			{
				{"打开引导事件", "任务44接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 44},
			},
		},
	},
	["任务44接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 282,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 43},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 44},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 44},
			},
		},
	},
	["任务44点击领取金币悬赏"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 170, 185, 100, 60, 1904100071, true, 1, 0, "\n   点击领取\n  #COLORCOLOR_GOLD#[金币悬赏]#COLOREND#",
			},
			delay = 100,
			flag = 283,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "领取[金币悬赏]"},
			},
		},
		{--完成条件
			{
				{"打开引导事件", "任务44点击领取金币悬赏"},
			},
		},
	},
	["任务44交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 284,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 44},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 44},
			},
			{
				{"打开引导事件", "任务44交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 44},
			},
		},
	},
	["任务44交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 285,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 44},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 44},
			},
		},
	},
	["任务45接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 286,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 44},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 45},
			},
			{
				{"打开引导事件", "任务45接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 45},
			},
		},
	},
	["任务45接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 287,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 44},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 45},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 45},
			},
		},
	},
	["任务45传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 288,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 45},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 45},
			},
			{
				{"追踪点击事件", "荣耀战场"},
			},
			{
				{"放弃任务事件", 45},
			},
			{
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 45},
			},
		},
	},
	["任务45交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 289,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 45},
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 45},
			},
			{
				{"打开引导事件", "任务45交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 45},
			},
		},
	},
	["任务45交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 290,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 45},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 45},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 45},
			},
		},
	},
	["任务46接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 291,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 45},
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 46},
			},
			{
				{"打开引导事件", "任务46接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 46},
			},
		},
	},
	["任务46接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 292,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 45},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 46},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 46},
			},
		},
	},
	["任务46点击进入战场"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 147, 190, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[进入战场]#COLOREND#",
			},
			delay = 100,
			flag = 293,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 46},
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[进入战场]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 46},
			},
			{
				{"打开引导事件", "任务46点击进入战场"},
			},
		},
	},
	--[[["任务46点击荣耀女神"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 147, 190, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[进入战场]#COLOREND#",
			},
			delay = 100,
			flag = 294,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 46},
				{"打开NPC事件", "荣耀女神"},
			},
		},
		{--关闭条件
			{
				{"打开面板事件", "InputBox"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 46},
			},
		},
	},
	["任务46输入怪物数量"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 147, 190, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[进入战场]#COLOREND#",
			},
			delay = 100,
			flag = 295,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 46},
				{"关闭引导事件", "任务46点击荣耀女神"},
			},
		},
		{--关闭条件
		},
		{--完成条件
			{
				{"激活任务事件", 46},
			},
		},
	},]]
	["任务46传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 296,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 46},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 46},
			},
			{
				{"追踪点击事件", "荣耀战场"},
			},
			{
				{"放弃任务事件", 46},
			},
			{
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 46},
			},
		},
	},
	["任务46交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 297,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 46},
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 46},
			},
			{
				{"打开引导事件", "任务46交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 46},
			},
		},
	},
	["任务46交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 298,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 46},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 46},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 46},
			},
		},
	},
	["任务47接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 299,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 46},
				{"打开NPC事件", "荣耀战场"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 47},
			},
			{
				{"打开引导事件", "任务47接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 47},
			},
		},
	},
	["任务47接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 300,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 46},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 47},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 47},
			},
		},
	},
	["任务47传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 301,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 47},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 47},
			},
			{
				{"追踪点击事件", "降魔使者"},
			},
			{
				{"放弃任务事件", 47},
			},
			{
				{"打开NPC事件", "降魔使者"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 47},
			},
		},
	},
	["任务47交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 302,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 47},
				{"打开NPC事件", "降魔使者"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 47},
			},
			{
				{"打开引导事件", "任务47交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 47},
			},
		},
	},
	["任务47交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 303,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 47},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 47},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 47},
			},
		},
	},
	["任务48接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 304,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 47},
				{"打开NPC事件", "降魔使者"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 48},
			},
			{
				{"打开引导事件", "任务48接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 48},
			},
		},
	},
	["任务48接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 305,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 47},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 48},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 48},
			},
		},
	},
	["任务48点击接取降魔任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 209, 159, 100, 60, 1904100071, true, 1, 0, "\n     点击\n#COLORCOLOR_GOLD#[接取降魔任务]#COLOREND#",
			},
			delay = 100,
			flag = 306,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 48},
				{"打开NPC事件", "降魔使者"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "接取降魔任务"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 48},
			},
			{
				{"打开引导事件", "任务48点击接取降魔任务"},
			},
		},
	},
	["任务48接取降魔任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 195, 159, 100, 60, 1904100071, true, 1, 0, "\n  点击接受任务",
			},
			delay = 100,
			flag = 307,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "接取降魔任务"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", " 废弃矿洞"},
			},
			{
				{"点击NPC文字事件", " 虫巢"},
			},
			{
				{"点击NPC文字事件", " 妖玛寺庙"},
			},
			{
				{"点击NPC文字事件", " 猪洞"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 48},
			},
			{
				{"打开引导事件", "任务48接取降魔任务"},
			},
		},
	},
	["任务48接取降魔任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 195, 200, 100, 60, 1904100071, true, 1, 0, "\n    点击接受\n   #COLORCOLOR_GOLD#[降魔任务]#COLOREND#",
			},
			delay = 100,
			flag = 308,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 48},
				{"点击NPC文字事件", " 废弃矿洞"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", " 虫巢"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", " 妖玛寺庙"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", " 猪洞"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "清理废弃矿洞10只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理废弃矿洞20只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理虫巢10只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理虫巢20只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理妖玛寺庙15只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理妖玛寺庙30只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理猪洞20只任意怪物"},
			},
			{
				{"点击NPC文字事件", "清理猪洞40只任意怪物"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 48},
			},
			{
				{"打开引导事件", "任务48接取降魔任务2"},
			},
		},
	},
	["任务48直接完成降魔任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 165, 165, 100, 60, 1904100071, true, 1, 0, "\n使用#COLORCOLOR_GOLD#[循环魔咒]#COLOREND#\n 直接完成任务",
			},
			delay = 100,
			flag = 309,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理废弃矿洞10只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理废弃矿洞20只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理虫巢10只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理虫巢20只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理妖玛寺庙15只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理妖玛寺庙30只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理猪洞20只任意怪物"},
			},
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "清理猪洞40只任意怪物"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "直接使用魔咒完成"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 48},
			},
			{
				{"打开引导事件", "任务48直接完成降魔任务"},
			},
		},
	},
	["任务48普通领取"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 130, 175, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[普通领取]#COLOREND#",
			},
			delay = 100,
			flag = 310,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 48},
				{"点击NPC文字事件", "直接使用魔咒完成"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "普通领取"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 48},
			},
			{
				{"打开引导事件", "任务48普通领取"},
			},
		},
	},
	["任务48交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 311,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 48},
				{"打开NPC事件", "降魔使者"},
			},
			{
				{"激活任务事件", 48},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 48},
			},
			{
				{"打开引导事件", "任务48交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 48},
			},
		},
	},
	["任务48交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 312,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 48},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 48},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 48},
			},
		},
	},
	["任务49接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 313,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 48},
				{"打开NPC事件", "降魔使者"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 49},
			},
			{
				{"打开引导事件", "任务49接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 49},
			},
		},
	},
	["任务49接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 314,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 48},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 49},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 49},
			},
		},
	},
	["任务49传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 315,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 49},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 49},
			},
			{
				{"追踪点击事件", "镇魔殿传送人"},
			},
			{
				{"放弃任务事件", 49},
			},
			{
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 49},
			},
		},
	},
	["任务49交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 316,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 49},
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 49},
			},
			{
				{"打开引导事件", "任务49交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 49},
			},
		},
	},
	["任务49交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 317,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 49},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 49},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 49},
			},
		},
	},
	["任务50接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 318,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 49},
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 50},
			},
			{
				{"打开引导事件", "任务50接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 50},
			},
		},
	},
	["任务50接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 319,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 49},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 50},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 50},
			},
		},
	},
	["任务50点击挑战镇魔殿"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 200, 160, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[挑战镇魔殿]#COLOREND#",
			},
			delay = 100,
			flag = 320,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 50},
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[挑战镇魔殿]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 50},
			},
			{
				{"打开引导事件", "任务50点击挑战镇魔殿"},
			},
		},
	},
	["任务50点击单人前往"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 178, 160, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[单人前往]#COLOREND#\n镇魔殿进行挑战",
			},
			delay = 100,
			flag = 321,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 50},
				{"点击NPC文字事件", "[挑战镇魔殿]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[单人前往]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 50},
			},
			{
				{"打开引导事件", "任务50点击单人前往"},
			},
		},
	},
	["任务50传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 15, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 322,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 50},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 50},
			},
			{
				{"追踪点击事件", "镇魔殿传送人"},
			},
			{
				{"放弃任务事件", 50},
			},
			{
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 50},
			},
		},
	},
	["任务50交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 323,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 50},
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 50},
			},
			{
				{"打开引导事件", "任务50交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 50},
			},
		},
	},
	["任务50交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 324,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 50},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 50},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 50},
			},
		},
	},
	["任务51接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 325,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 50},
				{"打开NPC事件", "镇魔殿传送人"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 51},
			},
			{
				{"打开引导事件", "任务51接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 51},
			},
		},
	},
	["任务51接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 326,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 50},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 51},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 51},
			},
		},
	},
	["任务51传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 327,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 51},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 51},
			},
			{
				{"追踪点击事件", "装备合成大师"},
			},
			{
				{"放弃任务事件", 51},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 51},
			},
		},
	},
	["任务51交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 328,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 51},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 51},
			},
			{
				{"打开引导事件", "任务51交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 51},
			},
		},
	},
	["任务51交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 329,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 51},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 51},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 51},
			},
		},
	},
	["任务52接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 330,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 51},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 52},
			},
			{
				{"打开引导事件", "任务52接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 52},
			},
		},
	},
	["任务52接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 331,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 51},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 52},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 52},
			},
		},
	},
	["任务52传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 332,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 52},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 52},
			},
			{
				{"追踪点击事件", "废弃矿洞6"},
			},
			{
				{"放弃任务事件", 52},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 52},
			},
		},
	},
	["任务52传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 333,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 52},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 52},
			},
			{
				{"追踪点击事件", "装备合成大师"},
			},
			{
				{"放弃任务事件", 52},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 52},
			},
		},
	},
	["任务52交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 334,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 52},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 52},
			},
			{
				{"打开引导事件", "任务52交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 52},
			},
		},
	},
	["任务52交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 335,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 52},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 52},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 52},
			},
		},
	},
	["任务53接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 336,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 52},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 53},
			},
			{
				{"打开引导事件", "任务53接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 53},
			},
		},
	},
	["任务53接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 337,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 52},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 53},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 53},
			},
		},
	},
	["任务53点击装备合成"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 197, 160, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[装备合成]#COLOREND#",
			},
			delay = 100,
			flag = 338,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 53},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "装备合成"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 53},
			},
		},
	},
	["任务53点击武器"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -80, 80, 100, 60, 1904100071, true, 1, 0, "\n已经帮你自动选中武器\n右键点击#COLORCOLOR_SKYBLUE#[图纸]#COLOREND#",
			},
			delay = 100,
			flag = 339,
			pre_script = "UI:Lua_OpenGameFormDlg(\"包裹\", 520, 350); GuideFunc.rectify_open(\"装备合成2\", 0, 110);GuideFunc.open_zbhc2()",
			param = "神魔灵模具",
			init = "GuideFunc.PkgRectifyPos",
		},
		{--触发条件
			{
				{"接取任务", 53},
				{"关闭引导事件", "任务53点击装备合成"},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务53确认合成"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 53},
			},
		},
	},
	--[[["任务53点击放入神魔灵模具"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -100, 90, 136, 60, 1904100071, true, 1, 0, "\n   右键点击放入\n   #COLORCOLOR_GOLD#[神魔灵模具]#COLOREND#",
			},
			delay = 100,
			flag = 340,
			param = "神魔灵模具",
			init = "GuideFunc.PkgRectifyPos",
		},
		{--触发条件
			{
				{"接取任务", 53},
				{"点击控件事件", "装备合成2,panel,i1"},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务53确认合成"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 53},
			}
		},
	},]]
	["任务53确认合成"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"装备合成2", 32, 440, 100, 60, 1904100071, true, 1, 0, "\n\n  #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#[确认合成]#COLOREND#",
			},
			delay = 100,
			flag = 341,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 53},
				{"关闭引导事件", "任务53点击武器"},
			},
		},
		{--关闭条件
			{
				{"打开面板事件", "MessageBox"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 53},
			},
		},
	},
	["任务53传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 342,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 53},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 53},
			},
			{
				{"追踪点击事件", "装备合成大师"},
			},
			{
				{"放弃任务事件", 53},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 53},
			},
		},
	},
	["任务53交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 343,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 53},
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"激活任务", 53},
				{"关闭引导事件", "任务55003交任务2"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 53},
			},
			{
				{"打开引导事件", "任务53交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 53},
			},
		},
	},
	["任务53交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 344,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 53},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 53},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 53},
			},
		},
	},
	["任务54接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 345,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 53},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 54},
			},
			{
				{"打开引导事件", "任务5接受任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 54},
			},
		},
	},
	["任务54接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 346,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 53},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 54},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 54},
			},
		},
	},
	["任务54传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 347,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 54},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 54},
			},
			{
				{"追踪点击事件", "龙城冲级比赛"},
			},
			{
				{"放弃任务事件", 54},
			},
			{
				{"打开NPC事件", "龙城冲级比赛"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 54},
			},
		},
	},
	["任务54交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 348,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 54},
				{"打开NPC事件", "龙城冲级比赛"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 54},
			},
			{
				{"打开引导事件", "任务54交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 54},
			},
		},
	},
	["任务54交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 349,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 54},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 54},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 54},
			},
		},
	},
	["任务55接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 350,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 54},
				{"打开NPC事件", "龙城冲级比赛"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 55},
			},
			{
				{"打开引导事件", "任务55接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 55},
			},
		},
	},
	["任务55接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 351,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 54},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 55},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 55},
			},
		},
	},
	["任务55点装备任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 195, 200, 100, 60, 1904100071, true, 1, 0, "\n  点击领取\n#COLORCOLOR_GOLD# [装备日常]#COLOREND#",
			},
			delay = 100,
			flag = 352,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 55},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "领取[装备日常]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 55},
			},
			{
				{"打开引导事件", "任务55点装备任务"},
			},
		},
	},
	["任务55领取任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 170, 150, 100, 60, 1904100071, true, 1, 0, "\n    点击领取\n   #COLORCOLOR_GOLD#[装备任务]#COLOREND#",
			},
			delay = 100,
			flag = 353,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 55},
				{"关闭引导事件", "任务55点装备任务"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[废弃矿洞]  35级装备"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 55},
			},
			{
				{"打开引导事件", "任务55领取任务"},
			},
		},
	},
	["任务55领取矿洞任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 180, 90, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[领取任务]#COLOREND#",
			},
			delay = 100,
			flag = 354,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 55},
				{"关闭引导事件", "任务55领取任务"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[废弃矿洞]  35级装备"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 55},
			},
			{
				{"点击NPC文字事件", "[废弃矿洞]  35级装备"},
			},
		},
	},
	["任务14-15点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 304 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 355,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 14},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "神之翼"},
			},
			{
				{"接取任务事件", 15},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 15},
			},
		},
	},
	["任务15-16点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 304 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 356,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 15},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "神之翼"},
			},
			{
				{"接取任务事件", 16},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 16},
			},
		},
	},
	["任务16-17点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 244 * LLW + 40, 317 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 357,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 16},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "师徒管理员"},
			},
			{
				{"接取任务事件", 17},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 17},
			},
		},
	},
	["任务17-18点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 244 * LLW + 40, 317 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 358,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 17},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "师徒"},
			},
			{
				{"接取任务事件", 18},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 18},
			},
		},
	},
	["任务18-19点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 160 * LLW + 40, 229 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 359,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 18},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
			{
				{"接取任务事件", 19},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 19},
			},
		},
	},
	--[[["任务19-20点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 160 * LLW + 40, 229 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 360,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 19},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
			{
				{"接取任务事件", 20},
			},
		},
		{--完成条件
			{
				{"接取任务", 20},
			},
		},
	},]]
	["任务20-21点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 160 * LLW + 40, 229 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 361,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 20},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "毒蛇谷杂货商"},
			},
			{
				{"接取任务事件", 21},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 21},
			},
		},
	},
	["任务21-22点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 232 * LLW + 40, 290 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 362,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 21},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备大师"},
			},
			{
				{"接取任务事件", 22},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 22},
			},
		},
	},
	["任务22-23点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 232 * LLW + 40, 290 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 363,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 22},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备大师"},
			},
			{
				{"接取任务事件", 23},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 23},
			},
		},
	},
	["任务23-24点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 273 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 364,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 23},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "巫山城书商"},
			},
			{
				{"接取任务事件", 24},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 24},
			},
		},
	},
	["任务24-25点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 273 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 365,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 24},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "巫山城书商"},
			},
			{
				{"接取任务事件", 25},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 25},
			},
		},
	},
	["任务25-26点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 237 * LLW + 40, 316 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 366,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 25},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "驯兽师"},
			},
			{
				{"接取任务事件", 26},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 26},
			},
		},
	},
	["任务26-27点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 237 * LLW + 40, 316 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 367,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 26},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "驯兽师"},
			},
			{
				{"接取任务事件", 27},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 27},
			},
		},
	},
	["任务27-28点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 237 * LLW + 40, 316 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 368,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 27},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "驯兽师"},
			},
			{
				{"接取任务事件", 28},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 28},
			},
		},
	},
	["任务28-29点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 273 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 369,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 28},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "巫山城书商"},
			},
			{
				{"接取任务事件", 29},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 29},
			},
		},
	},
	["任务29-30点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 273 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 370,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 29},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "巫山城书商"},
			},
			{
				{"接取任务事件", 30},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 30},
			},
		},
	},
	["任务30-31点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 371,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 30},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务事件", 31},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 31},
			},
		},
	},
	["任务31-32点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 177 * LLW + 40, 257 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 372,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 31},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "南门军需官"},
			},
			{
				{"接取任务事件", 32},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 32},
			},
		},
	},
	["任务32-33点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 254 * LLW + 40, 162 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 373,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 32},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "北门军需官"},
			},
			{
				{"接取任务事件", 33},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 33},
			},
		},
	},
	["任务33-34点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 374,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 33},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务事件", 34},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 34},
			},
		},
	},
	["任务34-35点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 375,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 34},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务事件", 35},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 35},
			},
		},
	},
	["任务35-36点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 236 * LLW + 40, 240 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 376,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 35},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
			{
				{"接取任务事件", 36},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 36},
			},
		},
	},
	["任务36-37点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 236 * LLW + 40, 240 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 377,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 36},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
			{
				{"接取任务事件", 37},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 37},
			},
		},
	},
	["任务37-38点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 236 * LLW + 40, 240 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 378,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 37},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
			{
				{"接取任务事件", 38},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 38},
			},
		},
	},
	["任务38-39点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 236 * LLW + 40, 240 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 379,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 38},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
			{
				{"接取任务事件", 39},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 39},
			},
		},
	},
	["任务39-40点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 244 * LLW + 40, 263 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 380,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 39},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "杀神"},
			},
			{
				{"接取任务事件", 40},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 40},
			},
		},
	},
	["任务40-41点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 244 * LLW + 40, 263 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 10,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 40},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "杀神"},
			},
			{
				{"接取任务事件", 41},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 41},
			},
		},
	},
	["任务41-42点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 248 * LLW + 40, 216 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 10,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 41},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "每日签到员"},
			},
			{
				{"接取任务事件", 42},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 42},
			},
		},
	},
	["任务42-43点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 248 * LLW + 40, 216 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 381,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 42},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "每日签到员"},
			},
			{
				{"接取任务事件", 43},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 43},
			},
		},
	},
	["任务43-44点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 382,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 43},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务事件", 44},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 44},
			},
		},
	},
	["任务44-45点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 383,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 44},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务事件", 45},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 45},
			},
		},
	},
	["任务45-46点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 230 * LLW + 40, 216 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 384,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 45},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀战场"},
			},
			{
				{"接取任务事件", 46},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 46},
			},
		},
	},
	["任务46-47点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 230 * LLW + 40, 216 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 385,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 46},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀战场"},
			},
			{
				{"接取任务事件", 47},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 47},
			},
		},
	},
	["任务47-48点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 235 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 386,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 47},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "降魔使者"},
			},
			{
				{"接取任务事件", 48},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 48},
			},
		},
	},
	["任务48-49点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 235 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 387,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 48},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "降魔使者"},
			},
			{
				{"接取任务事件", 49},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 49},
			},
		},
	},
	["任务49-50点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 222 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 388,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 49},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "镇魔殿传送人"},
			},
			{
				{"接取任务事件", 50},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 50},
			},
		},
	},
	["任务50-51点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 222 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 389,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 50},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "镇魔殿传送人"},
			},
			{
				{"接取任务事件", 51},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 51},
			},
		},
	},
	["任务51-52点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 390,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 51},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"接取任务事件", 52},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 52},
			},
		},
	},
	["任务52-53点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 391,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 52},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"接取任务事件", 53},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 53},
			},
		},
	},
	["任务53-54点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 392,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 53},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"接取任务事件", 54},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 54},
			},
		},
	},
	["任务54-55点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 228 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 393,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 54},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "龙城冲级比赛"},
			},
			{
				{"接取任务事件", 55},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 55},
			},
		},
	},
	["任务7交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 394,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 7},
				{"打开NPC事件", "新手村铁匠左"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 7},
			},
			{
				{"打开引导事件", "任务7交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 7},
			},
		},
	},
	["任务17交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 395,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 17},
				{"打开引导事件", "任务17点了解拜师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 17},
			},
			{
				{"打开引导事件", "任务17交任务2"},
			},
			{
				{"打开引导事件", "任务17交任务1"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 17},
			},
		},
	},
	["任务34-35点NPC接悬赏"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 396,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 34},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"激活任务事件", 34},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 34},
			},
		},
	},
	["任务34-35激活任务点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 396,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 34},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 34},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 34},
			},
		},
	},
	["任务36接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 236 * LLW + 40, 240 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 397,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 36},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
			{
				{"激活任务事件", 37},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 37},
			},
		},
	},
	["任务38接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 236 * LLW + 40, 240 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 398,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 38},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀装备兑换官"},
			},
			{
				{"激活任务事件", 38},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 38},
			},
		},
	},
	["任务40接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 244 * LLW + 40, 263 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 399,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 40},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "杀神"},
			},
			{
				{"激活任务事件", 40},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 40},
			},
		},
	},
	["任务43接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 245 * LLW + 40, 220 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 400,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 44},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "天机老人"},
			},
			{
				{"激活任务事件", 44},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 44},
			},
		},
	},
	["任务46接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 230 * LLW + 40, 216 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 401,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 46},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀战场"},
			},
			{
				{"激活任务事件", 46},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 46},
			},
		},
	},
	["任务48接任务后NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 235 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 402,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 48},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "降魔使者"},
			},
			{
				{"激活任务事件", 48},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 48},
			},
		},
	},
	["任务50接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 226 * LLW + 40, 222 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 403,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 50},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "镇魔殿传送人"},
			},
			{
				{"激活任务事件", 50},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 50},
			},
		},
	},
	["任务55接取后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 404,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 55},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"激活任务事件", 55},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 55},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
	},
	["任务55003传送1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 45, 140, 40, 1904100071, false, 4, 0, "   包裹中有#COLORCOLOR_SKYBLUE#[逍遥游]#COLOREND#\n点击#COLORCOLOR_GOLD#[传送]#COLOREND#快速传送到怪物身边",
			},
			delay = 100,
			flag = 405,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 55003},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 55003},
			},
			{
				{"追踪点击事件", "废弃矿洞1"},
			},
			{
				{"放弃任务事件", 55003},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 55003},
			},
		},
	},
	["任务55003传送2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "   包裹中有#COLORCOLOR_SKYBLUE#[逍遥游]#COLOREND#\n点击#COLORCOLOR_GOLD#[传送]#COLOREND#快速传送到怪物身边",
			},
			delay = 100,
			flag = 405,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 55003},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 55003},
			},
			{
				{"追踪点击事件", "装备合成大师"},
			},
			{
				{"放弃任务事件", 55003},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55003},
			},
		},
	},
	["任务55003交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 387, 200, 100, 60, 1904100071, true, 1, 0, " \n点击这里提交\n #COLORCOLOR_SKYBLUE#[装备任务]#COLOREND#",
			},
			delay = 100,
			flag = 406,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 55003},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 55003},
			},
			{
				{"点击NPC文字事件", "完成[装备日常]"},
			},
			{
				{"打开引导事件", "任务55003交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55003},
			},
			{
				{"打开引导事件", "任务55003交任务1"},
			},
		},
	},
	["任务55003交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 170, 140, 100, 60, 1904100071, true, 1, 0, " \n   提交\n#COLORCOLOR_SKYBLUE#[装备任务]#COLOREND#",
			},
			delay = 100,
			flag = 407,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 55003},
				{"关闭引导事件", "任务55003交任务1"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 55003},
			},
			{
				{"点击NPC文字事件", "提交  [废弃矿洞]"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55003},
			},
			{
				{"打开引导事件", "任务55003交任务2"},
			},
		},
	},
		["任务55交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 408,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 55},
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"激活任务", 55},
				{"关闭引导事件", "任务55003交任务2"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 55},
			},
			{
				{"打开引导事件", "任务55交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55},
			},
		},
	},
	["任务55交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>#点击这里",
			},
			delay = 100,
			flag = 409,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 55},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 55},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55},
			},
		},
	},
		["任务56接任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 0, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 410,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 55},
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 56},
			},
			{
				{"打开引导事件", "任务56接任务2"},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 56},
			},
		},
	},
	["任务56接任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"TaskOperationDlg", -5, 530, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[接受任务]#COLOREND#",
			},
			delay = 100,
			flag = 411,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 55},
				{"打开面板事件", "TaskOperationDlg"},
			},
		},
		{--关闭条件
			{
				{"接取任务事件", 56},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 56},
			},
		},
	},
	["任务53接取后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 412,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 52},
				{"接取任务事件", 53},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"激活任务事件", 53},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 53},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
	},
		["任务55接任务传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -200, 35, 140, 40, 1904100071, false, 4, 0, "   包裹中有#COLORCOLOR_SKYBLUE#[逍遥游]#COLOREND#\n点击#COLORCOLOR_GOLD#[传送]#COLOREND#快速传送到怪物身边",
			},
			delay = 100,
			flag = 413,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 55},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 55},
			},
			{
				{"追踪点击事件", "装备合成大师"},
			},
			{
				{"放弃任务事件", 55},
			},
			{
				{"打开NPC事件", "装备合成大师"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55},
			},
		},
	},
	["任务9传送"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -190, 35, 140, 40, 1904100071, false, 4, 0, "\n点击这里#COLORCOLOR_SKYBLUE#[快速传送]#COLOREND#",
			},
			delay = 100,
			flag = 414,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 9},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 9},
			},
			{
				{"追踪点击事件", "新手村仓库管理员左"},
			},
			{
				{"放弃任务事件", 9},
			},
			{
				{"打开NPC事件", "新手村仓库管理员左"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 9},
			},
		},
	},
	--[[["任务10关闭包裹"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", 283, -127, 100, 60, 1904100071, true, 2, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[关闭包裹]#COLOREND#",
			},
			delay = 100,
			flag = 415,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 10},
				{"关闭引导事件", "任务10点关闭仓库"},
			},
		},
		{--关闭条件
			{
				{"追踪点击事件", "新手村仓库管理员左"},
			},
			{
				{"放弃任务事件", 10},
			},
			{
				{"打开引导事件", "任务10提交任务1"},
			},
			{
				{"打开引导事件", "任务10提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务", 10},
			},
		},
	},]]
	["任务17交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 416,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 17},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 17},
			},
			{
				{"打开引导事件", "任务17交任务1"},
			},
			{
				{"打开引导事件", "任务17交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 17},
			},
		},
	},
	["任务19关闭杂货店窗口"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcShop", 192, 95, 136, 60, 1904100071, true, 1, 0, "药店可买各种#COLORCOLOR_SKYBLUE#[补给品]#COLOREND#\n帮助自己在攻击怪物时能够生存下来\n点击这里#COLORCOLOR_SKYBLUE#[关闭]#COLOREND#药店",
			},
			delay = 100,
			flag = 417,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 19},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 19},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 19},
			},
			{
				{"打开引导事件", "任务19关闭杂货店窗口"},
			},
		},
	},
	["任务22关闭包裹"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", 283, -127, 100, 60, 1904100071, true, 2, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[关闭包裹]#COLOREND#",
			},
			delay = 100,
			flag = 418,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 22},
				{"关闭引导事件", "任务10点关闭仓库"},
			},
		},
		{--关闭条件
			{
				{"追踪点击事件", "装备大师"},
			},
			{
				{"放弃任务事件", 22},
			},
			{
				{"打开引导事件", "任务22提交任务1"},
			},
			{
				{"打开引导事件", "任务22提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 22},
			},
		},
	},
	["任务27关闭坐骑升阶窗口"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"马升级", 458, 95, 136, 60, 1904100071, true, 1, 0, "\n     #COLORCOLOR_GOLD#坐骑50级#COLOREND#\n  才能进行升阶操作\n    #COLORCOLOR_SKYBLUE#[关闭面板]#COLOREND#",
			},
			pre_script = "GuideFunc.rectify_open(\"马升级\", 150, 150);",
			delay = 100,
			flag = 419,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 27},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 27},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 27},
			},
			{
				{"打开引导事件", "任务27关闭坐骑升阶窗口"},
			},
		},
	},
	["任务32自动跑路"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,TaskWindow", -285, 50, 140, 40, 1904100071, false, 4, 0, "\n      #OFFSET<X:0,Y:-8>#将美女护送到\n     #COLORCOLOR_GREENG#[北门军需官]#COLOREND#处",
			},
			delay = 100,
			flag = 420,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 32},
				{"点击NPC文字事件", "[保护美女]"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 32},
			},
			{
				{"激活任务事件", 32},
			},
			{
				{"打开NPC事件", "北门军需官"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 32},
			},
		},
	},
	["任务34交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 421,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 34},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 34},
			},
			{
				{"打开引导事件", "任务34交任务1"},
			},
			{
				{"打开引导事件", "任务34交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 34},
			},
		},
	},
	["任务36关闭荣耀道具购买"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"荣耀道具兑换", 145, 90, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[关闭面板]#COLOREND#",
			},
			delay = 100,
			flag = 422,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 36},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务36交任务1"},
			},
			{
				{"打开引导事件", "任务36交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 36},
			},
		},
	},
	["任务38关闭装备回收"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"装备回收", 285, 90, 100, 60, 1904100071, true, 1, 0, "\n\n#OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[关闭回收面板]#COLOREND#",
			},
			delay = 100,
			flag = 423,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 38},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务36交任务1"},
			},
			{
				{"打开引导事件", "任务36交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 38},
			},
		},
	},
	--[[["任务38关闭包裹"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", 285, 90, 100, 60, 1904100071, true, 1, 0, "\n\n #OFFSET<X:0,Y:-8>#点击#COLORCOLOR_GOLD#[关闭包裹]#COLOREND#",
			},
			delay = 100,
			flag = 424,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 38},
				{"关闭引导事件", "任务38关闭装备回收"},
			},
		},
		{--关闭条件
			{
				{"追踪点击事件", "荣耀装备兑换官"},
			},
			{
				{"放弃任务事件", 38},
			},
			{
				{"打开引导事件", "任务22提交任务1"},
			},
			{
				{"打开引导事件", "任务22提交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务", 38},
			},
		},
	},]]
	["任务40关闭杀神面板"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"膜拜杀神", 448, 90, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[关闭面板]#COLOREND#",
			},
			delay = 100,
			flag = 425,
			init = "",
		},
		{--触发条件
			{
				{"激活任务事件", 40},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务40交任务1"},
			},
			{
				{"打开引导事件", "任务40交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 40},
			},
		},
	},
	["任务55-56点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 426,
			init = "",
		},
		{--触发条件
			{
				{"完成任务", 55},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"接取任务事件", 56},
			},
		},
		{--完成条件
			{
				{"接取任务事件", 56},
			},
		},
	},
	["任务42接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 248 * LLW + 40, 216 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 427,
			init = "",
		},
		{--触发条件
			{
				{"接取任务事件", 42},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "每日签到员"},
			},
			{
				{"激活任务事件", 42},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 42},
			},
		},
	},
	["任务32交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 428,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 32},
				{"点击NPC文字事件", " 「领取」"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 32},
			},
			{
				{"打开引导事件", "任务32交任务1"},
			},
			{
				{"打开引导事件", "任务32交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 32},
			},
		},
	},
	["任务53确认合成2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"MessageBox", 180, 200, 100, 60, 1904100071, true, 1, 0, "\n\n     #OFFSET<X:0,Y:-8>##COLORCOLOR_SKYBLUE#[确认]#COLOREND#",
			},
			delay = 100,
			flag = 429,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 53},
				{"关闭引导事件", "任务53确认合成"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 53},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 53},
			},
		},
	},
	["任务55003交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 30, 300, 100, 60, 1904100071, true, 1, 0, " \n\n    #OFFSET<X:0,Y:-10>##COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 430,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 55},
				{"激活任务", 55003},
				{"点击NPC文字事件", "提交  [废弃矿洞]"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 55},
			},
			{
				{"打开引导事件", "任务55交任务1"},
			},
			{
				{"打开引导事件", "任务55交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55},
			},
		},
	},
	["任务34经验悬赏点任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 160, 180, 100, 60, 1904100071, true, 1, 0, "\n\n  #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[点击任务名]#COLOREND#",
			},
			delay = 100,
			flag = 431,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "领取[经验悬赏]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
			{
				{"打开引导事件", "任务34经验悬赏点刷新"},
			},
		},
		{--完成条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
			{
				{"接取任务", 34},
				{"打开引导事件", "任务34经验悬赏点刷新"},
			},
		},
	},
	["任务34经验悬赏点刷新"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 160, 180, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[点击刷新]#COLOREND#",
			},
			delay = 100,
			flag = 432,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[刷新任务]"},
			},
			{
				{"打开引导事件", "任务34经验悬赏点领取任务"},
			},
		},
		{--完成条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[刷新任务]"},
			},
			{
				{"接取任务", 34},
				{"打开引导事件", "任务34经验悬赏点领取任务"},
			},
		},
	},
	["任务34经验悬赏点领取任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 160, 180, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[领取任务]#COLOREND#",
			},
			delay = 100,
			flag = 433,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[刷新任务]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[领取任务]"},
			},
			{
				{"打开引导事件", "任务34经验悬赏点立即完成"},
			},
		},
		{--完成条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[领取任务]"},
			},
		},
	},
	["任务34经验悬赏点立即完成"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 160, 180, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[立即完成]#COLOREND#",
			},
			delay = 100,
			flag = 434,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[领取任务]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[立即完成]"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 34},
			},
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[立即完成]"},
			},
		},
	},
	["任务34经验悬赏交主线任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 435,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"关闭引导事件", "任务34经验悬赏点立即完成"},
			},
			{
				{"接取任务", 34},
				{"关闭引导事件", "任务34经验悬赏交任务3"},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务34交任务1"},
			},
			{
				{"打开引导事件", "任务34交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 34},
			},
		},
	},
	["任务34经验悬赏交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 280, 130, 100, 60, 1904100071, true, 1, 0, "\n      提交\n   #COLORCOLOR_GOLD#[经验悬赏]#COLOREND#",
			},
			delay = 100,
			flag = 436,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"激活任务", 10001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50012},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
		},
	},
	["任务34经验悬赏交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 150, 185, 100, 60, 1904100071, true, 1, 0, "\n      完成\n   #COLORCOLOR_GOLD#[经验悬赏]#COLOREND#",
			},
			delay = 100,
			flag = 437,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"激活任务", 10001},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20001},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30001},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40001},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50001},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10002},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20002},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30002},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40002},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50002},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10004},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20004},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30004},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40004},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50004},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10009},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20009},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30009},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40009},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50009},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10010},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20010},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30010},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40010},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50010},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10012},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20012},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30012},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40012},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50012},
				{"点击NPC文字事件", "完成[经验悬赏]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[完成任务]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 34},
				{"点击NPC文字事件", "[完成任务]"},
			},
		},
	},
["任务34经验悬赏交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 438,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 34},
				{"激活任务", 10001},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20001},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30001},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40001},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50001},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10002},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20002},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30002},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40002},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50002},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10004},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20004},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30004},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40004},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50004},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10009},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20009},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30009},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40009},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50009},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10010},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20010},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30010},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40010},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50010},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 10012},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 20012},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 30012},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 40012},
				{"点击NPC文字事件", "[完成任务]"},
			},
			{
				{"接取任务", 34},
				{"激活任务", 50012},
				{"点击NPC文字事件", "[完成任务]"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 34},
			},
			{
				{"打开引导事件", "任务34交任务1"},
			},
			{
				{"打开引导事件", "任务34交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 34},
			},
			{
				{"打开引导事件", "任务34交任务1"},
			},
			{
				{"打开引导事件", "任务34交任务2"},
			},
		},
	},
["任务44金币悬赏点任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 160, 180, 100, 60, 1904100071, true, 1, 0, "\n\n  #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[点击任务名]#COLOREND#",
			},
			delay = 100,
			flag = 439,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "领取[金币悬赏]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
		},
	},
	--[[["任务44金币悬赏点刷新"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 170, 180, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[点击刷新]#COLOREND#",
			},
			delay = 100,
			flag = 440,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[刷新任务]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[刷新任务]"},
			},
		},
	},]]
	["任务44金币悬赏点领取任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 160, 180, 100, 60, 1904100071, true, 1, 0, "\n\n   #OFFSET<X:0,Y:-8>##COLORCOLOR_GOLD#[领取任务]#COLOREND#",
			},
			delay = 100,
			flag = 441,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐毒蛇谷]"},
			},
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐妖玛森林]"},
			},
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[讨伐废弃矿洞]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[领取任务]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[领取任务]"},
			},
		},
	},
	["任务44金币悬赏交主线任务"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 442,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"关闭引导事件", "任务34经验悬赏点立即完成"},
			},
		},
		{--关闭条件
			{
				{"完成任务事件", 44},
			},
			{
				{"打开引导事件", "任务44交任务1"},
			},
			{
				{"打开引导事件", "任务44交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 44},
			},
			{
				{"打开引导事件", "任务44交任务1"},
			},
			{
				{"打开引导事件", "任务44交任务2"},
			},
		},
	},
	["任务44金币悬赏交任务1"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 280, 180, 100, 60, 1904100071, true, 1, 0, "\n      提交\n   #COLORCOLOR_GOLD#[金币悬赏]#COLOREND#",
			},
			delay = 100,
			flag = 443,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"激活任务", 11001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51001},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51002},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51004},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51009},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51010},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41012},
				{"打开NPC事件", "天机老人"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51012},
				{"打开NPC事件", "天机老人"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
		},
	},
	["任务44金币悬赏交任务2"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 150, 185, 100, 60, 1904100071, true, 1, 0, "\n      完成\n   #COLORCOLOR_GOLD#[金币悬赏]#COLOREND#",
			},
			delay = 100,
			flag = 445,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 44},
				{"激活任务", 11001},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21001},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31001},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41001},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51001},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11002},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21002},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31002},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41002},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51002},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11004},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21004},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31004},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41004},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51004},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11009},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21009},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31009},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41009},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51009},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11010},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21010},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31010},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41010},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51010},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 11012},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 21012},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 31012},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 41012},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
			{
				{"接取任务", 44},
				{"激活任务", 51012},
				{"点击NPC文字事件", "完成[金币悬赏]"},
			},
		},
		{--关闭条件
			{
				{"点击NPC文字事件", "[完成任务]"},
			},
		},
		{--完成条件
			{
				{"接取任务", 44},
				{"点击NPC文字事件", "[完成任务]"},
			},
		},
	},
	["任务44金币悬赏交任务3"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"NpcTalk", 10, 295, 100, 60, 1904100071, true, 1, 0, " \n 点击这里\n#COLORCOLOR_SKYBLUE#[提交任务]#COLOREND#",
			},
			delay = 100,
			flag = 446,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "任务44金币悬赏交任务2"},
			},
		},
		{--关闭条件
			{
				{"打开引导事件", "任务44交任务1"},
			},
			{
				{"打开引导事件", "任务44交任务2"},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 44},
			},
		},
	},
	["任务56指向日常"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"GameMainInterface,SkillBar,Skill0", -125, -155, 100, 60, 1904100071, true, 2, 0, "\n  #COLORCOLOR_SKYBLUE#[查看日常]#COLOREND#\n每天可以做的事",
			},
			delay = 100,
			flag = 447,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 56},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 56},
			},
			{
				{"打开面板事件", "NpcTalk"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 56},
			},
		},
	},
	["任务55接任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 200,
			flag = 448,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 55},
				{"关闭引导事件", "任务55接任务传送"},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"完成任务事件", 55},
			},
			{
				{"放弃任务事件", 55},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 55},
			},
		},
	},
	["任务55激活任务后点NPC"] = 
	{
		{--显示
			type = 2,
			data = 
			{
			100100060, 224 * LLW + 40, 298 * LLH - 50, 0, 0,
			},
			delay = 200,
			flag = 449,
			init = "",
		},
		{--触发条件
			{
				{"激活任务", 55},
				{"关闭引导事件", "任务55003传送2"},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "装备合成大师"},
			},
			{
				{"完成任务事件", 55},
			},
			{
				{"放弃任务事件", 55},
			},
		},
		{--完成条件
			{
				{"完成任务事件", 55},
			},
		},
	},
	["任务15从包裹放入神羽"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"Package", -80, 90, 100, 60, 1904100071, true, 1, 0, " \n右键点击放入#COLORCOLOR_SKYBLUE#[神羽]#COLOREND#",
			},
			delay = 100,
			flag = 450,
			pre_script = "UI:Lua_OpenGameFormDlg(\"包裹\", 598, 320); GuideFunc.rectify_open(\"翅膀升级\", 0, 150);",
			param = "神羽",
			init = "GuideFunc.PkgRectifyPos",
		},
		{--触发条件
			{
				{"接取任务", 15},
				{"点击NPC文字事件", "[翅膀升阶]"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 15},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 15},
			},
		},
	},
	["任务15点确认升阶"] = 
	{
		{--显示
			type = 1,
			data = 
			{
			"翅膀升级", 60, 460, 100, 60, 1904100071, true, 1, 0, " \n点击#COLORCOLOR_SKYBLUE#[确定升阶]#COLOREND#",
			},
			delay = 100,
			flag = 451,
			init = "",
		},
		{--触发条件
			{
				{"关闭引导事件", "任务15从包裹放入神羽"},
			},
		},
		{--关闭条件
			{
				{"激活任务事件", 15},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 15},
			},
		},
	},
	--[[["任务46引导点击荣耀女神"] = 
	{
		{--显示
			type = 1,
			type = 2,
			data = 
			{
			100100060, 33 * LLW + 40, 44 * LLH - 50, 0, 0,
			},
			delay = 100,
			flag = 448,
			init = "",
		},
		{--触发条件
			{
				{"接取任务", 46},
				{"点击NPC文字事件", "[进入战场]"},
			},
		},
		{--关闭条件
			{
				{"打开NPC事件", "荣耀女神"},
			},
		},
		{--完成条件
			{
				{"激活任务事件", 46},
			},
		},
	},]]
}

--ENEND--
