--TD守卫出生位置

TD_monster =
{

	{74, 37, 0,"秘境神石", 1},

}

--出生坐标x，出生坐标y，怪物KeyName，怪物数量
--初级TD怪物出生点_第一波
TD_mbron_1_1 =
{
	{30, 81, 5, "封印破坏者1", 1},  --左出生点
}

--初级TD怪物出生点_第二波
TD_mbron_2_1 =
{
	{30, 81, 5, "封印破坏者2", 1},  --左出生点
}

--初级TD怪物出生点_第三波
TD_mbron_3_1 =
{
	{30, 81, 5, "封印破坏者3", 1},  --左出生点
}

--初级TD怪物出生点_第四波
TD_mbron_4_1 =
{
	{30, 81, 5, "封印破坏者4", 1},  --左出生点
}

--初级TD怪物出生点_第五波
TD_mbron_5_1 =
{
	{30, 81, 5, "封印破坏者5", 1},  --左出生点
}

--初级TD怪物出生点_第六波奖励怪
TD_mbron_6_1 =
{
	{30, 81, 5, "封印寻宝者1", 1},  --左出生点
}

--初级TD怪物出生点_第七波——头目
TD_mbron_7_1 =
{
	{30, 81, 5, "封印破坏者7", 1}, --左出生点
}

--初级TD怪物出生点_第八波——BOSS
TD_mbron_8_1 =
{
    {30, 81, 5, "封印破坏者8", 1},  --左出生点
}



--高级TD怪物出生点_第一波
TD_mbron_1_2 =
{
	{30, 81, 5, "秘境破坏者1", 1},  --左出生点
}

--高级TD怪物出生点_第二波
TD_mbron_2_2 =
{
	{30, 81, 5, "秘境破坏者1", 1},  --左出生点
}

--高级TD怪物出生点_第三波
TD_mbron_3_2 =
{
	{30, 81, 5, "秘境破坏者3", 1},  --左出生点
}

--高级TD怪物出生点_第四波
TD_mbron_4_2 =
{
	{30, 81, 5, "秘境破坏者3", 1},  --左出生点
}

--高级TD怪物出生点_第五波
TD_mbron_5_2 =
{
	{30, 81, 5, "秘境破坏者5", 1},  --左出生点
}

--高级TD怪物出生点_第六波奖励怪
TD_mbron_6_2 =
{
	{30, 81, 5, "秘境寻宝者1", 1},  --左出生点
}

--高级TD怪物出生点_第七波——头目
TD_mbron_7_2 =
{
	{30, 81, 5, "秘境破坏者7", 1}, --左出生点
}

--高级TD怪物出生点_第八波——BOSS
TD_mbron_8_2 =
{
    {30, 81, 5, "秘境破坏者8", 1},  --左出生点
}

path = {34,77, 38,73 ,42,69, 46,65, 50,61, 54,57, 58,53, 62,49, 66,45, 70,41}